
local 战斗 = {
    是否惩罚 = false --死亡
}

function 战斗:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 2292,
        名称 = "土",
        等级 = 等级,
        气血 = 200000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 400+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 70,
                抗封印 = 70,
            抗昏睡 = 70,
            加强混乱 = 5,
            忽视抗混 = 5,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 15000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2288,
        名称 = "金",
        等级 = 等级,
        气血 = 200000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 400+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 70,
                抗封印 = 70,
            抗昏睡 = 70,
            加强混乱 = 5,
            忽视抗混 = 5,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "阎罗追命", 熟练度 = 15000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2289,
        名称 = "木",
        等级 = 等级,
        气血 = 200000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 400+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 70,
                抗封印 = 70,
            抗昏睡 = 70,
            加强毒 = 15,
            忽视抗毒 = 15,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "万毒攻心", 熟练度 = 15000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2290,
        名称 = "水",
        等级 = 等级,
        气血 = 200000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 400+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 70,
                抗封印 = 70,
            抗昏睡 = 70,
            加强水 = 15,
            忽视抗水 = 5,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "九龙冰封", 熟练度 = 15000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2291,
        名称 = "火",
        等级 = 等级,
        气血 = 200000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 400+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 70,
                抗封印 = 70,
            抗昏睡 = 70,
            加强火 = 25,
            忽视抗火 = 5,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "九阴纯火", 熟练度 = 15000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))
end
function 战斗:进场喊话()
    local dd = self:取对象(101)
    if dd then
        dd:当前喊话("阎魔罗王,作地狱主,兄治男事,妹理女事")
    end
end
function 战斗:战斗回合开始(v)
end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

function 战斗:战斗结束(v)

end

return 战斗
