
local 战斗 = {
    是否惩罚 = false --死亡
}

function 战斗:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 2169,
        名称 = "精卫",
        染色 = 0x03030303,
        等级 = 等级,
        气血 = 1000000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 1000+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
            抗昏睡 = 110,
            加强火 = 15,
            忽视抗火 = 10,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "含情脉脉", 熟练度 = 20000 },
            { 名称 = "阎罗追命", 熟练度 = 20000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 41,
        名称 = "休门",
        等级 = 等级,
        气血 = 1000000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 1000+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
            抗昏睡 = 110,
            加强火 = 15,
            忽视抗火 = 10,
            加强水 = 15,
            忽视抗水 = 10,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "九阴纯火", 熟练度 = 20000 },
            { 名称 = "九龙冰封", 熟练度 = 20000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 53,
        名称 = "开门",
        等级 = 等级,
        气血 = 1000000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 1000+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
            抗昏睡 = 110,
            加强火 = 15,
            忽视抗火 = 10,
            加强水 = 15,
            忽视抗水 = 10,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "九阴纯火", 熟练度 = 20000 },
            { 名称 = "九龙冰封", 熟练度 = 20000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 55,
        名称 = "生门",
        等级 = 等级,
        气血 = 1000000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 1000+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
            抗昏睡 = 110,
            加强火 = 15,
            忽视抗火 = 10,
            加强水 = 15,
            忽视抗水 = 10,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "阎罗追命", 熟练度 = 20000 },
            { 名称 = "乾坤借速", 熟练度 = 20000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 51,
        名称 = "伤门",
        等级 = 等级,
        气血 = 1000000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 1000+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
            抗昏睡 = 110,
            加强混乱 = 15,
            忽视抗混 = 10,
            加强封印 = 15,
            忽视抗封 = 10,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 20000 },
            { 名称 = "四面楚歌", 熟练度 = 20000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 52,
        名称 = "杜门",
        等级 = 等级,
        气血 = 1000000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 1000+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
            抗昏睡 = 110,
            加强封印 = 15,
            忽视抗封 = 10,
            加强毒 = 15,
            忽视抗毒 = 10,
            加强毒伤害=1000,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "万毒攻心", 熟练度 = 20000 },
            { 名称 = "四面楚歌", 熟练度 = 20000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(6, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 40,
        名称 = "景门",
        等级 = 等级,
        气血 = 1000000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 1000+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
            抗昏睡 = 110,
            加强火 = 15,
            忽视抗火 = 10,
            加强水 = 15,
            忽视抗水 = 10,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "九阴纯火", 熟练度 = 20000 },
            { 名称 = "九龙冰封", 熟练度 = 20000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(7, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 50,
        名称 = "死门",
        等级 = 等级,
        气血 = 1000000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 1000+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
            抗昏睡 = 110,
            加强火 = 15,
            忽视抗火 = 10,
            加强水 = 15,
            忽视抗水 = 10,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "九阴纯火", 熟练度 = 20000 },
            { 名称 = "九龙冰封", 熟练度 = 20000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(8, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 54,
        名称 = "惊门",
        等级 = 等级,
        气血 = 1000000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 30000+等级*10+转生*100,
        速度 = 1000+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
            抗昏睡 = 110,
            加强火 = 15,
            忽视抗火 = 10,
            加强水 = 15,
            忽视抗水 = 10,
            连击率 = 75,
                连击次数 = 5,
                反击率 = 60,
            反击次数 = 1,
            致命几率=75,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            
        },
        施法几率 = 0,
        是否消失 = false,
    }
    self:加入敌方(9, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 46,
        名称 = "小仙帝",
        等级 = 等级,
        气血 = 1000000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 30000+等级*10+转生*100,
        速度 = 1000+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
            抗昏睡 = 110,
            加强火 = 15,
            忽视抗火 = 10,
            加强水 = 15,
            忽视抗水 = 10,
            连击率 = 75,
                连击次数 = 5,
                反击率 = 60,
            反击次数 = 1,
            致命几率=75,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            
        },
        施法几率 = 0,
        是否消失 = false,
    }
    self:加入敌方(10, 生成战斗怪物(怪物属性))
end
function 战斗:进场喊话()

end
function 战斗:战斗回合开始(v)
end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

function 战斗:战斗结束(v)

end

return 战斗
