
local 战斗 = {
    是否惩罚 = false --死亡
}

function 战斗:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 2315,
        名称 = "心",
        等级 = 等级,
        气血 = 400000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 600+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 90,
                抗封印 = 90,
            抗昏睡 = 90,
            加强混乱 = 15,
            忽视抗混 = 10,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 15000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2300,
        名称 = "善",
        等级 = 等级,
        气血 = 400000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 600+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 90,
                抗封印 = 90,
            抗昏睡 = 90,
            加强混乱 = 15,
            忽视抗混 = 10,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 15000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2300,
        名称 = "美",
        等级 = 等级,
        气血 = 400000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 600+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 90,
                抗封印 = 90,
            抗昏睡 = 90,
            加强混乱 = 15,
            忽视抗混 = 10,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "阎罗追命", 熟练度 = 15000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2303,
        名称 = "恶",
        等级 = 等级,
        气血 = 400000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 600+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 90,
                抗封印 = 90,
            抗昏睡 = 90,
            加强混乱 = 15,
            忽视抗混 = 10,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "含情脉脉", 熟练度 = 15000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2303,
        名称 = "丑",
        等级 = 等级,
        气血 = 400000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 600+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 90,
                抗封印 = 90,
            抗昏睡 = 90,
            加强混乱 = 15,
            忽视抗混 = 10,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "三味真火", 熟练度 = 15000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2300,
        名称 = "真",
        等级 = 等级,
        气血 = 400000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 600+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 90,
                抗封印 = 90,
            抗昏睡 = 90,
            加强混乱 = 15,
            忽视抗混 = 10,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "天罗地网", 熟练度 = 15000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(6, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 2303,
        名称 = "伪",
        等级 = 等级,
        气血 = 400000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 600+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 90,
                抗封印 = 90,
            抗昏睡 = 90,
            加强混乱 = 15,
            忽视抗混 = 10,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "乾坤借速", 熟练度 = 15000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(7, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 2303,
        名称 = "嗔",
        等级 = 等级,
        气血 = 400000+等级*1000+转生*10000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 1000+等级*10+转生*100,
        速度 = 600+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 90,
                抗封印 = 90,
            抗昏睡 = 90,
            加强混乱 = 15,
            忽视抗混 = 10,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "太乙生风", 熟练度 = 15000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(8, 生成战斗怪物(怪物属性))
end
function 战斗:进场喊话()

end
function 战斗:战斗回合开始(v)
end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

function 战斗:战斗结束(v)

end

return 战斗
