local 战斗 = {
    是否惩罚 = false --死亡
}


--===============================================

function 战斗:战斗初始化(玩家, NPC)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性 = {}
    怪物属性 = {
        外形 = NPC.外形,
        名称 = NPC.名称,
        等级 = 等级,
        气血 = 3802554 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = 2290,
        抗性 = {
            物理吸收 = 39,
            抗震慑 = 22,
            抗封印 = 120,
            抗混乱 = 110,
            抗昏睡 = 105,
            加强水 = 200,
            忽视抗水 = 150,
            抗风 = 60,
            抗火 = -60,
            抗水 = 100,
            抗雷 = -60,
            水法反击 = 75,
        },
        技能 = {
            { 名称 = "九龙冰封", 熟练度 = 25000 },
            { 名称 = "九龙冰封", 熟练度 = 25000 },
            { 名称 = "九龙冰封", 熟练度 = 25000 },
            { 名称 = "蛟龙出海", 熟练度 = 25000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))

    怪物属性 = {
        名称 = "龟丞相",
        外形 = 2064,
        等级 = 等级,
        气血 = 3065424 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = 1980,
        抗性 = {
            物理吸收 = 45,
            抗震慑 = 27,
            抗封印 = 120,
            抗混乱 = 110,
            抗昏睡 = 105,
            加强封印 = 50,
            加强混乱 = 30,
            加强昏睡 = 30,
            忽视抗封 = 30,
            忽视抗睡 = 22,
            忽视抗混 = 22,
            抗风 = 10,
            抗火 = 10,
            抗水 = 10,
            抗雷 = 10,
            反震几率 = 75,
            反震程度 = 75,
            风法反击 = 15,
            水法反击 = 15,
        },
        技能 = {
            { 名称 = "四面楚歌", 熟练度 = 25000 },
            { 名称 = "失心狂乱", 熟练度 = 25000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))

    怪物属性 = {
        名称 = "龟丞相",
        外形 = 2064,
        等级 = 等级,
        气血 = 3065424 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = 1870,
        抗性 = {
            物理吸收 = 49,
            抗震慑 = 36,
            抗封印 = 120,
            抗混乱 = 110,
            抗昏睡 = 105,
            加强封印 = 30,
            加强混乱 = 50,
            加强昏睡 = 30,
            忽视抗封 = 22,
            忽视抗睡 = 22,
            忽视抗混 = 30,
            抗风 = -60,
            抗火 = -60,
            抗水 = 20,
            抗雷 = 20,
            反震几率 = 75,
            反震程度 = 75,
            风法反击 = 15,
            雷法反击 = 15,
            被攻击时释放含情脉脉 = 75,
        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 25000 },
            { 名称 = "四面楚歌", 熟练度 = 25000 },
        },
        施法几率 = 100,
        是否消失 = false,

    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))

    怪物属性 = {
        名称 = "水灵仙",
        外形 = 2100,
        等级 = 等级,
        气血 = 3065424 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 54584 + 转生 * 1200 + 等级 * 100,
        速度 = 2100,
        抗性 = {
            物理吸收 = 69,
            抗震慑 = 44,
            抗封印 = 120,
            抗混乱 = 110,
            抗昏睡 = 105,
            附加震慑攻击 = 50,
            连击率 = 75,
            连击次数 = 9,
            反击率 = 75,
            反击次数 = 3,
            抗风 = 56,
            抗火 = 56,
            抗水 = 56,
            抗雷 = 56,
            忽视防御几率 = 75,
            忽视防御程度 = 75,
            命中率 = 80,
            狂暴几率 = 80,
            致命几率 = 80,
            被攻击时释放魔神附身 = 15
        },
        技能 = {
            { 名称 = "魔神附身", 熟练度 = 25000 },
            { 名称 = "魔神附身", 熟练度 = 25000 },
            { 名称 = "魔神附身", 熟练度 = 25000 },
            { 名称 = "兽王之力", 熟练度 = 25000 },
        },
        施法几率 = 5,
        是否消失 = false,
    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))

    怪物属性 = {
        名称 = "水灵仙",
        外形 = 2100,
        等级 = 等级,
        气血 = 3065424 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 54584 + 转生 * 1200 + 等级 * 100,
        速度 = 2100,
        抗性 = {
            物理吸收 = 69,
            抗震慑 = 44,
            抗封印 = 120,
            抗混乱 = 110,
            抗昏睡 = 105,
            附加震慑攻击 = 50,
            连击率 = 75,
            连击次数 = 9,
            反击率 = 75,
            反击次数 = 3,
            抗风 = 56,
            抗火 = 56,
            抗水 = 56,
            抗雷 = 56,
            忽视防御几率 = 75,
            忽视防御程度 = 75,
            命中率 = 80,
            狂暴几率 = 80,
            致命几率 = 80,
            被攻击时释放魔神附身 = 15
        },
        技能 = {
            { 名称 = "魔神附身", 熟练度 = 25000 },
            { 名称 = "魔神附身", 熟练度 = 25000 },
            { 名称 = "魔神附身", 熟练度 = 25000 },
            { 名称 = "兽王之力", 熟练度 = 25000 },
        },
        施法几率 = 5,
        是否消失 = false,
    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))

    怪物属性 = {
        名称 = "天官",
        外形 = 2126,
        等级 = 等级,
        气血 = 3065424 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = 1870,
        抗性 = {
            物理吸收 = 39,
            抗震慑 = 22,
            抗封印 = 120,
            抗混乱 = 110,
            抗昏睡 = 105,
            加强水 = 200,
            忽视抗水 = 100,
            抗风 = 60,
            抗火 = -60,
            抗水 = 100,
            抗雷 = -60,
            水法反击 = 75,
        },
        技能 = {
            { 名称 = "九龙冰封", 熟练度 = 25000 },
            { 名称 = "九龙冰封", 熟练度 = 25000 },
            { 名称 = "九龙冰封", 熟练度 = 25000 },
            { 名称 = "蛟龙出海", 熟练度 = 25000 }
        },
        施法几率 = 100,
        是否消失 = false,

    }
    self:加入敌方(6, 生成战斗怪物(怪物属性))

    怪物属性 = {
        名称 = "蛟龙",
        外形 = 2070,
        等级 = 等级,
        气血 = 3065424 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = 1870,
        抗性 = {
            物理吸收 = 39,
            抗震慑 = 22,
            抗封印 = 120,
            抗混乱 = 110,
            抗昏睡 = 105,
            加强水 = 200,
            忽视抗水 = 100,
            抗风 = 60,
            抗火 = -60,
            抗水 = 100,
            抗雷 = -60,
            水法反击 = 75,
        },
        技能 = {
            { 名称 = "九龙冰封", 熟练度 = 25000 },
            { 名称 = "九龙冰封", 熟练度 = 25000 },
            { 名称 = "九龙冰封", 熟练度 = 25000 },
            { 名称 = "蛟龙出海", 熟练度 = 25000 }
        },
        施法几率 = 100,
        是否消失 = false,

    }
    self:加入敌方(7, 生成战斗怪物(怪物属性))

    怪物属性 = {
        名称 = "蛟龙",
        外形 = 2070,
        等级 = 等级,
        气血 = 3065424 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = -60,
        抗性 = {
            物理吸收 = 39,
            抗震慑 = 22,
            抗封印 = 120,
            抗混乱 = 110,
            抗昏睡 = 105,
            加强水 = 300,
            忽视抗水 = 200,
            抗风 = 60,
            抗火 = -60,
            抗水 = 100,
            抗雷 = -60,
            水法反击 = 75,
        },
        技能 = {
            { 名称 = "九龙冰封", 熟练度 = 25000 },
            { 名称 = "九龙冰封", 熟练度 = 25000 },
            { 名称 = "九龙冰封", 熟练度 = 25000 },
            { 名称 = "蛟龙出海", 熟练度 = 25000 }
        },
        施法几率 = 100,
        是否消失 = false,

    }
    self:加入敌方(8, 生成战斗怪物(怪物属性))
    怪物属性 = {
        名称 = "蛟龙",
        外形 = 2070,
        等级 = 等级,
        气血 = 3065424 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 39954 + 转生 * 1200 + 等级 * 100,
        速度 = 2351,
        抗性 = {
            物理吸收 = 45,
            抗震慑 = 27,
            抗封印 = 120,
            抗混乱 = 110,
            抗昏睡 = 105,
            附加震慑攻击 = 50,
            连击率 = 75,
            连击次数 = 9,
            反击率 = 75,
            反击次数 = 3,
            抗风 = 60,
            抗火 = 60,
            抗水 = -20,
            抗雷 = -20
        },
        技能 = {
            { 名称 = "阎罗追命", 熟练度 = 25000 },
            { 名称 = "乾坤借速", 熟练度 = 25000 },
        },
        施法几率 = 80,
        是否消失 = false,
    }
    self:加入敌方(9, 生成战斗怪物(怪物属性))

    怪物属性 = {
        名称 = "蛟龙",
        外形 = 2070,
        等级 = 等级,
        气血 = 3065424 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 39954 + 转生 * 1200 + 等级 * 100,
        速度 = 2800,
        抗性 = {
            物理吸收 = 10,
            抗震慑 = 60,
            抗封印 = 120,
            抗混乱 = 110,
            抗昏睡 = 105,
            附加震慑攻击 = 50,
            连击率 = 75,
            连击次数 = 9,
            反击率 = 75,
            反击次数 = 3,
            抗风 = -60,
            抗火 = -60,
            抗水 = 20,
            抗雷 = 20
        },
        技能 = {
            { 名称 = "阎罗追命", 熟练度 = 25000 },
            { 名称 = "含情脉脉", 熟练度 = 25000 },
        },
        施法几率 = 80,
        是否消失 = false,
    }
    self:加入敌方(10, 生成战斗怪物(怪物属性))












end

function 战斗:进场喊话()

end

function 战斗:战斗回合开始(v)

end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

local function 掉落包(玩家)
    local r = 玩家:取任务("为爱逆天")
    if r and r.进度 == 1 then
        r:击杀水德星君(玩家)
    end
end

function 战斗:战斗结束(s)
    if s then
        for k, v in self:遍历我方() do
            if v.是否玩家 then
                掉落包(v.对象.接口)
            end
        end
    end
end

return 战斗
