-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-26 07:12:31
-- @Last Modified time  : 2024-09-09 19:53:35

local 战斗 = {
    是否惩罚 = false --死亡
}


--===============================================
local _小怪物属性 = {

    { 名称 = "天关破军魔卫", 外形 = 2131,
        气血 = function(等级, 转生)
            return 224369 + 等级 * 12700
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 26874 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return 260 + 等级 * 5
        end,
        抗性 = {
            物理吸收 = 59,
            抗震慑 = 30,
            抗风 = 15 + 180 * 0.1,
            抗火 = 15 + 180 * 0.1,
            抗水 = 15 + 180 * 0.1,
            抗雷 = 15 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 20 + 180 * 0.1,
            加强混乱 = 20,
            忽视抗混 = 18,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        施法几率 = 50,
        是否消失 = false,
        技能 = { { 名称 = '九阴纯火', 熟练度 = 25000 }, },

    },
    { 名称 = "混乱魔卫", 外形 = 2367,
        气血 = function(等级, 转生)
            return 224369 + 等级 * 12700
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 26874 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return 260 + 等级 * 5
        end,
        抗性 = {
            物理吸收 = 59,
            抗震慑 = 30,
            抗风 = 15 + 180 * 0.1,
            抗火 = 15 + 180 * 0.1,
            抗水 = 15 + 180 * 0.1,
            抗雷 = 15 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 20 + 180 * 0.1,
            加强混乱 = 20,
            忽视抗混 = 18,
            反击率 = 100,
            反击次数 = 3,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        技能 = { { 名称 = '借刀杀人', 熟练度 = 25000 }, },
        施法几率 = 50,
        是否消失 = false,
    },
    { 名称 = "丹元廉贞魔卫", 外形 = 2103,
        气血 = function(等级, 转生)
            return 224369 + 等级 * 12700
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 11 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return 260 + 等级 * 5
        end,
        抗性 = {

            物理吸收 = 59,
            抗震慑 = 30,
            抗风 = 15 + 180 * 0.1,
            抗火 = 15 + 180 * 0.1,
            抗水 = 15 + 180 * 0.1,
            抗雷 = 15 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗中毒伤害 = 1,
            抗鬼火 = 20 + 180 * 0.1,
            加强昏睡 = 20,
            忽视抗睡 = 18,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        技能 = { { 名称 = '迷魂醉', 熟练度 = 25000 }, },
        施法几率 = 50,
        是否消失 = false,
    },

    { 名称 = "北极武曲魔卫", 外形 = 2072,
        气血 = function(等级, 转生)
            return 224369 + 等级 * 12700
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 25475 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return 160 + 等级 * 3
        end,
        抗性 = {
            物理吸收 = 59,
            抗震慑 = 30,
            抗风 = 15 + 180 * 0.1,
            抗火 = 15 + 180 * 0.1,
            抗水 = 15 + 180 * 0.1,
            抗雷 = 15 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 20 + 180 * 0.1,
            加强风 = 30,
            忽视抗风 = 20,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        技能 = { { 名称 = '袖里乾坤', 熟练度 = 25000 }, },
        施法几率 = 20,
        是否消失 = false,
    },

    { 名称 = "解空巨门魔卫", 外形 = 2006,
        气血 = function(等级, 转生)
            return 224369 + 等级 * 12700
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 190000 + 等级 * 190
        end,
        速度 = function(等级, 转生)
            return -800
        end,
        抗性 = {
            物理吸收 = 80,
            抗震慑 = 45,
            抗风 = 15 + 180 * 0.1,
            抗火 = 15 + 180 * 0.1,
            抗水 = 15 + 180 * 0.1,
            抗雷 = 15 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 20 + 180 * 0.1,
            忽视防御几率 = 100,
            忽视防御程度 = 100,
            狂暴几率 = 100,
            致命几率 = 100,
            命中率 = 100,
            连击率 = 100,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        技能 = { { 名称 = '魔神附身', 熟练度 = 25000 }, },
        施法几率 = 10,
        是否消失 = false,
    },
    { 名称 = "真人禄存魔卫", 外形 = 2291,
        气血 = function(等级, 转生)
            return 224369 + 等级 * 12700
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 25475 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return 160 + 等级 * 2
        end,
        抗性 = {
            物理吸收 = 80,
            抗震慑 = 45,
            抗风 = 15 + 180 * 0.1,
            抗火 = 15 + 180 * 0.1,
            抗水 = 15 + 180 * 0.1,
            抗雷 = 15 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 20 + 180 * 0.1,
            忽视防御几率 = 100,
            忽视防御程度 = 100,
            狂暴几率 = 100,
            致命几率 = 100,
            命中率 = 100,
            连击率 = 100,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        技能 = { { 名称 = '魔神附身', 熟练度 = 25000 }, },
        施法几率 = 10,
        是否消失 = false,
    },
    { 名称 = "北斗魔卫", 外形 = 2183,
        气血 = function(等级, 转生)
            return 224369 + 等级 * 12700
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 25475 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return 60 + 等级 * 2
        end,
        抗性 = {
            物理吸收 = 150,
            抗震慑 = 15,
            抗风 = 15 + 180 * 0.1,
            抗火 = 15 + 180 * 0.1,
            抗水 = 15 + 180 * 0.1,
            抗雷 = 15 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 20 + 180 * 0.1,
            加强鬼火 = 30,
            忽视鬼火 = 20,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        技能 = { { 名称 = '血海深仇', 熟练度 = 25000 }, },
        施法几率 = 50,
        是否消失 = false,
    },
    { 名称 = "玄冥文曲魔卫", 外形 = 2289,
        气血 = function(等级, 转生)
            return 224369 + 等级 * 12700
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 25475 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return 160 + 等级 * 3
        end,
        抗性 = {
            物理吸收 = 59,
            抗震慑 = 30,
            抗风 = 10 + 180 * 0.1,
            抗火 = 10 + 180 * 0.1,
            抗水 = 10 + 180 * 0.1,
            抗雷 = 10 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 20 + 180 * 0.1,
            加强火 = 30,
            忽视抗火 = 20,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        技能 = { { 名称 = '九阴纯火', 熟练度 = 25000 }, },
        施法几率 = 50,
        是否消失 = false,
    },



}
function 战斗:战斗初始化(玩家, NPC)
    local r = 玩家:取任务('日常_降魔任务')
    self.NPC_nid = NPC.nid
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    if NPC.名称 == "天眼魔尊" then
        怪物属性 = {
            外形 = 2018,
            名称 = "天眼魔尊",
            等级 = 等级,
            气血 = 254369 + 等级 * 13700,
            魔法 = 26000 + 等级 * 35,
            攻击 = 12311 + 等级 * 1020,
            速度 = 450 + 等级 * 5,
            抗性 = {
                物理吸收 = 60,
                抗震慑 = 35,
                抗混乱 = 110,
                抗昏睡 = 120,
                抗中毒 = 10 + 等级 * 0.015,
                抗鬼火 = 30 + 等级 * 0.1,
                抗风 = 30 + 等级 * 0.1,
                抗火 = 30 + 等级 * 0.1,
                抗水 = 30 + 等级 * 0.1,
                抗雷 = 30 + 等级 * 0.1,
                忽视抗风 = 50,
                加强风 = 60,
                风系狂暴几率 = 60,
                金 = 20,
                木 = 20,
                水 = 20,
                火 = 20,
                土 = 20,
            },
            技能 = {
                { 名称 = '袖里乾坤', 熟练度 = 转生 * 10000 }
            },
            施法几率 = 80,
            是否消失 = false,

        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))

    elseif NPC.名称 == "多闻魔尊" then
        怪物属性 = {
            外形 = 2127,
            名称 = "多闻魔尊",
            等级 = 等级,
            气血 = 254369 + 等级 * 13700,
            魔法 = 26000 + 等级 * 35,
            攻击 = 12311 + 等级 * 1020,
            速度 = 450 + 等级 * 5,
            抗性 = {
                物理吸收 = 60,
                抗震慑 = 35,
                抗混乱 = 110,
                抗昏睡 = 120,
                抗中毒 = 10 + 等级 * 0.015,
                抗鬼火 = 30 + 等级 * 0.1,
                抗风 = 30 + 等级 * 0.1,
                抗火 = 30 + 等级 * 0.1,
                抗水 = 30 + 等级 * 0.1,
                抗雷 = 30 + 等级 * 0.1,
                雷系狂暴几率 = 60,
                风系狂暴几率 = 60,
                水系狂暴几率 = 60,
                火系狂暴几率 = 60,
                加强雷 = 20,
                加强风 = 20,
                加强火 = 20,
                加强水 = 20,
                金 = 20,
                木 = 20,
                水 = 20,
                火 = 20,
                土 = 20,
            },
            技能 = {
                { 名称 = '天诛地灭', 熟练度 = 转生 * 10000 },
                { 名称 = '袖里乾坤', 熟练度 = 转生 * 10000 },
                { 名称 = '九龙冰封', 熟练度 = 转生 * 10000 },
                { 名称 = '九阴纯火', 熟练度 = 转生 * 10000 },

            },
            施法几率 = 80,
            是否消失 = false,

        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))

    elseif NPC.名称 == "神通魔尊" then
        怪物属性 = {
            外形 = 2126,
            名称 = "神通魔尊",
            等级 = 等级,
            气血 = 254369 + 等级 * 13700,
            魔法 = 26000 + 等级 * 35,
            攻击 = 12311 + 等级 * 1020,
            速度 = 450 + 等级 * 5,
            抗性 = {
                抗水 = 30 + 等级 * 0.1,
                抗雷 = 30 + 等级 * 0.1,
                物理吸收 = 60,
                抗震慑 = 35,
                抗混乱 = 110,
                抗昏睡 = 120,
                抗中毒 = 10 + 等级 * 0.015,
                抗鬼火 = 30 + 等级 * 0.1,
                抗风 = 30 + 等级 * 0.1,
                抗火 = 30 + 等级 * 0.1,
                加强雷 = 300,
                忽视抗雷 = 300,
                雷系狂暴几率 = 300,
                金 = 20,
                木 = 20,
                水 = 20,
                火 = 20,
                土 = 20,
            },
            技能 = {
                { 名称 = '电闪雷鸣', 熟练度 = 转生 * 10000 },


            },
            施法几率 = 90,
            是否消失 = false,

        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))
    elseif NPC.名称 == "智慧魔尊" then
        怪物属性 = {
            外形 = 2150,
            名称 = "智慧魔尊",
            等级 = 等级,
            气血 = 254369 + 等级 * 13700,
            魔法 = 26000 + 等级 * 35,
            攻击 = 12311 + 等级 * 1020,
            速度 = 450 + 等级 * 5,
            抗性 = {
                抗火 = 60 + 等级 * 0.1,
                物理吸收 = 60,
                抗震慑 = 35,
                抗混乱 = 110,
                抗昏睡 = 120,
                抗中毒 = 10 + 等级 * 0.015,
                抗鬼火 = 30 + 等级 * 0.1,
                抗风 = 30 + 等级 * 0.1,
                抗水 = 30 + 等级 * 0.1,
                抗雷 = 30 + 等级 * 0.1,
                火系狂暴几率 = 60,
                忽视抗火 = 50,
                加强火 = 60,
                金 = 20,
                木 = 20,
                水 = 20,
                火 = 20,
                土 = 20,
            },
            技能 = {
                { 名称 = '九阴纯火', 熟练度 = 转生 * 10000 },


            },
            施法几率 = 90,
            是否消失 = false,

        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))




    end

    local 战斗单位 = {}
    local t
    for n = 1, 8 do
        t = _小怪物属性[math.random(#_小怪物属性)]
        for k, v in pairs(t) do
            if type(v) == "function" then
                t[k] = v(等级, 转生)
            end
        end
        table.insert(战斗单位, t)
    end
    local gw
    for k, v in ipairs(战斗单位) do
        gw = 生成战斗怪物(v)
        self:加入敌方(k+1, gw)
    end


end

function 战斗:进场喊话()

end

function 战斗:战斗回合开始(v)

end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

function 战斗:战斗结束(s)
    if s then
        for k, v in self:遍历我方() do
            if v.是否玩家 then
                local r = v.对象.接口:取任务("日常_降魔任务")

                if r and r.NPC==self.NPC_nid then
                    r:完成(v.对象.接口)
                end
            end
        end
    end
end

return 战斗
