-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-26 07:12:31
-- @Last Modified time  : 2024-09-09 19:53:35

local 战斗 = {
    是否惩罚 = false --死亡
}


--===============================================
local _小怪物属性 = {

    { 名称 = "西域响马", 外形 = 6552,
        气血 = function(等级, 转生)
            return 154369 + 等级 * 7700
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 11 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return 150 + 等级 * 2
        end,
        抗性 = {
            物理吸收 = 45,
            抗震慑 = 25,
            抗混乱 = 80,
            抗昏睡 = 80,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 30 + 180 * 0.1,
            忽视抗风 = 50,
            加强风 = 60,
            风系狂暴几率 = 60,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        施法几率 = 50,
        是否消失 = false,
        技能 = { { 名称 = '袖里乾坤', 熟练度 = 20000 }, },

    },
    { 名称 = "呆头小虫", 外形 = 6553,
        气血 = function(等级, 转生)
            return 224369 + 等级 * 12700
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 110 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return 150 + 等级 * 2
        end,
        抗性 = {
            物理吸收 = 45,
            抗震慑 = 25,
            抗混乱 = 80,
            抗昏睡 = 80,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 30 + 180 * 0.1,
            雷系狂暴几率 = 60,
            风系狂暴几率 = 60,
            水系狂暴几率 = 60,
            火系狂暴几率 = 60,
            加强雷 = 20,
            加强风 = 20,
            加强火 = 20,
            加强水 = 20,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        技能 = {
            { 名称 = '天诛地灭', 熟练度 = 20000 },
            { 名称 = '袖里乾坤', 熟练度 = 20000 },
            { 名称 = '九龙冰封', 熟练度 = 20000 },
            { 名称 = '九阴纯火', 熟练度 = 20000 },
        },
        施法几率 = 50,
        是否消失 = false,
    },
    { 名称 = "粗放大鬼", 外形 = 6554,
        气血 = function(等级, 转生)
            return 224369 + 等级 * 12700
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 110 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return 150 + 等级 * 2
        end,
        抗性 = {

            物理吸收 = 45,
            抗震慑 = 25,
            抗水 = 30 + 180 * 0.1,
            抗雷 = 30 + 180 * 0.1,
            抗混乱 = 80,
            抗昏睡 = 80,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 30 + 180 * 0.1,
            加强雷 = 300,
            忽视抗雷 = 300,
            雷系狂暴几率 = 300,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        技能 = { { 名称 = '电闪雷鸣', 熟练度 = 20000 }, },
        施法几率 = 90,
        是否消失 = false,
    },





}
function 战斗:战斗初始化(玩家, NPC)
    local r = 玩家:取任务('日常_降魔任务')
    self.NPC_nid = NPC.nid
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性

    怪物属性 = {
        外形 = 2130,
        名称 = "奎木狼",
        等级 = 等级,
        气血 = 154369 + 等级 * 7700,
        魔法 = 26000 + 等级 * 35,
        攻击 = 110 + 等级 * 100,
        速度 = 350 + 等级 * 6,
        抗性 = {
            物理吸收 = 45,
            抗震慑 = 25,
            抗混乱 = 80,
            抗昏睡 = 80,
            抗中毒 = 10 + 等级 * 0.015,
            抗鬼火 = 30 + 等级 * 0.1,
            忽视抗风 = 50,
            加强风 = 60,
            风系狂暴几率 = 60,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        技能 = {
            { 名称 = '袖里乾坤', 熟练度 = 转生 * 10000 },


        },
        施法几率 = 90,
        是否消失 = false,

    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 62,
        名称 = "胄土雉",
        等级 = 等级,
        气血 = 154369 + 等级 * 7700,
        魔法 = 26000 + 等级 * 35,
        攻击 = 110 + 等级 * 100,
        速度 = 250 + 等级 * 5,
        抗性 = {
            物理吸收 = 45,
            抗震慑 = 25,
            抗混乱 = 80,
            抗昏睡 = 80,
            抗中毒 = 10 + 等级 * 0.015,
            抗鬼火 = 30 + 等级 * 0.1,
            雷系狂暴几率 = 60,
            风系狂暴几率 = 60,
            水系狂暴几率 = 60,
            火系狂暴几率 = 60,
            加强雷 = 20,
            加强风 = 20,
            加强火 = 20,
            加强水 = 20,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        技能 = {
            { 名称 = '天诛地灭', 熟练度 = 转生 * 10000 },
            { 名称 = '袖里乾坤', 熟练度 = 转生 * 10000 },
            { 名称 = '九龙冰封', 熟练度 = 转生 * 10000 },
            { 名称 = '九阴纯火', 熟练度 = 转生 * 10000 },
        },
        施法几率 = 50,
        是否消失 = false,

    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 52,
        名称 = "娄金狗",
        等级 = 等级,
        气血 = 154369 + 等级 * 7700,
        魔法 = 26000 + 等级 * 35,
        攻击 = 110 + 等级 * 100,
        速度 = 250 + 等级 * 6,
        抗性 = {
            物理吸收 = 45,
            抗震慑 = 25,
            抗水 = 30 + 等级 * 0.1,
            抗雷 = 30 + 等级 * 0.1,
            抗混乱 = 80,
            抗昏睡 = 80,
            抗中毒 = 10 + 等级 * 0.015,
            抗鬼火 = 30 + 等级 * 0.1,
            加强雷 = 300,
            忽视抗雷 = 300,
            雷系狂暴几率 = 300,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        技能 = {
            { 名称 = '电闪雷鸣', 熟练度 = 转生 * 10000 },

        },
        施法几率 = 90,
        是否消失 = false,

    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 14,
        名称 = "毕月乌",
        等级 = 等级,
        气血 = 154369 + 等级 * 7700,
        魔法 = 26000 + 等级 * 35,
        攻击 = 110 + 等级 * 100,
        速度 = 150 + 等级 * 4,
        抗性 = {
            物理吸收 = 45,
            抗震慑 = 25,
            抗火 = 60 + 等级 * 0.1,
            抗混乱 = 80,
            抗昏睡 = 80,
            抗中毒 = 10 + 等级 * 0.015,
            抗鬼火 = 30 + 等级 * 0.1,
            火系狂暴几率 = 60,
            忽视抗火 = 50,
            加强火 = 60,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        技能 = {
            { 名称 = '九阴纯火', 熟练度 = 转生 * 10000 },

        },
        施法几率 = 90,
        是否消失 = false,

    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))


    怪物属性 = {
        外形 = 53,
        名称 = "昂日鸡",
        等级 = 等级,
        气血 = 154369 + 等级 * 7700,
        魔法 = 26000 + 等级 * 35,
        攻击 = 110 + 等级 * 100,
        速度 = 150 + 等级 * 5,
        抗性 = {
            物理吸收 = 45,
            抗震慑 = 25,
            抗混乱 = 80,
            抗昏睡 = 80,
            抗中毒 = 10 + 等级 * 0.015,
            抗鬼火 = 30 + 等级 * 0.1,
            忽视防御几率 = 100,
            忽视防御程度 = 100,
            反击率 = 75,
            反击次数 = 3,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        技能 = {
            { 名称 = '含情脉脉', 熟练度 = 转生 * 10000 },

        },
        施法几率 = 50,
        是否消失 = false,

    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))


    怪物属性 = {
        外形 = 60,
        名称 = "参水猿",
        等级 = 等级,
        气血 = 154369 + 等级 * 7700,
        魔法 = 26000 + 等级 * 35,
        攻击 = 110 + 等级 * 100,
        速度 = 150 + 等级 * 4,
        抗性 = {
            物理吸收 = 45,
            抗震慑 = 25,
            抗风 = 10 + 等级 * 0.1,
            抗火 = 10 + 等级 * 0.1,
            抗水 = 10 + 等级 * 0.1,
            抗雷 = 10 + 等级 * 0.1,
            抗混乱 = 80,
            抗昏睡 = 80,
            抗中毒 = 10 + 等级 * 0.015,
            抗鬼火 = 30 + 等级 * 0.1,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        技能 = {
            { 名称 = '含情脉脉', 熟练度 = 转生 * 10000 },
            { 名称 = '失心狂乱', 熟练度 = 转生 * 10000 },
        },
        施法几率 = 50,
        是否消失 = false,

    }
    self:加入敌方(6, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 50,
        名称 = "梓火猴",
        等级 = 等级,
        气血 = 154369 + 等级 * 7700,
        魔法 = 26000 + 等级 * 35,
        攻击 = 110 + 等级 * 100,
        速度 = 150 + 等级 * 4,
        抗性 = {
            物理吸收 = 45,
            抗震慑 = 25,
            抗混乱 = 80,
            抗昏睡 = 80,
            抗中毒 = 10 + 等级 * 0.015,
            抗鬼火 = 30 + 等级 * 0.1,
            抗三尸虫 = 1,
            加强鬼火 = 50,
            加强遗忘 = 15,
            加强三尸虫 = 200,
            加强三尸虫回血程度 = 30,
            忽视遗忘 = 15,
            忽视抗鬼火 = 50,
            三尸虫狂暴几率 = 20,
            三尸虫狂暴程度 = 30,
            鬼火狂暴几率 = 30,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        技能 = {
            { 名称 = '血海深仇', 熟练度 = 转生 * 10000 },
            { 名称 = '吸星大法', 熟练度 = 转生 * 10000 },
            { 名称 = '孟婆汤', 熟练度 = 转生 * 10000 },
        },
        施法几率 = 50,
        是否消失 = false,

    }
    self:加入敌方(7, 生成战斗怪物(怪物属性))








end

function 战斗:进场喊话()

end

function 战斗:战斗回合开始(v)

end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

function 战斗:战斗结束(s)
    if s then
        for k, v in self:遍历我方() do
            if v.是否玩家 then
                local r = v.对象.接口:取任务("日常_降魔任务")

                if r and r.NPC == self.NPC_nid then
                    r:完成(v.对象.接口)
                end
            end
        end
    end
end

return 战斗
