-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-26 07:12:31
-- @Last Modified time  : 2024-09-09 19:53:35

local 战斗 = {
    是否惩罚 = false --死亡
}


--===============================================
local _小怪物属性 = {

    { 名称 = "龙族公主", 外形 = 2128,
        气血 = function(等级, 转生)
            return 125482 + 等级 * 5900
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 11 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return 180 + 等级 * 5
        end,
        抗性 = {
            物理吸收 = 49,
            抗震慑 = 35,
            抗风 = 15 + 180 * 0.1,
            抗火 = 15 + 180 * 0.1,
            抗水 = 15 + 180 * 0.1,
            抗雷 = 15 + 180 * 0.1,
            抗混乱 = 100,
            抗昏睡 = 110,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 20 + 180 * 0.1,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        施法几率 = 50,
        是否消失 = false,
        技能 = { { 名称 = '失心狂乱', 熟练度 = 20000 }, },

    },
    { 名称 = "大力神龟", 外形 = 2036,
        气血 = function(等级, 转生)
            return 125482 + 等级 * 5900
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 11 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return 80 + 等级 * 2
        end,
        抗性 = {
            物理吸收 = 55,
            抗震慑 = 35,
            抗风 = 5 + 180 * 0.1,
            抗火 = 5 + 180 * 0.1,
            抗水 = 5 + 180 * 0.1,
            抗雷 = 5 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗中毒伤害 = 1,
            抗鬼火 = 20 + 180 * 0.1,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        施法几率 = 50,
        是否消失 = false,
        技能 = { { 名称 = '迷魂醉', 熟练度 = 20000 }, },

    },
    { 名称 = "桃花仙", 外形 = 2096,
        气血 = function(等级, 转生)
            return 125482 + 等级 * 5900
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 1900 + 等级 * 190
        end,
        速度 = function(等级, 转生)
            return -800
        end,
        抗性 = {
            物理吸收 = 80,
            抗震慑 = 15,
            抗风 = 5 + 180 * 0.1,
            抗火 = 5 + 180 * 0.1,
            抗水 = 5 + 180 * 0.1,
            抗雷 = 5 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 20 + 180 * 0.1,
            忽视防御几率 = 100,
            忽视防御程度 = 100,
            狂暴几率 = 100,
            致命几率 = 100,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        施法几率 = 10,
        是否消失 = false,
        技能 = { { 名称 = '魔神附身', 熟练度 = 20000 }, },

    },
    { 名称 = "迦楼罗王", 外形 = 2170,
        气血 = function(等级, 转生)
            return 125482 + 等级 * 5900
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 11 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return 12
        end,
        抗性 = {
            物理吸收 = 55,
            抗震慑 = 35,
            抗风 = 5 + 180 * 0.1,
            抗火 = 5 + 180 * 0.1,
            抗水 = 5 + 180 * 0.1,
            抗雷 = 5 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 20 + 180 * 0.1,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        施法几率 = 50,
        是否消失 = false,
        技能 = { { 名称 = '九龙冰封', 熟练度 = 20000 }, },

    },
    { 名称 = "火凤", 外形 = 2071,
        气血 = function(等级, 转生)
            return 125482 + 等级 * 5900
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 10 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return 110 + 等级 * 2
        end,
        抗性 = {
            物理吸收 = 55,
            抗震慑 = 35,
            抗风 = 5 + 180 * 0.1,
            抗火 = 5 + 180 * 0.1,
            抗水 = 5 + 180 * 0.1,
            抗雷 = 5 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 20 + 180 * 0.1,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        施法几率 = 50,
        是否消失 = false,
        技能 = { { 名称 = '九阴纯火', 熟练度 = 20000 }, },

    },
    { 名称 = "毒蝎", 外形 = 2106,
        气血 = function(等级, 转生)
            return 125482 + 等级 * 5900
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 10 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return 110 + 等级 * 2
        end,
        抗性 = {
            物理吸收 = 55,
            抗震慑 = 35,
            抗风 = 5 + 180 * 0.1,
            抗火 = 5 + 180 * 0.1,
            抗水 = 5 + 180 * 0.1,
            抗雷 = 5 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 20 + 180 * 0.1,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        施法几率 = 50,
        是否消失 = false,
        技能 = { { 名称 = '断肠烈散', 熟练度 = 20000 }, },

    },
    { 名称 = "铁骨", 外形 = 2301,
        气血 = function(等级, 转生)
            return 125482 + 等级 * 5900
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 110 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return 110 + 等级 * 2
        end,
        抗性 = {
            物理吸收 = 55,
            抗震慑 = 35,
            抗风 = 5 + 180 * 0.1,
            抗火 = 5 + 180 * 0.1,
            抗水 = 5 + 180 * 0.1,
            抗雷 = 5 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 20 + 180 * 0.1,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        施法几率 = 50,
        是否消失 = false,
        技能 = { { 名称 = '九阴纯火', 熟练度 = 20000 }, },

    },
    { 名称 = "赭炎", 外形 = 2377,
        气血 = function(等级, 转生)
            return 125482 + 等级 * 5900
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 11 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return -150 --110 + 等级 * 2
        end,
        抗性 = {
            物理吸收 = 55,
            抗震慑 = 35,
            抗风 = 5 + 180 * 0.1,
            抗火 = 5 + 180 * 0.1,
            抗水 = 5 + 180 * 0.1,
            抗雷 = 5 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 20 + 180 * 0.1,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        施法几率 = 50,
        是否消失 = false,
        技能 = { { 名称 = '袖里乾坤', 熟练度 = 20000 }, },

    },
    { 名称 = "龟丞相", 外形 = 2064,
        气血 = function(等级, 转生)
            return 125482 + 等级 * 5900
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 111 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return -140
        end,
        抗性 = {
            物理吸收 = 55,
            抗震慑 = 35,
            抗风 = 5 + 180 * 0.1,
            抗火 = 5 + 180 * 0.1,
            抗水 = 5 + 180 * 0.1,
            抗雷 = 5 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 20 + 180 * 0.1,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        施法几率 = 50,
        是否消失 = false,
        技能 = { { 名称 = '袖里乾坤', 熟练度 = 20000 }, },

    },

    { 名称 = "蛟龙", 外形 = 2070,
        气血 = function(等级, 转生)
            return 125482 + 等级 * 5900
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 111 + 等级 * 100
        end,
        速度 = function(等级, 转生)
            return 135 + 等级 * 2
        end,
        抗性 = {
            物理吸收 = 55,
            抗震慑 = 35,
            抗风 = 5 + 180 * 0.1,
            抗火 = 5 + 180 * 0.1,
            抗水 = 5 + 180 * 0.1,
            抗雷 = 5 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 20 + 180 * 0.1,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        施法几率 = 50,
        是否消失 = false,
        技能 = { { 名称 = '吸星大法', 熟练度 = 20000 }, },

    },
    { 名称 = "鱼怪", 外形 = 2094,
        气血 = function(等级, 转生)
            return 125482 + 等级 * 5900
        end,
        魔法 = function(等级, 转生)
            return 26000 + 等级 * 35
        end,
        攻击 = function(等级, 转生)
            return 1110+等级*100
        end,
        速度 = function(等级, 转生)
            return 115
        end,
        抗性 = {
            物理吸收 = 55,
            抗震慑 = 35,
            抗风 = 5 + 180 * 0.1,
            抗火 = 5 + 180 * 0.1,
            抗水 = 5 + 180 * 0.1,
            抗雷 = 5 + 180 * 0.1,
            抗混乱 = 60,
            抗昏睡 = 60,
            抗中毒 = 10 + 180 * 0.015,
            抗鬼火 = 20 + 180 * 0.1,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        施法几率 = 10,
        是否消失 = false,
        技能 = { { 名称 = '失心狂乱', 熟练度 = 20000 }, },

    },










}
function 战斗:战斗初始化(玩家, NPC)
    local r = 玩家:取任务('日常_降魔任务')
    self.NPC_nid = NPC.nid
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()


    local 怪物属性 = {
        外形 = 2453,
        名称 = "白龙马",
        等级 = 等级,
        气血 = 354369 + 等级 * 14700,
        魔法 = 76000 + 等级 * 350,
        攻击 = 75410 + 等级 * 100,
        速度 = 250 + 等级 * 3,
        抗性 = {
            物理吸收 = 80,
            抗混乱 = 80,
            抗昏睡 = 80,
            抗中毒 = 10 + 等级 * 0.015,
            抗鬼火 = 30 + 等级 * 0.1,
            忽视防御几率 = 100,
            忽视防御程度 = 100,
            连击率 = 75,
            连击次数 = 3,
            反击率 = 75,
            反击次数 = 3,
            加强水 = 50,
            忽视抗水 = 30,
            水系狂暴几率 = 30,
            金 = 20,
            木 = 20,
            水 = 20,
            火 = 20,
            土 = 20,
        },
        技能 = {
            { 名称 = '九龙冰封', 熟练度 = 转生 * 10000 }
        },
        施法几率 = 80,
        是否消失 = false,

    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))



    local 战斗单位 = {}
    local t
    for n = 1, 9 do
        t = _小怪物属性[math.random(#_小怪物属性)]
        for k, v in pairs(t) do
            if type(v) == "function" then
                t[k] = v(等级, 转生)
            end
        end
        table.insert(战斗单位, t)
    end
    local gw
    for k, v in ipairs(战斗单位) do
        gw = 生成战斗怪物(v)
        self:加入敌方(k + 1, gw)
    end


end

function 战斗:进场喊话()

end

function 战斗:战斗回合开始(v)

end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

function 战斗:战斗结束(s)
    if s then
        for k, v in self:遍历我方() do
            if v.是否玩家 then
                local r = v.对象.接口:取任务("日常_降魔任务")
                if r and r.NPC == self.NPC_nid then
                    r:完成(v.对象.接口)
                end
            end
        end
    end
end

return 战斗
