local 物品 = {
    名称 = 'VIP7礼包',
    叠加 = 999,
    类别 = 10,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    绑定 = false
}

function 物品:使用(对象)
    if 对象:添加物品({
        生成物品 { 名称 = '积分卡', 数量 = 1, 参数 = 3000, 禁止交易 = true },
        生成物品 { 名称 = '银票', 数量 = 2, 参数 = 100000000 },
        生成物品 { 名称 = '刮刮乐', 数量 = 200 },
      --  生成物品 { 名称 = '神兵石', 数量 = 100 },
        生成物品 { 名称 = '补天神石', 数量 = 100 },
        生成物品 { 名称 = '盘古精铁', 数量 = 60 },
        生成物品 { 名称 = '天外飞石', 数量 = 60 },
       -- 生成物品 { 名称 = '神兵礼盒', 参数 = 1, 数量 = 30 },
        生成物品 { 名称 = '五常神兽宝卷', 数量 = 1 },
        生成物品 { 名称 = '神兽自选卡', 数量 = 1 },
        生成物品 { 名称 = '清盈果', 参数 = 1000, 数量 = 40 },
        生成物品 { 名称 = '炼化大礼包', 数量 = 5 },

    }) then
        if 对象.VIP < 7 then
           对象:修改VIP等级(7)
        end
        self.数量 = self.数量 - 1
    end

end

return 物品
