local 物品 = {
    名称 = '单笔礼包2000',
    叠加 = 999,
    类别 = 10,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    绑定 = false
}

function 物品:使用(对象)
    if 对象:添加物品({
      --  生成物品 { 名称 = '积分卡', 数量 = 1, 参数 = 2200 },
        生成物品 { 名称 = '清盈果', 参数 = 1000, 数量 = 40 },
        生成物品 { 名称 = '神兵石', 数量 = 20 },
        生成物品 { 名称 = '龙之骨', 数量 = 12 },
        生成物品 { 名称 = '神兵礼盒', 参数 = 5, 数量 = 1 },
        生成物品 { 名称 = '五常神兽宝卷', 数量 = 1 },
        生成物品 { 名称 = '银票', 数量 = 2, 参数 = 100000000 },
    }) then
        self.数量 = self.数量 - 1
    end

end

return 物品
