-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2022-08-06 16:04:54
-- @Last Modified time  : 2024-04-22 19:34:28
local 物品 = {
    名称 = '土豪开荒礼包',
    叠加 = 999,
    类别 = 11,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    绑定 = false
}


function 物品:使用(对象)
   -- 对象:添加银子(1500000000)
    if 对象:添加物品({
        生成物品 { 名称 = '银票', 数量 = 1,参数 = 500000000  },
        生成物品 {名称 = '四级神兵自选卡', 数量 = 2},
		生成物品 {名称 = '亲密丹', 参数=10000, 数量 = 30},
        生成物品 {名称 = '神兵石', 数量 = 20},
		生成物品 {名称 = '帮派成就册', 参数 = 10000 ,属性 = "#Y获得10000点成就", 数量 = 80},
		生成物品 {名称 = '九玄仙玉', 数量 = 50},
		生成物品 {名称 = '清盈果', 数量 = 10},
		生成物品 {名称 = '神功笔录', 数量 = 50},
		生成物品 {名称 = '落魂砂', 价值 = 125, 数量 = 150},
		生成物品 {名称 = '超级金柳露', 数量 = 30},
        生成物品 {名称 = '龙涎丸宝卷', 数量 = 3},
		生成物品 {名称 = '守护宝卷', 数量 = 3},
		生成物品 {名称 = '鸿运宝珠', 数量 = 10},
        

    }) then
	    对象.其它.无限飞 = 1
	    对象.其它.回血 = 1
        self.数量 = self.数量 - 1
        else
    return '#Y空间不足'
    end

end

return 物品
