local 物品 = {
    名称 = '月卡礼包',
    叠加 = 999,
    类别 = 10,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    禁止交易 = true,
    绑定 = true
}

function 物品:使用(对象)
    if 对象:添加物品({
        生成物品 { 名称 = 'VIP称谓符', 数量 = 1, 禁止交易 = true },
        生成物品 { 名称 = '坐骑礼包', 数量 = 1, 禁止交易 = true},
        生成物品 { 名称 = '飞行特权', 数量 = 1, 禁止交易 = true},
        生成物品 { 名称 = '血法特权', 数量 = 1, 禁止交易 = true},     
        生成物品 { 名称 = '龙马礼盒', 数量 = 1, 禁止交易 = true},
        生成物品 { 名称 = '月卡', 数量 = 1, 禁止交易 = true},          
    }) then
        self.数量 = self.数量 - 1
    end

end

return 物品
