local 物品 = {
    名称 = '至尊大礼包',
    叠加 = 999,
    类别 = 10,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    绑定 = false
}

function 物品:使用(对象)
    if 对象:添加物品({
       生成物品 { 名称 = '随机五常神兽宝盒', 数量 = 1 },
        生成物品 { 名称 = '五级神兵自选卡', 数量 = 1 },
        生成物品 { 名称 = '银票', 数量 = 1, 参数 = 2000000000 },
        生成物品 { 名称 = '武器开光礼包', 数量 = 5 },
        生成物品 { 名称 = '召唤兽培养礼包', 数量 = 10 },
        生成物品 { 名称 = '神兵石', 数量 = 100 },

    }) then
        -- if 对象.VIP < 5 then
        --     对象:修改VIP等级(5)
        -- end
        -- 对象:添加赞助(5000)
        self.数量 = self.数量 - 1
    end

end

return 物品
