local 物品 = {
    名称 = '超级大礼包',
    叠加 = 999,
    类别 = 10,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    绑定 = false
}

function 物品:使用(对象)
    if 对象:添加物品({
        生成物品 { 名称 = '守护宝卷', 数量 = 1 },
        生成物品 { 名称 = '四级神兵自选卡', 数量 = 1 },
        生成物品 { 名称 = '银票', 数量 = 1, 参数 = 500000000 },
        生成物品 { 名称 = '武器开光礼包', 数量 = 1 },
        生成物品 { 名称 = '召唤兽培养礼包', 数量 = 3 },
		生成物品 { 名称 = '封印卡', 数量 = 1, 参数 = "年", 禁止交易 = true },

    }) then
        if 对象.VIP < 5 then
            对象:修改VIP等级(5)
        end
        self.数量 = self.数量 - 1
    end

end

return 物品
