-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2022-08-06 16:04:54
-- @Last Modified time  : 2024-04-19 15:22:27
local 物品 = {
    名称 = '首冲礼包',
    叠加 = 999,
    类别 = 11,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    绑定 = false
}

function 物品:使用(对象)
    -- 对象:添加银子(50000000)
    if 对象:添加物品({
        -- 添加银子(50000000)
        生成物品 { 名称 = '龙涎丸', 数量 = 9 },
        生成物品 { 名称 = '更名卡', 数量 = 1 },
        生成物品 { 名称 = '修正卡', 数量 = 1 },
        生成物品 { 名称 = '猴毛召唤卡', 数量 = 1 },
        生成物品 { 名称 = '银票', 数量 = 1,参数 =50000000  },  
        -- 生成装备 { 名称 = '藕丝步云履', 等级 = 4 ,  禁止交易 = true },  
        -- 生成装备 { 名称 = '混元盘金锁', 等级 = 4 , 序号 = 1 ,禁止交易 = true },  
        -- 序号 = t.序号
        -- 生成物品 { 名称 = '封印卡', 数量 = 1, 参数 = "猴精", 禁止交易 = true },

    }) then
	    对象.其它.回血 = 1
        self.数量 = self.数量 - 1
    else
    return '#Y空间不足'
    end

end

return 物品
