local 物品 = {
    名称 = '高级大礼包',
    叠加 = 999,
    类别 = 10,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    绑定 = false
}

function 物品:使用(对象)
    if 对象:添加物品({
        生成物品 { 名称 = '龙涎丸宝卷', 数量 = 1 },
        生成物品 { 名称 = '帮派成就册', 数量 = 1, 参数 = 100000 },
        生成物品 { 名称 = '银票', 数量 = 1, 参数 = 100000000 },
        生成物品 { 名称 = '炼化大礼包', 数量 = 2 },
        生成物品 { 名称 = '召唤兽培养礼包', 数量 = 2 },

    }) then
        if 对象.VIP < 5 then
            对象:修改VIP等级(5)
        end
        self.数量 = self.数量 - 1
    end

end

return 物品
