local t = {
    龟丞相卡 = {
        { name = '龟丞相', 皮肤 = 9062, 外形 = 2064, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 6 }, { '法力', 3 }, { '速度', -3 }, { '加强水', 6 } }, 等级 = 43, 亲和力 = 14, 种类 = '妖', 五行 = { 0, 0, 85, 0, 15 } },
        { name = '龟丞相', 皮肤 = 9062, 外形 = 2064, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 6 }, { '法力', 3 }, { '速度', -3 }, { '反震率', 5 }, { '反震程度', 5 } }, 等级 = 43, 亲和力 = 14, 种类 = '妖', 五行 = { 0, 0, 85, 0, 15 } },
        { name = '龟丞相', 皮肤 = 9062, 外形 = 2064, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 6 }, { '法力', 3 }, { '速度', -3 }, { '物理吸收', 1 }, { '抗水', 5 } }, 等级 = 43, 亲和力 = 14, 种类 = '妖', 五行 = { 0, 0, 85, 0, 15 } },
    },
    舍生女娲卡 = {
        { name = '舍生女娲', 皮肤 = 9098, 外形 = 2290, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 6 }, { '法力', 6 }, { '速度', -2 }, { '加强毒', 9 } }, 等级 = 79, 亲和力 = 17, 种类 = '神', 五行 = { 5, 0, 95, 0, 0 } },
        { name = '舍生女娲', 皮肤 = 9098, 外形 = 2290, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 6 }, { '法力', 6 }, { '速度', -2 }, { '反震率', 9 }, { '反震程度', 9 } }, 等级 = 79, 亲和力 = 17, 种类 = '神', 五行 = { 5, 0, 95, 0, 0 } },
        { name = '舍生女娲', 皮肤 = 9098, 外形 = 2290, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 6 }, { '法力', 6 }, { '速度', -2 }, { '抗火', 3 }, { '抗水', 3 }, { '抗雷', 3 }, { '抗风', -3 }, { '物理吸收', 3 } }, 等级 = 79, 亲和力 = 17, 种类 = '神', 五行 = { 5, 0, 95, 0, 0 } },
    },
    神灵卡 = {
        { name = '神灵', 皮肤 = 9099, 外形 = 2068, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', -1 }, { '法力', 7 }, { '力量', -1 }, { '速度', 5 }, { '加强风', 4 }, { '加强雷', 5 } }, 等级 = 80, 亲和力 = 19, 种类 = '神', 五行 = { 0, 0, 50, 50, 0 } },
        { name = '神灵', 皮肤 = 9099, 外形 = 2068, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', -1 }, { '法力', 7 }, { '力量', -1 }, { '速度', 5 }, { '躲闪率', 9 } }, 等级 = 80, 亲和力 = 19, 种类 = '神', 五行 = { 0, 0, 50, 50, 0 } },
        { name = '神灵', 皮肤 = 9099, 外形 = 2068, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', -1 }, { '法力', 7 }, { '力量', -1 }, { '速度', 5 }, { '抗昏睡', 2 }, { '抗风', 2 }, { '抗雷', 2 }, { '抗封印', 1 }, { '抗混乱', 1 } }, 等级 = 80, 亲和力 = 19, 种类 = '神', 五行 = { 0, 0, 50, 50, 0 } },
    },
    鳄鱼卡 = {
        { name = '鳄鱼', 皮肤 = 9049, 外形 = 2042, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', -2 }, { '力量', 4 }, { '速度', 2 }, { '加强封印', 2 }, { '加强混乱', 3 } }, 等级 = 30, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 0, 45, 0, 55 } },
        { name = '鳄鱼', 皮肤 = 9049, 外形 = 2042, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', -2 }, { '力量', 4 }, { '速度', 2 }, { '狂暴几率', 5 } }, 等级 = 30, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 0, 45, 0, 55 } },
        { name = '鳄鱼', 皮肤 = 9049, 外形 = 2042, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', -2 }, { '力量', 4 }, { '速度', 2 }, { '抗火', 1 }, { '抗水', 2 }, { '物理吸收', 2 } }, 等级 = 30, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 0, 45, 0, 55 } },
    },
    水妖卡 = {
        { name = '水妖', 皮肤 = 9044, 外形 = 2069, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 1 }, { '力量', 3 }, { '速度', 1 }, { '加强雷', 1 }, { '加强水', 5 } }, 等级 = 45, 亲和力 = 3, 种类 = '妖', 五行 = { 30, 0, 70, 0, 0 } },
        { name = '水妖', 皮肤 = 9044, 外形 = 2069, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 1 }, { '力量', 3 }, { '速度', 1 }, { '躲闪率', 6 } }, 等级 = 45, 亲和力 = 3, 种类 = '妖', 五行 = { 30, 0, 70, 0, 0 } },
        { name = '水妖', 皮肤 = 9044, 外形 = 2069, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 1 }, { '力量', 3 }, { '速度', 1 }, { '抗水', 6 } }, 等级 = 45, 亲和力 = 3, 种类 = '妖', 五行 = { 30, 0, 70, 0, 0 } },
    },
    鼠怪卡 = {
        { name = '鼠怪', 皮肤 = 9086, 外形 = 2021, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 1 }, { '法力', -3 }, { '力量', 4 }, { '速度', 6 }, { '加强风', 4 }, { '加强水', 4 } }, 等级 = 67, 亲和力 = 15, 种类 = '妖', 五行 = { 0, 60, 0, 0, 40 } },
        { name = '鼠怪', 皮肤 = 9086, 外形 = 2021, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', 1 }, { '法力', -3 }, { '力量', 4 }, { '速度', 6 }, { '忽视防御几率', 10 }, { '忽视防御程度', 5 }, { '致命几率', 2 } }, 等级 = 67, 亲和力 = 15, 种类 = '妖', 五行 = { 0, 60, 0, 0, 40 } },
        { name = '鼠怪', 皮肤 = 9086, 外形 = 2021, 分类 = '抗性', 价格 = 130000, 属性 = { { '气血', 1 }, { '法力', -3 }, { '力量', 4 }, { '速度', 6 }, { '物理吸收', 4 }, { '抗昏睡', 4 } }, 等级 = 67, 亲和力 = 15, 种类 = '妖', 五行 = { 0, 60, 0, 0, 40 } },
    },
    女贼卡 = {
        { name = '女贼', 皮肤 = 9039, 外形 = 2020, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', -1 }, { '法力', -1 }, { '力量', 3 }, { '速度', 4 }, { '加强火', 2 }, { '加强毒', 2 } }, 等级 = 15, 亲和力 = 15, 种类 = '人', 五行 = { 50, 0, 50, 0, 0 } },
        { name = '女贼', 皮肤 = 9039, 外形 = 2020, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', -1 }, { '法力', -1 }, { '力量', 3 }, { '速度', 4 }, { '致命几率', 4 } }, 等级 = 15, 亲和力 = 15, 种类 = '人', 五行 = { 50, 0, 50, 0, 0 } },
        { name = '女贼', 皮肤 = 9039, 外形 = 2020, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', -1 }, { '法力', -1 }, { '力量', 3 }, { '速度', 4 }, { '抗震慑', 1 }, { '物理吸收', 1 }, { '抗混乱', 3 } }, 等级 = 15, 亲和力 = 15, 种类 = '人', 五行 = { 50, 0, 50, 0, 0 } },
    },
    金刚仙卡 = {
        { name = '金刚仙', 皮肤 = 9103, 外形 = 2098, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 1 }, { '法力', 6 }, { '力量', 1 }, { '速度', 2 }, { '加强风', 5 }, { '加强雷', 5 } }, 等级 = 84, 亲和力 = 16, 种类 = '神', 五行 = { 100, 0, 0, 0, 0 } },
        { name = '金刚仙', 皮肤 = 9103, 外形 = 2098, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 1 }, { '法力', 6 }, { '力量', 1 }, { '速度', 2 }, { '躲闪率', 7 }, { '致命几率', 2 } }, 等级 = 84, 亲和力 = 16, 种类 = '神', 五行 = { 100, 0, 0, 0, 0 } },
        { name = '金刚仙', 皮肤 = 9103, 外形 = 2098, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 1 }, { '法力', 6 }, { '力量', 1 }, { '速度', 2 }, { '抗火', 3 }, { '抗水', 2 }, { '抗雷', 3 }, { '抗风', 2 } }, 等级 = 84, 亲和力 = 16, 种类 = '神', 五行 = { 100, 0, 0, 0, 0 } },
    },
    鸡精卡 = {
        { name = '鸡精', 皮肤 = 9046, 外形 = 2003, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 1 }, { '法力', -1 }, { '力量', 4 }, { '速度', 1 }, { '抗火', 1 }, { '加强昏睡', 4 }, { '加强封印', 1 } }, 等级 = 27, 亲和力 = 15, 种类 = '妖', 五行 = { 0, 45, 0, 0, 55 } },
        { name = '鸡精', 皮肤 = 9046, 外形 = 2003, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 1 }, { '法力', -1 }, { '力量', 4 }, { '速度', 1 }, { '反击率', 7 }, { '反击次数', 3 } }, 等级 = 27, 亲和力 = 15, 种类 = '妖', 五行 = { 0, 45, 0, 0, 55 } },
        { name = '鸡精', 皮肤 = 9046, 外形 = 2003, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 1 }, { '法力', -1 }, { '力量', 4 }, { '速度', 1 }, { '抗火', 2 }, { '抗震慑', 1 }, { '抗水', 2 } }, 等级 = 27, 亲和力 = 15, 种类 = '妖', 五行 = { 0, 45, 0, 0, 55 } },
    },
    骷髅怪卡 = {
        { name = '骷髅怪', 皮肤 = 9045, 外形 = 2017, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', -1 }, { '力量', 4 }, { '加强火', 5 } }, 等级 = 26, 亲和力 = 12, 种类 = '妖', 五行 = { 25, 0, 0, 0, 75 } },
        { name = '骷髅怪', 皮肤 = 9045, 外形 = 2017, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', -1 }, { '力量', 4 }, { '致命几率', 4 } }, 等级 = 26, 亲和力 = 12, 种类 = '妖', 五行 = { 25, 0, 0, 0, 75 } },
        { name = '骷髅怪', 皮肤 = 9045, 外形 = 2017, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', -1 }, { '力量', 4 }, { '抗昏睡', 3 }, { '抗中毒', 1 }, { '抗封印', 3 }, { '抗混乱', 4 } }, 等级 = 26, 亲和力 = 12, 种类 = '妖', 五行 = { 25, 0, 0, 0, 75 } },
    },
    吸血鬼卡 = {
        { name = '吸血鬼', 皮肤 = 9068, 外形 = 2058, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', 2 }, { '力量', 3 }, { '速度', -1 }, { '加强混乱', 7 } }, 等级 = 50, 亲和力 = 13, 种类 = '鬼', 五行 = { 25, 0, 0, 0, 75 } },
        { name = '吸血鬼', 皮肤 = 9068, 外形 = 2058, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', 2 }, { '力量', 3 }, { '速度', -1 }, { '致命几率', 6 } }, 等级 = 50, 亲和力 = 13, 种类 = '鬼', 五行 = { 25, 0, 0, 0, 75 } },
        { name = '吸血鬼', 皮肤 = 9068, 外形 = 2058, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', 2 }, { '力量', 3 }, { '速度', -1 }, { '抗震慑', 1 }, { '抗封印', 4 }, { '物理吸收', 1 } }, 等级 = 50, 亲和力 = 13, 种类 = '鬼', 五行 = { 25, 0, 0, 0, 75 } },
    },
    当康卡 = {
        { name = '当康', 皮肤 = 9301, 外形 = 3077, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 14 }, { '速度', 2 }, { '物理吸收', 5 }, { '抗火', -3 }, { '抗雷', 4 }, { '抗风', 7 }, { '抗昏睡', 4 }, { '抗封印', 5 }, { '抗震慑', 3 } }, 等级 = 100, 亲和力 = 15, 种类 = '兽', 五行 = { 15, 0, 0, 0, 85 } },
        { name = '当康', 皮肤 = 9301, 外形 = 3077, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 14 }, { '速度', 2 } }, 等级 = 100, 亲和力 = 15, 种类 = '兽', 五行 = { 15, 0, 0, 0, 85 } },
        { name = '当康', 皮肤 = 9301, 外形 = 3077, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 14 }, { '速度', 2 }, { '反震程度', 18 }, { '反震几率', 15 } }, 等级 = 100, 亲和力 = 15, 种类 = '兽', 五行 = { 15, 0, 0, 0, 85 } },
    },
    衙役卡 = {
        { name = '衙役', 皮肤 = 9037, 外形 = 2078, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 4 }, { '速度', -1 }, { '加强混乱', 2 }, { '加强毒', 2 } }, 等级 = 14, 亲和力 = 12, 种类 = '人', 五行 = { 0, 50, 0, 50, 0 } },
        { name = '衙役', 皮肤 = 9037, 外形 = 2078, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 3 }, { '加强昏睡', 2 }, { '加强封印', 2 } }, 等级 = 14, 亲和力 = 12, 种类 = '人', 五行 = { 0, 50, 0, 50, 0 } },
        { name = '衙役', 皮肤 = 9037, 外形 = 2078, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 3 }, { '反击率', 3 }, { '忽视防御几率', 2 }, { '忽视防御程度', 1 }, { '反击次数', 3 } }, 等级 = 14, 亲和力 = 12, 种类 = '人', 五行 = { 0, 50, 0, 50, 0 } },
        { name = '衙役', 皮肤 = 9038, 外形 = 2078, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 4 }, { '速度', -1 }, { '忽视防御几率', 2 }, { '躲闪率', 3 }, { '忽视防御程度', 1 } }, 等级 = 14, 亲和力 = 12, 种类 = '人', 五行 = { 0, 50, 0, 50, 0 } },
        { name = '衙役', 皮肤 = 9038, 外形 = 2078, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 4 }, { '速度', -1 }, { '抗昏睡', 2 }, { '抗中毒', 2 } }, 等级 = 14, 亲和力 = 12, 种类 = '人', 五行 = { 0, 50, 0, 50, 0 } },
        { name = '衙役', 皮肤 = 9038, 外形 = 2078, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 3 }, { '抗封印', 2 }, { '抗混乱', 2 } }, 等级 = 14, 亲和力 = 12, 种类 = '人', 五行 = { 0, 50, 0, 50, 0 } },
    },
    野鬼卡 = {
        { name = '野鬼', 皮肤 = 9069, 外形 = 2055, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 2 }, { '速度', -1 }, { '加强封印', 7 } }, 等级 = 49, 亲和力 = 13, 种类 = '鬼', 五行 = { 0, 0, 0, 30, 70 } },
        { name = '野鬼', 皮肤 = 9069, 外形 = 2055, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 2 }, { '速度', -1 }, { '狂暴几率', 3 }, { '致命几率', 3 } }, 等级 = 49, 亲和力 = 13, 种类 = '鬼', 五行 = { 0, 0, 0, 30, 70 } },
        { name = '野鬼', 皮肤 = 9069, 外形 = 2055, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 2 }, { '速度', -1 }, { '抗震慑', 1 }, { '抗雷', 4 }, { '物理吸收', 2 } }, 等级 = 49, 亲和力 = 13, 种类 = '鬼', 五行 = { 0, 0, 0, 30, 70 } },
    },
    吉祥果卡 = {
        { name = '吉祥果', 皮肤 = 9297, 外形 = 2129, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 9 }, { '法力', -1 }, { '速度', 7 }, { '抗水', 5 }, { '抗风', 3 }, { '抗混乱', 5 }, { '抗昏睡', 2 }, { '抗封印', 4 } }, 等级 = 100, 亲和力 = 18, 种类 = '神', 五行 = { 40, 0, 0, 0, 60 } },
        { name = '吉祥果', 皮肤 = 9297, 外形 = 2129, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 9 }, { '法力', -1 }, { '速度', 7 }, { '加强火', 8 } }, 等级 = 100, 亲和力 = 18, 种类 = '神', 五行 = { 40, 0, 0, 0, 60 } },
        { name = '吉祥果', 皮肤 = 9297, 外形 = 2129, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 9 }, { '法力', -1 }, { '速度', 7 }, { '连击率', 10 }, { '连击次数', 2 }, { '躲闪率', 15 } }, 等级 = 100, 亲和力 = 18, 种类 = '神', 五行 = { 40, 0, 0, 0, 60 } },
    },
    冰熊卡 = {
        { name = '冰熊', 皮肤 = 9075, 外形 = 2040, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', -5 }, { '力量', 6 }, { '速度', -3 }, { '加强雷', 2 }, { '加强水', 5 } }, 等级 = 56, 亲和力 = 12, 种类 = '兽', 五行 = { 0, 0, 40, 0, 60 } },
        { name = '冰熊', 皮肤 = 9075, 外形 = 2040, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', -5 }, { '力量', 6 }, { '速度', -3 }, { '连击次数', 4 }, { '狂暴几率', 3 }, { '连击率', 2 } }, 等级 = 56, 亲和力 = 12, 种类 = '兽', 五行 = { 0, 0, 40, 0, 60 } },
        { name = '冰熊', 皮肤 = 9075, 外形 = 2040, 分类 = '抗性', 价格 = 130000, 属性 = { { '气血', -5 }, { '力量', 6 }, { '速度', -3 }, { '物理吸收', 3 }, { '抗水', 4 } }, 等级 = 56, 亲和力 = 12, 种类 = '兽', 五行 = { 0, 0, 40, 0, 60 } },
    },
    食土兽卡 = {
        { name = '食土兽', 皮肤 = 9107, 外形 = 2102, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 2 }, { '速度', 2 }, { '加强风', 5 }, { '加强雷', 5 } }, 等级 = 88, 亲和力 = 16, 种类 = '兽', 五行 = { 0, 0, 0, 0, 100 } },
        { name = '食土兽', 皮肤 = 9107, 外形 = 2102, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 2 }, { '速度', 2 }, { '反击率', 16 }, { '反击次数', 4 } }, 等级 = 88, 亲和力 = 16, 种类 = '兽', 五行 = { 0, 0, 0, 0, 100 } },
        { name = '食土兽', 皮肤 = 9107, 外形 = 2102, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 2 }, { '速度', 2 } }, 等级 = 88, 亲和力 = 16, 种类 = '兽', 五行 = { 0, 0, 0, 0, 100 } },
    },
    小妖卡 = {
        { name = '小妖', 皮肤 = 9023, 外形 = 2004, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 2 }, { '法力', 1 }, { '力量', 2 }, { '加强毒', 3 } }, 等级 = 18, 亲和力 = 7, 种类 = '妖', 五行 = { 0, 40, 0, 0, 60 } },
        { name = '小妖', 皮肤 = 9023, 外形 = 2004, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 2 }, { '力量', 2 }, { '速度', -1 }, { '加强雷', 3 } }, 等级 = 18, 亲和力 = 7, 种类 = '妖', 五行 = { 0, 40, 0, 0, 60 } },
        { name = '小妖', 皮肤 = 9023, 外形 = 2004, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 2 }, { '法力', -1 }, { '力量', 2 }, { '连击次数', 2 }, { '反击率', 1 }, { '反击次数', 1 }, { '连击率', 2 } }, 等级 = 18, 亲和力 = 7, 种类 = '妖', 五行 = { 0, 40, 0, 0, 60 } },
        { name = '小妖', 皮肤 = 9023, 外形 = 2004, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 2 }, { '力量', 2 }, { '速度', -1 }, { '忽视防御几率', 4 }, { '忽视防御程度', 2 }, { '致命几率', 1 } }, 等级 = 18, 亲和力 = 7, 种类 = '妖', 五行 = { 0, 40, 0, 0, 60 } },
        { name = '小妖', 皮肤 = 9023, 外形 = 2004, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 2 }, { '法力', -1 }, { '力量', 2 }, { '抗水', 2 }, { '抗风', 2 } }, 等级 = 18, 亲和力 = 7, 种类 = '妖', 五行 = { 0, 40, 0, 0, 60 } },
        { name = '小妖', 皮肤 = 9023, 外形 = 2004, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 2 }, { '力量', 2 }, { '速度', -1 }, { '物理吸收', 4 } }, 等级 = 18, 亲和力 = 7, 种类 = '妖', 五行 = { 0, 40, 0, 0, 60 } },
    },
    山贼卡 = {
        { name = '山贼', 皮肤 = 9043, 外形 = 2045, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 4 }, { '速度', -1 }, { '加强昏睡', 5 } }, 等级 = 17, 亲和力 = 16, 种类 = '人', 五行 = { 45, 0, 0, 0, 55 } },
        { name = '山贼', 皮肤 = 9043, 外形 = 2045, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 4 }, { '速度', -1 }, { '狂暴几率', 4 } }, 等级 = 17, 亲和力 = 16, 种类 = '人', 五行 = { 45, 0, 0, 0, 55 } },
        { name = '山贼', 皮肤 = 9043, 外形 = 2045, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 4 }, { '速度', -1 }, { '抗昏睡', 1 }, { '物理吸收', 3 }, { '抗混乱', 1 } }, 等级 = 17, 亲和力 = 16, 种类 = '人', 五行 = { 45, 0, 0, 0, 55 } },
    },
    画中仙卡 = {
        { name = '画中仙', 皮肤 = 9280, 外形 = 2455, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 4 }, { '法力', -2 }, { '速度', 8 }, { '抗水', 3 }, { '抗混乱', 2 }, { '抗昏睡', 2 }, { '抗封印', 4 } }, 等级 = 100, 亲和力 = 10, 种类 = '神', 五行 = { 0, 50, 50, 0, 0 } },
        { name = '画中仙', 皮肤 = 9280, 外形 = 2455, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 4 }, { '法力', -2 }, { '速度', 8 }, { '加强火', 7 }, { '加强风', 8 } }, 等级 = 100, 亲和力 = 10, 种类 = '神', 五行 = { 0, 50, 50, 0, 0 } },
        { name = '画中仙', 皮肤 = 9280, 外形 = 2455, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 4 }, { '法力', -2 }, { '速度', 8 }, { '反震程度', 15 }, { '反震几率', 10 } }, 等级 = 100, 亲和力 = 10, 种类 = '神', 五行 = { 0, 50, 50, 0, 0 } },
    },
    女妖卡 = {
        { name = '女妖', 皮肤 = 9042, 外形 = 2009, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 3 }, { '加强毒', 5 } }, 等级 = 24, 亲和力 = 5, 种类 = '妖', 五行 = { 50, 0, 50, 0, 0 } },
        { name = '女妖', 皮肤 = 9042, 外形 = 2009, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 3 }, { '反击率', 5 }, { '反击次数', 3 } }, 等级 = 24, 亲和力 = 5, 种类 = '妖', 五行 = { 50, 0, 50, 0, 0 } },
        { name = '女妖', 皮肤 = 9042, 外形 = 2009, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 3 }, { '物理吸收', 2 }, { '抗中毒', 3 } }, 等级 = 24, 亲和力 = 5, 种类 = '妖', 五行 = { 50, 0, 50, 0, 0 } },
    },
    蜘蛛卡 = {
        { name = '蜘蛛', 皮肤 = 9006, 外形 = 2035, 分类 = '强法', 价格 = 1300, 属性 = { { '气血', 1 }, { '力量', 1 }, { '加强混乱', 2 } }, 等级 = 3, 亲和力 = 8, 种类 = '兽', 五行 = { 0, 50, 0, 0, 50 } },
        { name = '蜘蛛', 皮肤 = 9006, 外形 = 2035, 分类 = '强法', 价格 = 1300, 属性 = { { '气血', 1 }, { '法力', 1 }, { '加强昏睡', 1 }, { '加强混乱', 1 } }, 等级 = 3, 亲和力 = 8, 种类 = '兽', 五行 = { 0, 50, 0, 0, 50 } },
        { name = '蜘蛛', 皮肤 = 9006, 外形 = 2035, 分类 = '物理', 价格 = 1300, 属性 = { { '气血', 1 }, { '力量', 1 }, { '狂暴几率', 1 }, { '致命几率', 1 } }, 等级 = 3, 亲和力 = 8, 种类 = '兽', 五行 = { 0, 50, 0, 0, 50 } },
        { name = '蜘蛛', 皮肤 = 9006, 外形 = 2035, 分类 = '物理', 价格 = 1300, 属性 = { { '气血', 1 }, { '法力', 1 }, { '躲闪率', 1 }, { '狂暴几率', 1 } }, 等级 = 3, 亲和力 = 8, 种类 = '兽', 五行 = { 0, 50, 0, 0, 50 } },
        { name = '蜘蛛', 皮肤 = 9006, 外形 = 2035, 分类 = '抗性', 价格 = 1300, 属性 = { { '气血', 1 }, { '力量', 1 }, { '抗震慑', 2 } }, 等级 = 3, 亲和力 = 8, 种类 = '兽', 五行 = { 0, 50, 0, 0, 50 } },
        { name = '蜘蛛', 皮肤 = 9006, 外形 = 2035, 分类 = '抗性', 价格 = 1300, 属性 = { { '气血', 1 }, { '法力', 1 }, { '抗风', 5 }, { '抗雷', -2 } }, 等级 = 3, 亲和力 = 8, 种类 = '兽', 五行 = { 0, 50, 0, 0, 50 } },
    },
    蟹将卡 = {
        { name = '蟹将', 皮肤 = 9060, 外形 = 2063, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 1 }, { '力量', 3 }, { '加强雷', 1 }, { '加强水', 5 } }, 等级 = 42, 亲和力 = 2, 种类 = '妖', 五行 = { 0, 0, 80, 0, 20 } },
        { name = '蟹将', 皮肤 = 9060, 外形 = 2063, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 1 }, { '力量', 3 }, { '狂暴几率', 2 }, { '致命几率', 3 } }, 等级 = 42, 亲和力 = 2, 种类 = '妖', 五行 = { 0, 0, 80, 0, 20 } },
        { name = '蟹将', 皮肤 = 9060, 外形 = 2063, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 1 }, { '力量', 3 }, { '抗水', 5 }, { '抗雷', 1 } }, 等级 = 42, 亲和力 = 2, 种类 = '妖', 五行 = { 0, 0, 80, 0, 20 } },
    },
    冤魂卡 = {
        { name = '冤魂', 皮肤 = 9070, 外形 = 2049, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 4 }, { '力量', 3 }, { '速度', -2 }, { '加强昏睡', 7 } }, 等级 = 51, 亲和力 = 11, 种类 = '鬼', 五行 = { 0, 0, 35, 0, 65 } },
        { name = '冤魂', 皮肤 = 9070, 外形 = 2049, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 4 }, { '力量', 3 }, { '速度', -2 }, { '忽视防御几率', 2 }, { '忽视防御程度', 2 }, { '狂暴几率', 4 } }, 等级 = 51, 亲和力 = 11, 种类 = '鬼', 五行 = { 0, 0, 35, 0, 65 } },
        { name = '冤魂', 皮肤 = 9070, 外形 = 2049, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 4 }, { '力量', 3 }, { '速度', -2 }, { '抗震慑', 1 }, { '抗风', 4 }, { '物理吸收', 2 } }, 等级 = 51, 亲和力 = 11, 种类 = '鬼', 五行 = { 0, 0, 35, 0, 65 } },
    },
    颜如玉卡 = {
        { name = '颜如玉', 皮肤 = 9124, 外形 = 2113, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', -2 }, { '法力', 12 }, { '速度', 8 }, { '抗火', -3 }, { '抗水', -6 }, { '抗雷', -4 }, { '抗风', -2 }, { '抗混乱', 4 }, { '抗昏睡', 5 }, { '抗封印', 4 } }, 等级 = 100, 亲和力 = 12, 种类 = '鬼', 五行 = { 20, 10, 10, 50, 10 } },
        { name = '颜如玉', 皮肤 = 9124, 外形 = 2113, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', -2 }, { '法力', 12 }, { '速度', 8 }, { '加强火', 8 } }, 等级 = 100, 亲和力 = 12, 种类 = '鬼', 五行 = { 20, 10, 10, 50, 10 } },
        { name = '颜如玉', 皮肤 = 9124, 外形 = 2113, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', -2 }, { '法力', 12 }, { '速度', 8 }, { '连击次数', 5 }, { '连击率', 16 }, { '躲闪率', 20 }, { '致命几率', 8 } }, 等级 = 100, 亲和力 = 12, 种类 = '鬼', 五行 = { 20, 10, 10, 50, 10 } },
    },
    桃树精卡 = {
        { name = '桃树精', 皮肤 = 9100, 外形 = 2095, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 9 }, { '法力', 2 }, { '力量', 3 }, { '速度', -4 }, { '加强雷', 5 }, { '加强水', 4 } }, 等级 = 81, 亲和力 = 12, 种类 = '妖', 五行 = { 0, 100, 0, 0, 0 } },
        { name = '桃树精', 皮肤 = 9100, 外形 = 2095, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 9 }, { '法力', 2 }, { '力量', 3 }, { '速度', -4 }, { '致命几率', 9 } }, 等级 = 81, 亲和力 = 12, 种类 = '妖', 五行 = { 0, 100, 0, 0, 0 } },
        { name = '桃树精', 皮肤 = 9100, 外形 = 2095, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 9 }, { '法力', 2 }, { '力量', 3 }, { '速度', -4 }, { '抗火', -4 }, { '抗昏睡', 1 }, { '物理吸收', 6 }, { '抗混乱', 6 } }, 等级 = 81, 亲和力 = 12, 种类 = '妖', 五行 = { 0, 100, 0, 0, 0 } },
    },
    年卡 = {
        { name = '年', 皮肤 = 9279, 外形 = 2209, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', 2 }, { '法力', -2 }, { '力量', 3 }, { '速度', 9 }, { '抗水', -4 }, { '抗混乱', 5 }, { '抗昏睡', 2 }, { '抗封印', 2 } }, 等级 = 100, 亲和力 = 11, 种类 = '兽', 五行 = { 20, 0, 0, 80, 0 } },
        { name = '年', 皮肤 = 9279, 外形 = 2209, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 2 }, { '法力', -2 }, { '力量', 3 }, { '速度', 9 }, { '加强封印', 7 }, { '加强昏睡', 3 } }, 等级 = 100, 亲和力 = 11, 种类 = '兽', 五行 = { 20, 0, 0, 80, 0 } },
        { name = '年', 皮肤 = 9279, 外形 = 2209, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 2 }, { '法力', -2 }, { '力量', 3 }, { '速度', 9 }, { '连击次数', 3 }, { '连击率', 10 }, { '狂暴几率', 9 } }, 等级 = 100, 亲和力 = 11, 种类 = '兽', 五行 = { 20, 0, 0, 80, 0 } },
    },
    蝙蝠卡 = {
        { name = '蝙蝠', 皮肤 = 9009, 外形 = 2030, 分类 = '强法', 价格 = 1300, 属性 = { { '力量', 1 }, { '速度', -1 }, { '加强昏睡', 1 }, { '加强混乱', 1 } }, 等级 = 5, 亲和力 = 6, 种类 = '兽', 五行 = { 0, 60, 0, 40, 0 } },
        { name = '蝙蝠', 皮肤 = 9009, 外形 = 2030, 分类 = '强法', 价格 = 1300, 属性 = { { '气血', -1 }, { '速度', 1 }, { '加强昏睡', 1 }, { '加强火', 1 } }, 等级 = 5, 亲和力 = 6, 种类 = '兽', 五行 = { 0, 60, 0, 40, 0 } },
        { name = '蝙蝠', 皮肤 = 9009, 外形 = 2030, 分类 = '物理', 价格 = 1300, 属性 = { { '力量', 1 }, { '速度', 1 }, { '躲闪率', 2 } }, 等级 = 5, 亲和力 = 6, 种类 = '兽', 五行 = { 0, 60, 0, 40, 0 } },
        { name = '蝙蝠', 皮肤 = 9009, 外形 = 2030, 分类 = '物理', 价格 = 1300, 属性 = { { '气血', 1 }, { '速度', 1 }, { '忽视防御几率', 4 }, { '忽视防御程度', 2 } }, 等级 = 5, 亲和力 = 6, 种类 = '兽', 五行 = { 0, 60, 0, 40, 0 } },
        { name = '蝙蝠', 皮肤 = 9009, 外形 = 2030, 分类 = '抗性', 价格 = 1300, 属性 = { { '力量', 1 }, { '速度', 1 }, { '抗雷', 3 } }, 等级 = 5, 亲和力 = 6, 种类 = '兽', 五行 = { 0, 60, 0, 40, 0 } },
        { name = '蝙蝠', 皮肤 = 9009, 外形 = 2030, 分类 = '抗性', 价格 = 1300, 属性 = { { '气血', 1 }, { '速度', 1 }, { '抗风', 5 }, { '抗雷', -2 } }, 等级 = 5, 亲和力 = 6, 种类 = '兽', 五行 = { 0, 60, 0, 40, 0 } },
    },
    蛤蟆精卡 = {
        { name = '蛤蟆精', 皮肤 = 9058, 外形 = 2022, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 1 }, { '力量', 2 }, { '速度', 1 }, { '加强昏睡', 2 }, { '加强毒', 3 } }, 等级 = 40, 亲和力 = 10, 种类 = '妖', 五行 = { 30, 0, 0, 0, 70 } },
        { name = '蛤蟆精', 皮肤 = 9058, 外形 = 2022, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 1 }, { '力量', 2 }, { '速度', 1 }, { '反震率', 3 }, { '反震程度', 3 }, { '忽视防御几率', 4 }, { '忽视防御程度', 2 } }, 等级 = 40, 亲和力 = 10, 种类 = '妖', 五行 = { 30, 0, 0, 0, 70 } },
        { name = '蛤蟆精', 皮肤 = 9058, 外形 = 2022, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 1 }, { '力量', 2 }, { '速度', 1 }, { '抗雷', 4 }, { '物理吸收', 2 } }, 等级 = 40, 亲和力 = 10, 种类 = '妖', 五行 = { 30, 0, 0, 0, 70 } },
    },
    流氓卡 = {
        { name = '流氓', 皮肤 = 9031, 外形 = 2046, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 4 }, { '法力', -2 }, { '力量', 2 }, { '加强风', 2 }, { '加强混乱', 2 } }, 等级 = 8, 亲和力 = 14, 种类 = '人', 五行 = { 40, 0, 0, 0, 60 } },
        { name = '流氓', 皮肤 = 9031, 外形 = 2046, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 4 }, { '法力', -2 }, { '力量', 2 }, { '加强昏睡', 2 }, { '加强封印', 2 } }, 等级 = 8, 亲和力 = 14, 种类 = '人', 五行 = { 40, 0, 0, 0, 60 } },
        { name = '流氓', 皮肤 = 9031, 外形 = 2046, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 4 }, { '法力', -2 }, { '力量', 2 }, { '忽视防御几率', 4 }, { '忽视防御程度', 2 }, { '狂暴几率', 2 } }, 等级 = 8, 亲和力 = 14, 种类 = '人', 五行 = { 40, 0, 0, 0, 60 } },
        { name = '流氓', 皮肤 = 9031, 外形 = 2046, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 4 }, { '法力', -2 }, { '力量', 2 }, { '忽视防御几率', 2 }, { '忽视防御程度', 1 }, { '狂暴几率', 3 } }, 等级 = 8, 亲和力 = 14, 种类 = '人', 五行 = { 40, 0, 0, 0, 60 } },
        { name = '流氓', 皮肤 = 9031, 外形 = 2046, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 4 }, { '法力', -2 }, { '力量', 2 }, { '抗封印', 3 }, { '抗混乱', 1 } }, 等级 = 8, 亲和力 = 14, 种类 = '人', 五行 = { 40, 0, 0, 0, 60 } },
        { name = '流氓', 皮肤 = 9031, 外形 = 2046, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 4 }, { '法力', -2 }, { '力量', 2 }, { '抗混乱', 1 }, { '抗雷', 3 } }, 等级 = 8, 亲和力 = 14, 种类 = '人', 五行 = { 40, 0, 0, 0, 60 } },
    },
    黑熊卡 = {
        { name = '黑熊', 皮肤 = 9056, 外形 = 2383, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 4 }, { '力量', 1 }, { '速度', 1 }, { '加强雷', 4 }, { '加强火', 1 } }, 等级 = 39, 亲和力 = 10, 种类 = '兽', 五行 = { 0, 0, 0, 60, 40 } },
        { name = '黑熊', 皮肤 = 9056, 外形 = 2383, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 4 }, { '力量', 1 }, { '速度', 1 }, { '狂暴几率', 5 } }, 等级 = 39, 亲和力 = 10, 种类 = '兽', 五行 = { 0, 0, 0, 60, 40 } },
        { name = '黑熊', 皮肤 = 9056, 外形 = 2383, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 4 }, { '力量', 1 }, { '速度', 1 }, { '物理吸收', 5 }, { '抗震慑', 1 } }, 等级 = 39, 亲和力 = 10, 种类 = '兽', 五行 = { 0, 0, 0, 60, 40 } },
    },
    狐狸精卡 = {
        { name = '狐狸精', 皮肤 = 9040, 外形 = 2059, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', -2 }, { '力量', 3 }, { '速度', 1 }, { '加强毒', 4 } }, 等级 = 22, 亲和力 = 11, 种类 = '妖', 五行 = { 0, 0, 0, 35, 65 } },
        { name = '狐狸精', 皮肤 = 9040, 外形 = 2059, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', -2 }, { '力量', 3 }, { '速度', 1 }, { '忽视防御几率', 8 }, { '忽视防御程度', 4 } }, 等级 = 22, 亲和力 = 11, 种类 = '妖', 五行 = { 0, 0, 0, 35, 65 } },
        { name = '狐狸精', 皮肤 = 9040, 外形 = 2059, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', -2 }, { '力量', 3 }, { '速度', 1 }, { '抗封印', 1 }, { '抗中毒', 1 }, { '抗昏睡', 3 } }, 等级 = 22, 亲和力 = 11, 种类 = '妖', 五行 = { 0, 0, 0, 35, 65 } },
    },
    黄金兽卡 = {
        { name = '黄金兽', 皮肤 = 9102, 外形 = 2097, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', -4 }, { '力量', 6 }, { '速度', 8 }, { '加强雷', 9 } }, 等级 = 83, 亲和力 = 18, 种类 = '兽', 五行 = { 100, 0, 0, 0, 0 } },
        { name = '黄金兽', 皮肤 = 9102, 外形 = 2097, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', -4 }, { '力量', 6 }, { '速度', 8 }, { '忽视防御几率', 16 }, { '忽视防御程度', 9 } }, 等级 = 83, 亲和力 = 18, 种类 = '兽', 五行 = { 100, 0, 0, 0, 0 } },
        { name = '黄金兽', 皮肤 = 9102, 外形 = 2097, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', -4 }, { '力量', 6 }, { '速度', 8 }, { '抗封印', 3 }, { '物理吸收', 3 }, { '抗混乱', 3 } }, 等级 = 83, 亲和力 = 18, 种类 = '兽', 五行 = { 100, 0, 0, 0, 0 } },
    },
    符咒女娲卡 = {
        { name = '符咒女娲', 皮肤 = 9074, 外形 = 2292, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 1 }, { '法力', 1 }, { '力量', 1 }, { '速度', 5 }, { '加强毒', 7 } }, 等级 = 55, 亲和力 = 13, 种类 = '神', 五行 = { 0, 25, 0, 0, 75 } },
        { name = '符咒女娲', 皮肤 = 9074, 外形 = 2292, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', 1 }, { '法力', 1 }, { '力量', 1 }, { '速度', 5 }, { '忽视防御几率', 1 }, { '躲闪率', 5 }, { '忽视防御程度', 1 } }, 等级 = 55, 亲和力 = 13, 种类 = '神', 五行 = { 0, 25, 0, 0, 75 } },
        { name = '符咒女娲', 皮肤 = 9074, 外形 = 2292, 分类 = '抗性', 价格 = 130000, 属性 = { { '气血', 1 }, { '法力', 1 }, { '力量', 1 }, { '速度', 5 }, { '抗封印', 3 }, { '抗昏睡', 4 } }, 等级 = 55, 亲和力 = 13, 种类 = '神', 五行 = { 0, 25, 0, 0, 75 } },
    },
    黑熊精卡 = {
        { name = '黑熊精', 皮肤 = 9063, 外形 = 2006, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 3 }, { '力量', 5 }, { '速度', -1 }, { '加强混乱', 6 } }, 等级 = 44, 亲和力 = 11, 种类 = '妖', 五行 = { 60, 0, 0, 0, 40 } },
        { name = '黑熊精', 皮肤 = 9063, 外形 = 2006, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 3 }, { '力量', 5 }, { '速度', -1 }, { '忽视防御几率', 6 }, { '忽视防御程度', 3 }, { '狂暴几率', 3 } }, 等级 = 44, 亲和力 = 11, 种类 = '妖', 五行 = { 60, 0, 0, 0, 40 } },
        { name = '黑熊精', 皮肤 = 9063, 外形 = 2006, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 3 }, { '力量', 5 }, { '速度', -1 }, { '抗火', 3 }, { '物理吸收', 3 } }, 等级 = 44, 亲和力 = 11, 种类 = '妖', 五行 = { 60, 0, 0, 0, 40 } },
    },
    精卫卡 = {
        { name = '精卫', 皮肤 = 9127, 外形 = 2169, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', -4 }, { '法力', 8 }, { '力量', -2 }, { '速度', 8 }, { '抗火', 6 }, { '抗水', 4 }, { '抗雷', 5 }, { '抗风', 4 } }, 等级 = 100, 亲和力 = 17, 种类 = '神', 五行 = { 25, 0, 0, 75, 0 } },
        { name = '精卫', 皮肤 = 9127, 外形 = 2169, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', -4 }, { '法力', 8 }, { '力量', -2 }, { '速度', 8 }, { '加强封印', 6 }, { '加强昏睡', 7 } }, 等级 = 100, 亲和力 = 17, 种类 = '神', 五行 = { 25, 0, 0, 75, 0 } },
        { name = '精卫', 皮肤 = 9127, 外形 = 2169, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', -4 }, { '法力', 8 }, { '力量', -2 }, { '速度', 8 }, { '反震程度', 15 }, { '反震几率', 5 }, { '躲闪率', 12 } }, 等级 = 100, 亲和力 = 17, 种类 = '神', 五行 = { 25, 0, 0, 75, 0 } },
    },
    老虎卡 = {
        { name = '老虎', 皮肤 = 9054, 外形 = 2028, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', -2 }, { '力量', 4 }, { '速度', 2 }, { '加强风', 4 }, { '加强火', 1 } }, 等级 = 36, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 0, 0, 50, 50 } },
        { name = '老虎', 皮肤 = 9054, 外形 = 2028, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', -2 }, { '力量', 4 }, { '速度', 2 }, { '狂暴几率', 3 }, { '致命几率', 2 } }, 等级 = 36, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 0, 0, 50, 50 } },
        { name = '老虎', 皮肤 = 9054, 外形 = 2028, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', -2 }, { '力量', 4 }, { '速度', 2 }, { '抗火', 1 }, { '抗水', 1 }, { '抗雷', 1 }, { '物理吸收', 3 } }, 等级 = 36, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 0, 0, 50, 50 } },
    },
    树妖卡 = {
        { name = '树妖', 皮肤 = 9057, 外形 = 2010, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', 1 }, { '力量', 2 }, { '速度', -1 }, { '加强雷', 1 }, { '加强水', 4 } }, 等级 = 39, 亲和力 = 11, 种类 = '妖', 五行 = { 10, 90, 0, 0, 0 } },
        { name = '树妖', 皮肤 = 9057, 外形 = 2010, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', 1 }, { '力量', 2 }, { '速度', -1 }, { '忽视防御几率', 4 }, { '忽视防御程度', 2 }, { '狂暴几率', 3 } }, 等级 = 39, 亲和力 = 11, 种类 = '妖', 五行 = { 10, 90, 0, 0, 0 } },
        { name = '树妖', 皮肤 = 9057, 外形 = 2010, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', 1 }, { '力量', 2 }, { '速度', -1 }, { '抗火', 3 }, { '抗水', 6 }, { '物理吸收', 3 } }, 等级 = 39, 亲和力 = 11, 种类 = '妖', 五行 = { 10, 90, 0, 0, 0 } },
    },
    海龟卡 = {
        { name = '海龟', 皮肤 = 9011, 外形 = 2036, 分类 = '强法', 价格 = 1300, 属性 = { { '气血', 3 }, { '法力', 1 }, { '速度', -2 }, { '加强雷', 1 }, { '加强水', 1 } }, 等级 = 6, 亲和力 = 4, 种类 = '兽', 五行 = { 0, 0, 80, 0, 20 } },
        { name = '海龟', 皮肤 = 9011, 外形 = 2036, 分类 = '强法', 价格 = 1300, 属性 = { { '气血', 4 }, { '速度', -2 }, { '加强水', 2 } }, 等级 = 6, 亲和力 = 4, 种类 = '兽', 五行 = { 0, 0, 80, 0, 20 } },
        { name = '海龟', 皮肤 = 9011, 外形 = 2036, 分类 = '物理', 价格 = 1300, 属性 = { { '气血', 3 }, { '法力', 1 }, { '速度', -2 }, { '反击率', 2 }, { '反击次数', 2 } }, 等级 = 6, 亲和力 = 4, 种类 = '兽', 五行 = { 0, 0, 80, 0, 20 } },
        { name = '海龟', 皮肤 = 9012, 外形 = 2036, 分类 = '物理', 价格 = 1300, 属性 = { { '气血', 4 }, { '速度', -2 }, { '忽视防御几率', 2 }, { '忽视防御程度', 1 }, { '致命几率', 1 } }, 等级 = 6, 亲和力 = 4, 种类 = '兽', 五行 = { 0, 0, 80, 0, 20 } },
        { name = '海龟', 皮肤 = 9012, 外形 = 2036, 分类 = '抗性', 价格 = 1300, 属性 = { { '气血', 4 }, { '速度', -2 }, { '抗水', 3 }, { '抗中毒', 2 }, { '物理吸收', 2 } }, 等级 = 6, 亲和力 = 4, 种类 = '兽', 五行 = { 0, 0, 80, 0, 20 } },
        { name = '海龟', 皮肤 = 9012, 外形 = 2036, 分类 = '抗性', 价格 = 1300, 属性 = { { '气血', 3 }, { '法力', 1 }, { '速度', -2 }, { '物理吸收', 1 }, { '抗水', 2 } }, 等级 = 6, 亲和力 = 4, 种类 = '兽', 五行 = { 0, 0, 80, 0, 20 } },
    },
    牛妖卡 = {
        { name = '牛妖', 皮肤 = 9025, 外形 = 2066, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 3 }, { '速度', -1 }, { '加强混乱', 3 } }, 等级 = 19, 亲和力 = 8, 种类 = '妖', 五行 = { 65, 0, 0, 0, 35 } },
        { name = '牛妖', 皮肤 = 9025, 外形 = 2066, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 1 }, { '法力', 1 }, { '力量', 1 }, { '速度', 1 }, { '加强封印', 1 }, { '加强混乱', 2 } }, 等级 = 19, 亲和力 = 8, 种类 = '妖', 五行 = { 65, 0, 0, 0, 35 } },
        { name = '牛妖', 皮肤 = 9025, 外形 = 2066, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 3 }, { '速度', -1 }, { '忽视防御几率', 2 }, { '躲闪率', 2 }, { '忽视防御程度', 1 } }, 等级 = 19, 亲和力 = 8, 种类 = '妖', 五行 = { 65, 0, 0, 0, 35 } },
        { name = '牛妖', 皮肤 = 9026, 外形 = 2066, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 1 }, { '法力', 1 }, { '力量', 1 }, { '速度', 1 }, { '加强封印', 1 }, { '狂暴几率', 4 } }, 等级 = 19, 亲和力 = 8, 种类 = '妖', 五行 = { 65, 0, 0, 0, 35 } },
        { name = '牛妖', 皮肤 = 9026, 外形 = 2066, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 3 }, { '速度', -1 }, { '物理吸收', 4 } }, 等级 = 19, 亲和力 = 8, 种类 = '妖', 五行 = { 65, 0, 0, 0, 35 } },
        { name = '牛妖', 皮肤 = 9026, 外形 = 2066, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 1 }, { '法力', 1 }, { '力量', 1 }, { '速度', 1 }, { '抗水', 2 }, { '物理吸收', 2 } }, 等级 = 19, 亲和力 = 8, 种类 = '妖', 五行 = { 65, 0, 0, 0, 35 } },
    },
    白虎卡 = {
        { name = '白虎', 皮肤 = 9076, 外形 = 2038, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 2 }, { '法力', -1 }, { '力量', 6 }, { '速度', 1 }, { '加强雷', 3 }, { '加强水', 4 } }, 等级 = 57, 亲和力 = 13, 种类 = '兽', 五行 = { 60, 0, 0, 40, 0 } },
        { name = '白虎', 皮肤 = 9076, 外形 = 2038, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', 2 }, { '法力', -1 }, { '力量', 6 }, { '速度', 1 }, { '忽视防御几率', 6 }, { '躲闪率', 1 }, { '忽视防御程度', 6 } }, 等级 = 57, 亲和力 = 13, 种类 = '兽', 五行 = { 60, 0, 0, 40, 0 } },
        { name = '白虎', 皮肤 = 9076, 外形 = 2038, 分类 = '抗性', 价格 = 130000, 属性 = { { '气血', 2 }, { '法力', -1 }, { '力量', 6 }, { '速度', 1 }, { '物理吸收', 2 }, { '抗水', 5 } }, 等级 = 57, 亲和力 = 13, 种类 = '兽', 五行 = { 60, 0, 0, 40, 0 } },
    },
    千年老妖卡 = {
        { name = '千年老妖', 皮肤 = 9047, 外形 = 2073, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 5 }, { '法力', 3 }, { '速度', -3 }, { '加强风', 5 } }, 等级 = 28, 亲和力 = 13, 种类 = '妖', 五行 = { 0, 0, 0, 40, 60 } },
        { name = '千年老妖', 皮肤 = 9047, 外形 = 2073, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 5 }, { '法力', 3 }, { '速度', -3 }, { '反震率', 5 }, { '反震程度', 5 } }, 等级 = 28, 亲和力 = 13, 种类 = '妖', 五行 = { 0, 0, 0, 40, 60 } },
        { name = '千年老妖', 皮肤 = 9047, 外形 = 2073, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 5 }, { '法力', 3 }, { '速度', -3 }, { '抗风', 2 }, { '抗雷', 2 }, { '抗混乱', 1 } }, 等级 = 28, 亲和力 = 13, 种类 = '妖', 五行 = { 0, 0, 0, 40, 60 } },
    },
    大鹏卡 = {
        { name = '大鹏', 皮肤 = 9052, 外形 = 2086, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 1 }, { '法力', -2 }, { '力量', 2 }, { '速度', 5 }, { '加强雷', 3 }, { '加强火', 2 } }, 等级 = 33, 亲和力 = 8, 种类 = '兽', 五行 = { 60, 0, 0, 40, 0 } },
        { name = '大鹏', 皮肤 = 9052, 外形 = 2086, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 1 }, { '法力', -2 }, { '力量', 2 }, { '速度', 5 }, { '忽视防御几率', 6 }, { '躲闪率', 2 }, { '忽视防御程度', 3 } }, 等级 = 33, 亲和力 = 8, 种类 = '兽', 五行 = { 60, 0, 0, 40, 0 } },
        { name = '大鹏', 皮肤 = 9052, 外形 = 2086, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 1 }, { '法力', -2 }, { '力量', 2 }, { '速度', 5 }, { '抗昏睡', 2 }, { '抗风', -4 }, { '抗封印', 4 }, { '抗混乱', 3 } }, 等级 = 33, 亲和力 = 8, 种类 = '兽', 五行 = { 60, 0, 0, 40, 0 } },
    },
    修罗卡 = {
        { name = '修罗', 皮肤 = 9073, 外形 = 2050, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 4 }, { '法力', 3 }, { '力量', 2 }, { '速度', -2 }, { '加强雷', 7 } }, 等级 = 54, 亲和力 = 14, 种类 = '鬼', 五行 = { 50, 0, 0, 50, 0 } },
        { name = '修罗', 皮肤 = 9073, 外形 = 2050, 分类 = '强法', 价格 = 65000, 属性 = { { '物理', 4 }, { '法力', 3 }, { '力量', 2 }, { '速度', -2 }, { '连击次数', 10 }, { '连击率', 2 } }, 等级 = 54, 亲和力 = 14, 种类 = '鬼', 五行 = { 50, 0, 0, 50, 0 } },
        { name = '修罗', 皮肤 = 9073, 外形 = 2050, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 4 }, { '法力', 3 }, { '力量', 2 }, { '速度', -2 }, { '抗震慑', 1 }, { '抗封印', 4 }, { '物理吸收', 2 } }, 等级 = 54, 亲和力 = 14, 种类 = '鬼', 五行 = { 50, 0, 0, 50, 0 } },
    },
    狮子卡 = {
        { name = '狮子', 皮肤 = 9050, 外形 = 2084, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', -2 }, { '力量', 3 }, { '速度', 2 }, { '加强昏睡', 3 }, { '加强封印', 2 } }, 等级 = 31, 亲和力 = 10, 种类 = '兽', 五行 = { 0, 0, 0, 60, 40 } },
        { name = '狮子', 皮肤 = 9050, 外形 = 2084, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', -2 }, { '力量', 3 }, { '速度', 2 }, { '忽视防御几率', 4 }, { '忽视防御程度', 4 }, { '致命几率', 1 } }, 等级 = 31, 亲和力 = 10, 种类 = '兽', 五行 = { 0, 0, 0, 60, 40 } },
        { name = '狮子', 皮肤 = 9050, 外形 = 2084, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', -2 }, { '力量', 3 }, { '速度', 2 }, { '抗火', 2 }, { '抗风', 1 }, { '物理吸收', 2 } }, 等级 = 31, 亲和力 = 10, 种类 = '兽', 五行 = { 0, 0, 0, 60, 40 } },
    },
    蜘蛛精卡 = {
        { name = '蜘蛛精', 皮肤 = 9079, 外形 = 2065, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 1 }, { '速度', 1 }, { '加强风', 4 }, { '加强毒', 4 } }, 等级 = 60, 亲和力 = 16, 种类 = '妖', 五行 = { 0, 0, 40, 0, 60 } },
        { name = '蜘蛛精', 皮肤 = 9079, 外形 = 2065, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 1 }, { '速度', 1 }, { '反震率', 7 }, { '反震程度', 7 } }, 等级 = 60, 亲和力 = 16, 种类 = '妖', 五行 = { 0, 0, 40, 0, 60 } },
        { name = '蜘蛛精', 皮肤 = 9079, 外形 = 2065, 分类 = '抗性', 价格 = 130000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 1 }, { '速度', 1 }, { '抗风', 4 }, { '抗雷', 3 } }, 等级 = 60, 亲和力 = 16, 种类 = '妖', 五行 = { 0, 0, 40, 0, 60 } },
    },
    无身鬼卡 = {
        { name = '无身鬼', 皮肤 = 9067, 外形 = 2057, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 4 }, { '法力', 1 }, { '力量', 3 }, { '速度', 1 }, { '加强昏睡', 4 }, { '加强毒', 3 } }, 等级 = 48, 亲和力 = 12, 种类 = '鬼', 五行 = { 0, 40, 0, 0, 60 } },
        { name = '无身鬼', 皮肤 = 9067, 外形 = 2057, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 4 }, { '法力', 1 }, { '力量', 3 }, { '速度', 1 }, { '反击率', 10 }, { '反击次数', 2 } }, 等级 = 48, 亲和力 = 12, 种类 = '鬼', 五行 = { 0, 40, 0, 0, 60 } },
        { name = '无身鬼', 皮肤 = 9067, 外形 = 2057, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 4 }, { '法力', 1 }, { '力量', 3 }, { '速度', 1 }, { '抗火', -2 }, { '抗震慑', 1 }, { '抗昏睡', 6 }, { '物理吸收', 1 } }, 等级 = 48, 亲和力 = 12, 种类 = '鬼', 五行 = { 0, 40, 0, 0, 60 } },
    },
    蟾蜍卡 = {
        { name = '蟾蜍', 皮肤 = 9003, 外形 = 2037, 分类 = '强法', 价格 = 1300, 属性 = { { '气血', 1 }, { '力量', 1 }, { '速度', -1 }, { '加强风', 1 }, { '加强毒', 1 } }, 等级 = 2, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 0, 25, 0, 75 } },
        { name = '蟾蜍', 皮肤 = 9003, 外形 = 2037, 分类 = '强法', 价格 = 1300, 属性 = { { '气血', 1 }, { '法力', 1 }, { '速度', -1 }, { '加强毒', 2 } }, 等级 = 2, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 0, 25, 0, 75 } },
        { name = '蟾蜍', 皮肤 = 9003, 外形 = 2037, 分类 = '物理', 价格 = 1300, 属性 = { { '气血', 1 }, { '力量', 1 }, { '速度', -1 }, { '忽视防御几率', 2 }, { '忽视防御程度', 1 }, { '狂暴几率', 1 } }, 等级 = 2, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 0, 25, 0, 75 } },
        { name = '蟾蜍', 皮肤 = 9004, 外形 = 2037, 分类 = '物理', 价格 = 1300, 属性 = { { '气血', 1 }, { '法力', 1 }, { '速度', -1 }, { '忽视防御几率', 2 }, { '忽视防御程度', 1 }, { '致命几率', 1 } }, 等级 = 2, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 0, 25, 0, 75 } },
        { name = '蟾蜍', 皮肤 = 9004, 外形 = 2037, 分类 = '抗性', 价格 = 1300, 属性 = { { '气血', 1 }, { '力量', 1 }, { '速度', -1 }, { '抗中毒', 2 } }, 等级 = 2, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 0, 25, 0, 75 } },
        { name = '蟾蜍', 皮肤 = 9004, 外形 = 2037, 分类 = '抗性', 价格 = 1300, 属性 = { { '气血', 1 }, { '法力', 1 }, { '速度', -1 }, { '物理吸收', -1 }, { '抗水', 3 } }, 等级 = 2, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 0, 25, 0, 75 } },
    },
    冥灵妃子卡 = {
        { name = '冥灵妃子', 皮肤 = 9272, 外形 = 2171, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 5 }, { '法力', 6 }, { '力量', 1 }, { '速度', 4 }, { '抗雷', 3 }, { '抗风', -3 }, { '抗昏睡', 4 }, { '抗封印', 4 }, { '抗震慑', 2 } }, 等级 = 100, 亲和力 = 9, 种类 = '鬼', 五行 = { 75, 0, 25, 0, 0 } },
        { name = '冥灵妃子', 皮肤 = 9272, 外形 = 2171, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 5 }, { '法力', 6 }, { '力量', 1 }, { '速度', 4 }, { '加强火', 9 }, { '加强雷', 8 } }, 等级 = 100, 亲和力 = 9, 种类 = '鬼', 五行 = { 75, 0, 25, 0, 0 } },
        { name = '冥灵妃子', 皮肤 = 9272, 外形 = 2171, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 5 }, { '法力', 6 }, { '力量', 1 }, { '速度', 4 }, { '反震程度', 15 }, { '反震几率', 15 } }, 等级 = 100, 亲和力 = 9, 种类 = '鬼', 五行 = { 75, 0, 25, 0, 0 } },
    },
    浪淘沙卡 = {
        { name = '浪淘沙', 皮肤 = 9268, 外形 = 2114, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 15 }, { '力量', 15 }, { '物理吸收', 5 }, { '抗风', 5 }, { '抗混乱', 6 }, { '抗昏睡', 3 } }, 等级 = 100, 亲和力 = 18, 种类 = '神', 五行 = { 50, 10, 10, 20, 10 } },
        { name = '浪淘沙', 皮肤 = 9268, 外形 = 2114, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 15 }, { '力量', 15 }, { '加强混乱', 10 }, { '加强昏睡', 5 } }, 等级 = 100, 亲和力 = 18, 种类 = '神', 五行 = { 50, 10, 10, 20, 10 } },
        { name = '浪淘沙', 皮肤 = 9268, 外形 = 2114, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 15 }, { '力量', 15 }, { '狂暴几率', 12 }, { '忽视防御程度', 10 }, { '忽视防御几率', 10 } }, 等级 = 100, 亲和力 = 18, 种类 = '神', 五行 = { 50, 10, 10, 20, 10 } },
    },
    猪怪卡 = {
        { name = '猪怪', 皮肤 = 9018, 外形 = 2002, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', 1 }, { '力量', 2 }, { '速度', 3 }, { '加强火', 3 } }, 等级 = 11, 亲和力 = 8, 种类 = '妖', 五行 = { 40, 0, 0, 0, 60 } },
        { name = '猪怪', 皮肤 = 9018, 外形 = 2002, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -2 }, { '力量', 3 }, { '速度', -1 }, { '加强风', 3 } }, 等级 = 11, 亲和力 = 8, 种类 = '妖', 五行 = { 40, 0, 0, 0, 60 } },
        { name = '猪怪', 皮肤 = 9018, 外形 = 2002, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 2 }, { '速度', -1 }, { '忽视防御几率', 2 }, { '忽视防御程度', 1 }, { '致命几率', 2 } }, 等级 = 11, 亲和力 = 8, 种类 = '妖', 五行 = { 40, 0, 0, 0, 60 } },
        { name = '猪怪', 皮肤 = 9017, 外形 = 2002, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -2 }, { '力量', 3 }, { '速度', -1 }, { '连击次数', 3 }, { '连击率', 3 } }, 等级 = 11, 亲和力 = 8, 种类 = '妖', 五行 = { 40, 0, 0, 0, 60 } },
        { name = '猪怪', 皮肤 = 9017, 外形 = 2002, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 2 }, { '速度', -1 }, { '抗火', 1 }, { '抗水', 1 }, { '物理吸收', 1 } }, 等级 = 11, 亲和力 = 8, 种类 = '妖', 五行 = { 40, 0, 0, 0, 60 } },
        { name = '猪怪', 皮肤 = 9017, 外形 = 2002, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -2 }, { '力量', 3 }, { '速度', -1 }, { '抗水', 1 }, { '抗雷', 1 }, { '抗混乱', 1 } }, 等级 = 11, 亲和力 = 8, 种类 = '妖', 五行 = { 40, 0, 0, 0, 60 } },
    },
    飞鱼卡 = {
        { name = '飞鱼', 皮肤 = 9001, 外形 = 2032, 分类 = '强法', 价格 = 1300, 属性 = { { '气血', -1 }, { '速度', 2 }, { '加强水', 2 } }, 等级 = 1, 亲和力 = 5, 种类 = '兽', 五行 = { 0, 40, 0, 60, 0 } },
        { name = '飞鱼', 皮肤 = 9001, 外形 = 2032, 分类 = '强法', 价格 = 1300, 属性 = { { '法力', -1 }, { '力量', 1 }, { '速度', 1 }, { '加强风', 1 }, { '加强水', 1 } }, 等级 = 1, 亲和力 = 5, 种类 = '兽', 五行 = { 0, 40, 0, 60, 0 } },
        { name = '飞鱼', 皮肤 = 9001, 外形 = 2032, 分类 = '物理', 价格 = 1300, 属性 = { { '气血', -1 }, { '速度', 2 }, { '忽视防御几率', 2 }, { '忽视防御程度', 1 }, { '躲闪率', 1 } }, 等级 = 1, 亲和力 = 5, 种类 = '兽', 五行 = { 0, 40, 0, 60, 0 } },
        { name = '飞鱼', 皮肤 = 9002, 外形 = 2032, 分类 = '物理', 价格 = 1300, 属性 = { { '法力', -1 }, { '力量', 1 }, { '速度', 1 }, { '连击次数', 2 }, { '连击率', 2 } }, 等级 = 1, 亲和力 = 5, 种类 = '兽', 五行 = { 0, 40, 0, 60, 0 } },
        { name = '飞鱼', 皮肤 = 9002, 外形 = 2032, 分类 = '抗性', 价格 = 1300, 属性 = { { '气血', -1 }, { '速度', 2 }, { '抗风', 2 } }, 等级 = 1, 亲和力 = 5, 种类 = '兽', 五行 = { 0, 40, 0, 60, 0 } },
        { name = '飞鱼', 皮肤 = 9002, 外形 = 2032, 分类 = '抗性', 价格 = 1300, 属性 = { { '法力', -1 }, { '力量', 1 }, { '抗水', 2 } }, 等级 = 1, 亲和力 = 5, 种类 = '兽', 五行 = { 0, 40, 0, 60, 0 } },
    },
    孔雀明王卡 = {
        { name = '孔雀明王', 皮肤 = 9322, 外形 = 3887, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 4 }, { '力量', 13 }, { '速度', 6 }, { '抗混乱', 5 }, { '抗昏睡', 2 }, { '抗封印', 3 } }, 等级 = 100, 亲和力 = 12, 种类 = '神', 五行 = { 0, 50, 0, 0, 50 } },
        { name = '孔雀明王', 皮肤 = 9322, 外形 = 3887, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 4 }, { '力量', 13 }, { '速度', 6 }, { '加强雷', 9 }, { '加强水', 9 } }, 等级 = 100, 亲和力 = 12, 种类 = '神', 五行 = { 0, 50, 0, 0, 50 } },
        { name = '孔雀明王', 皮肤 = 9322, 外形 = 3887, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 4 }, { '力量', 13 }, { '速度', 6 }, { '连击率', 7 }, { '致命几率', 10 }, { '忽视防御几率', 6 }, { '忽视防御程度', 8 } }, 等级 = 100, 亲和力 = 12, 种类 = '神', 五行 = { 0, 50, 0, 0, 50 } },
    },
    喷火牛卡 = {
        { name = '喷火牛', 皮肤 = 9109, 外形 = 2104, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 3 }, { '法力', 2 }, { '力量', 4 }, { '速度', 2 }, { '加强雷', 4 }, { '加强火', 6 } }, 等级 = 90, 亲和力 = 8, 种类 = '兽', 五行 = { 0, 0, 0, 100, 0 } },
        { name = '喷火牛', 皮肤 = 9109, 外形 = 2104, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 3 }, { '法力', 2 }, { '力量', 4 }, { '速度', 2 }, { '反击率', 4 }, { '躲闪率', 3 }, { '反击次数', 10 } }, 等级 = 90, 亲和力 = 8, 种类 = '兽', 五行 = { 0, 0, 0, 100, 0 } },
        { name = '喷火牛', 皮肤 = 9109, 外形 = 2104, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 3 }, { '法力', 2 }, { '力量', 4 }, { '速度', 2 }, { '抗昏睡', 4 }, { '抗雷', 4 }, { '抗风', 5 }, { '抗水', -8 }, { '抗混乱', 5 } }, 等级 = 90, 亲和力 = 8, 种类 = '兽', 五行 = { 0, 0, 0, 100, 0 } },
    },
    毒蜂卡 = {
        { name = '毒蜂', 皮肤 = 9041, 外形 = 2033, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', -2 }, { '力量', 3 }, { '速度', 4 }, { '加强毒', 4 } }, 等级 = 23, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 70, 0, 30, 0 } },
        { name = '毒蜂', 皮肤 = 9041, 外形 = 2033, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', -2 }, { '力量', 3 }, { '速度', 4 }, { '躲闪率', 4 } }, 等级 = 23, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 70, 0, 30, 0 } },
        { name = '毒蜂', 皮肤 = 9041, 外形 = 2033, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', -2 }, { '力量', 3 }, { '速度', 4 }, { '抗风', 1 }, { '抗中毒', 6 } }, 等级 = 23, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 70, 0, 30, 0 } },
    },
    三尾怪卡 = {
        { name = '三尾怪', 皮肤 = 9078, 外形 = 2016, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 6 }, { '法力', 1 }, { '力量', 1 }, { '加强风', 4 }, { '加强昏睡', 3 } }, 等级 = 59, 亲和力 = 16, 种类 = '兽', 五行 = { 0, 65, 0, 0, 35 } },
        { name = '三尾怪', 皮肤 = 9078, 外形 = 2016, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 6 }, { '法力', 1 }, { '力量', 1 }, { '反击率', 11 }, { '反击次数', 3 } }, 等级 = 59, 亲和力 = 16, 种类 = '兽', 五行 = { 0, 65, 0, 0, 35 } },
        { name = '三尾怪', 皮肤 = 9078, 外形 = 2016, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 6 }, { '法力', 1 }, { '力量', 1 }, { '抗风', 4 }, { '物理吸收', 3 } }, 等级 = 59, 亲和力 = 16, 种类 = '兽', 五行 = { 0, 65, 0, 0, 35 } },
    },
    夜叉卡 = {
        { name = '夜叉', 皮肤 = 9019, 外形 = 2072, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 2 }, { '法力', 2 }, { '速度', 1 }, { '加强火', 3 } }, 等级 = 12, 亲和力 = 11, 种类 = '鬼', 五行 = { 10, 0, 0, 90, 0 } },
        { name = '夜叉', 皮肤 = 9019, 外形 = 2072, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 2 }, { '法力', 1 }, { '加强火', 2 }, { '加强水', 1 } }, 等级 = 12, 亲和力 = 11, 种类 = '鬼', 五行 = { 10, 0, 0, 90, 0 } },
        { name = '夜叉', 皮肤 = 9019, 外形 = 2072, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 2 }, { '法力', 2 }, { '速度', -1 }, { '忽视防御几率', 2 }, { '忽视防御程度', 1 }, { '狂暴几率', 2 } }, 等级 = 12, 亲和力 = 11, 种类 = '鬼', 五行 = { 10, 0, 0, 90, 0 } },
        { name = '夜叉', 皮肤 = 9020, 外形 = 2072, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 2 }, { '法力', 1 }, { '躲闪率', 1 }, { '狂暴几率', 1 }, { '致命几率', 1 } }, 等级 = 12, 亲和力 = 11, 种类 = '鬼', 五行 = { 10, 0, 0, 90, 0 } },
        { name = '夜叉', 皮肤 = 9020, 外形 = 2072, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 2 }, { '法力', 2 }, { '速度', -1 }, { '抗火', 1 }, { '抗封印', 2 }, { '抗雷', 1 } }, 等级 = 12, 亲和力 = 11, 种类 = '鬼', 五行 = { 10, 0, 0, 90, 0 } },
        { name = '夜叉', 皮肤 = 9020, 外形 = 2072, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 2 }, { '法力', 1 }, { '抗火', 4 } }, 等级 = 12, 亲和力 = 11, 种类 = '鬼', 五行 = { 10, 0, 0, 90, 0 } },
    },
    猴精卡 = {
        { name = '猴精', 皮肤 = 9096, 外形 = 2060, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', -1 }, { '力量', 8 }, { '速度', 1 }, { '加强混乱', 9 } }, 等级 = 77, 亲和力 = 10, 种类 = '妖', 五行 = { 0, 40, 0, 0, 60 } },
        { name = '猴精', 皮肤 = 9096, 外形 = 2060, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', -1 }, { '力量', 8 }, { '速度', 1 }, { '忽视防御几率', 10 }, { '忽视防御程度', 6 }, { '致命几率', 2 } }, 等级 = 77, 亲和力 = 10, 种类 = '妖', 五行 = { 0, 40, 0, 0, 60 } },
        { name = '猴精', 皮肤 = 9096, 外形 = 2060, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', -1 }, { '力量', 8 }, { '速度', 1 }, { '抗震慑', 1 }, { '物理吸收', 5 }, { '抗混乱', 3 } }, 等级 = 77, 亲和力 = 10, 种类 = '妖', 五行 = { 0, 40, 0, 0, 60 } },
    },
    士兵卡 = {
        { name = '士兵', 皮肤 = 9035, 外形 = 2048, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -2 }, { '力量', 3 }, { '速度', 1 }, { '加强毒', 4 } }, 等级 = 13, 亲和力 = 13, 种类 = '人', 五行 = { 50, 0, 0, 50, 0 } },
        { name = '士兵', 皮肤 = 9035, 外形 = 2048, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 4 }, { '法力', -3 }, { '力量', 2 }, { '速度', 2 }, { '加强封印', 4 } }, 等级 = 13, 亲和力 = 13, 种类 = '人', 五行 = { 50, 0, 0, 50, 0 } },
        { name = '士兵', 皮肤 = 9035, 外形 = 2048, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 4 }, { '法力', -3 }, { '力量', 2 }, { '速度', 2 }, { '连击次数', 2 }, { '忽视防御几率', 2 }, { '忽视防御程度', 1 }, { '连击率', 3 } }, 等级 = 13, 亲和力 = 13, 种类 = '人', 五行 = { 50, 0, 0, 50, 0 } },
        { name = '士兵', 皮肤 = 9036, 外形 = 2048, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -2 }, { '力量', 3 }, { '速度', 1 }, { '躲闪率', 1 }, { '致命几率', 3 } }, 等级 = 13, 亲和力 = 13, 种类 = '人', 五行 = { 50, 0, 0, 50, 0 } },
        { name = '士兵', 皮肤 = 9036, 外形 = 2048, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -2 }, { '力量', 3 }, { '速度', 1 }, { '抗火', 2 }, { '抗雷', 2 } }, 等级 = 13, 亲和力 = 13, 种类 = '人', 五行 = { 50, 0, 0, 50, 0 } },
        { name = '士兵', 皮肤 = 9036, 外形 = 2048, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 4 }, { '法力', -2 }, { '力量', 2 }, { '速度', 2 }, { '抗风', 2 }, { '抗水', 2 } }, 等级 = 13, 亲和力 = 13, 种类 = '人', 五行 = { 50, 0, 0, 50, 0 } },
    },
    哥俩好卡 = {
        { name = '哥俩好', 皮肤 = 9114, 外形 = 2110, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 12 }, { '力量', 13 }, { '速度', 1 }, { '抗火', 3 }, { '抗风', 4 }, { '抗混乱', 3 }, { '抗昏睡', 3 }, { '抗封印', 3 }, { '抗震慑', 3 } }, 等级 = 100, 亲和力 = 10, 种类 = '人', 五行 = { 0, 70, 0, 0, 30 } },
        { name = '哥俩好', 皮肤 = 9114, 外形 = 2110, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 12 }, { '力量', 13 }, { '速度', 1 }, { '加强封印', 7 } }, 等级 = 100, 亲和力 = 10, 种类 = '人', 五行 = { 0, 70, 0, 0, 30 } },
        { name = '哥俩好', 皮肤 = 9114, 外形 = 2110, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 12 }, { '力量', 13 }, { '速度', 1 }, { '致命几率', 9 }, { '忽视防御几率', 8 }, { '忽视防御程度', 12 } }, 等级 = 100, 亲和力 = 10, 种类 = '人', 五行 = { 0, 70, 0, 0, 30 } },
    },
    范式之魂卡 = {
        { name = '范式之魂', 皮肤 = 9126, 外形 = 2115, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', -2 }, { '法力', -2 }, { '力量', 15 }, { '速度', 9 }, { '抗混乱', 2 }, { '抗封印', 4 } }, 等级 = 100, 亲和力 = 17, 种类 = '鬼', 五行 = { 10, 20, 10, 10, 50 } },
        { name = '范式之魂', 皮肤 = 9126, 外形 = 2115, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', -2 }, { '法力', -2 }, { '力量', 15 }, { '速度', 9 } }, 等级 = 100, 亲和力 = 17, 种类 = '鬼', 五行 = { 10, 20, 10, 10, 50 } },
        { name = '范式之魂', 皮肤 = 9126, 外形 = 2115, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', -2 }, { '法力', -2 }, { '力量', 15 }, { '速度', 9 }, { '连击次数', 3 }, { '连击率', 12 }, { '狂暴几率', 10 }, { '致命几率', 12 } }, 等级 = 100, 亲和力 = 17, 种类 = '鬼', 五行 = { 10, 20, 10, 10, 50 } },
    },
    蛟龙卡 = {
        { name = '蛟龙', 皮肤 = 9094, 外形 = 2070, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 1 }, { '法力', 4 }, { '力量', 1 }, { '速度', 4 }, { '加强水', 9 } }, 等级 = 75, 亲和力 = 8, 种类 = '兽', 五行 = { 5, 0, 95, 0, 0 } },
        { name = '蛟龙', 皮肤 = 9094, 外形 = 2070, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 1 }, { '法力', 4 }, { '力量', 1 }, { '速度', 4 }, { '忽视防御几率', 6 }, { '躲闪率', 2 }, { '忽视防御程度', 3 }, { '致命几率', 3 } }, 等级 = 75, 亲和力 = 8, 种类 = '兽', 五行 = { 5, 0, 95, 0, 0 } },
        { name = '蛟龙', 皮肤 = 9094, 外形 = 2070, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 1 }, { '法力', 4 }, { '力量', 1 }, { '速度', 4 }, { '抗火', -3 }, { '抗水', 7 }, { '抗雷', 3 }, { '抗风', 2 } }, 等级 = 75, 亲和力 = 8, 种类 = '兽', 五行 = { 5, 0, 95, 0, 0 } },
    },
    野狗卡 = {
        { name = '野狗', 皮肤 = 9027, 外形 = 2034, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 2 }, { '法力', -1 }, { '力量', 1 }, { '速度', 2 }, { '加强雷', 2 }, { '加强火', 2 } }, 等级 = 20, 亲和力 = 6, 种类 = '兽', 五行 = { 0, 50, 50, 0, 0 } },
        { name = '野狗', 皮肤 = 9027, 外形 = 2034, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -2 }, { '力量', 2 }, { '速度', 1 }, { '加强昏睡', 2 }, { '加强混乱', 2 } }, 等级 = 20, 亲和力 = 6, 种类 = '兽', 五行 = { 0, 50, 50, 0, 0 } },
        { name = '野狗', 皮肤 = 9027, 外形 = 2034, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -2 }, { '力量', 2 }, { '速度', 1 }, { '躲闪率', 2 }, { '狂暴几率', 2 } }, 等级 = 20, 亲和力 = 6, 种类 = '兽', 五行 = { 0, 50, 50, 0, 0 } },
        { name = '野狗', 皮肤 = 9028, 外形 = 2034, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 2 }, { '法力', -1 }, { '力量', 1 }, { '速度', 2 }, { '反击率', 6 }, { '反击次数', 2 } }, 等级 = 20, 亲和力 = 6, 种类 = '兽', 五行 = { 0, 50, 50, 0, 0 } },
        { name = '野狗', 皮肤 = 9028, 外形 = 2034, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 2 }, { '法力', -1 }, { '力量', 1 }, { '速度', 2 }, { '抗震慑', 1 }, { '抗雷', 1 }, { '物理吸收', 1 }, { '抗中毒', 1 } }, 等级 = 20, 亲和力 = 6, 种类 = '兽', 五行 = { 0, 50, 50, 0, 0 } },
        { name = '野狗', 皮肤 = 9028, 外形 = 2034, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -2 }, { '力量', 2 }, { '速度', 1 }, { '抗火', 1 }, { '抗水', 1 }, { '抗雷', 2 } }, 等级 = 20, 亲和力 = 6, 种类 = '兽', 五行 = { 0, 50, 50, 0, 0 } },
    },
    家丁卡 = {
        { name = '家丁', 皮肤 = 9021, 外形 = 2047, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', 2 }, { '力量', 2 }, { '加强火', 1 }, { '加强水', 2 } }, 等级 = 16, 亲和力 = 14, 种类 = '人', 五行 = { 35, 0, 0, 0, 65 } },
        { name = '家丁', 皮肤 = 9021, 外形 = 2047, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 1 }, { '加强风', 2 }, { '加强雷', 1 } }, 等级 = 16, 亲和力 = 14, 种类 = '人', 五行 = { 35, 0, 0, 0, 65 } },
        { name = '家丁', 皮肤 = 9021, 外形 = 2047, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -2 }, { '力量', 3 }, { '反击率', 3 }, { '反击次数', 3 } }, 等级 = 16, 亲和力 = 14, 种类 = '人', 五行 = { 35, 0, 0, 0, 65 } },
        { name = '家丁', 皮肤 = 9022, 外形 = 2047, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 1 }, { '反震率', 2 }, { '反震程度', 2 }, { '忽视防御几率', 2 }, { '忽视防御程度', 1 } }, 等级 = 16, 亲和力 = 14, 种类 = '人', 五行 = { 35, 0, 0, 0, 65 } },
        { name = '家丁', 皮肤 = 9022, 外形 = 2047, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -2 }, { '力量', 2 }, { '抗昏睡', 4 } }, 等级 = 16, 亲和力 = 14, 种类 = '人', 五行 = { 35, 0, 0, 0, 65 } },
        { name = '家丁', 皮肤 = 9022, 外形 = 2047, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 1 }, { '抗风', 2 }, { '抗封印', 2 } }, 等级 = 16, 亲和力 = 14, 种类 = '人', 五行 = { 35, 0, 0, 0, 65 } },
    },
    冲冲虫卡 = {
        { name = '冲冲虫', 皮肤 = 9080, 外形 = 2005, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', -1 }, { '法力', 3 }, { '力量', 1 }, { '速度', 5 }, { '加强风', 2 }, { '加强雷', 2 }, { '加强火', 2 }, { '加强水', 2 } }, 等级 = 61, 亲和力 = 15, 种类 = '兽', 五行 = { 30, 0, 0, 0, 70 } },
        { name = '冲冲虫', 皮肤 = 9080, 外形 = 2005, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', -1 }, { '法力', 3 }, { '力量', 1 }, { '速度', 5 }, { '连击次数', 6 }, { '躲闪率', 2 }, { '连击率', 4 } }, 等级 = 61, 亲和力 = 15, 种类 = '兽', 五行 = { 30, 0, 0, 0, 70 } },
        { name = '冲冲虫', 皮肤 = 9080, 外形 = 2005, 分类 = '抗性', 价格 = 130000, 属性 = { { '气血', -1 }, { '法力', 3 }, { '力量', 1 }, { '速度', 5 }, { '抗封印', 2 }, { '抗中毒', 1 }, { '抗昏睡', 2 }, { '抗混乱', 2 } }, 等级 = 61, 亲和力 = 15, 种类 = '兽', 五行 = { 30, 0, 0, 0, 70 } },
    },
    地狱战神卡 = {
        { name = '地狱战神', 皮肤 = 9093, 外形 = 2074, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 5 }, { '法力', 7 }, { '速度', -3 }, { '加强风', 8 } }, 等级 = 74, 亲和力 = 16, 种类 = '神', 五行 = { 0, 0, 50, 0, 50 } },
        { name = '地狱战神', 皮肤 = 9093, 外形 = 2074, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', 5 }, { '法力', 7 }, { '速度', -3 }, { '反击率', 13 }, { '反击次数', 3 } }, 等级 = 74, 亲和力 = 16, 种类 = '神', 五行 = { 0, 0, 50, 0, 50 } },
        { name = '地狱战神', 皮肤 = 9093, 外形 = 2074, 分类 = '抗性', 价格 = 130000, 属性 = { { '气血', 5 }, { '法力', 7 }, { '速度', -3 }, { '抗雷', 7 }, { '抗风', 2 }, { '物理吸收', 2 } }, 等级 = 74, 亲和力 = 16, 种类 = '神', 五行 = { 0, 0, 50, 0, 50 } },
    },
    画皮娘子卡 = {
        { name = '画皮娘子', 皮肤 = 9299, 外形 = 6599, 分类 = '抗性', 价格 = 195000, 属性 = { { '力量', 14 }, { '速度', 6 }, { '抗火', 4 }, { '抗水', -4 }, { '抗雷', 2 }, { '抗混乱', 5 }, { '抗封印', 2 } }, 等级 = 100, 亲和力 = 10, 种类 = '人', 五行 = { 50, 0, 0, 50, 0 } },
        { name = '画皮娘子', 皮肤 = 9299, 外形 = 6599, 分类 = '强法', 价格 = 195000, 属性 = { { '力量', 14 }, { '速度', 6 }, { '加强封印', 7 }, { '加强昏睡', 7 } }, 等级 = 100, 亲和力 = 10, 种类 = '人', 五行 = { 50, 0, 0, 50, 0 } },
        { name = '画皮娘子', 皮肤 = 9299, 外形 = 6599, 分类 = '物理', 价格 = 195000, 属性 = { { '力量', 14 }, { '速度', 6 }, { '连击率', 15 }, { '连击次数', 2 }, { '致命几率', 4 }, { '忽视防御几率', 5 }, { '忽视防御程度', 5 } }, 等级 = 100, 亲和力 = 10, 种类 = '人', 五行 = { 50, 0, 0, 50, 0 } },
    },
    冰雪魔卡 = {
        { name = '冰雪魔', 皮肤 = 9104, 外形 = 2099, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 6 }, { '法力', -3 }, { '速度', 7 }, { '加强昏睡', 5 }, { '加强封印', 5 } }, 等级 = 85, 亲和力 = 10, 种类 = '妖', 五行 = { 0, 0, 100, 0, 0 } },
        { name = '冰雪魔', 皮肤 = 9104, 外形 = 2099, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 6 }, { '法力', -3 }, { '速度', 7 }, { '躲闪率', 3 }, { '致命几率', 7 } }, 等级 = 85, 亲和力 = 10, 种类 = '妖', 五行 = { 0, 0, 100, 0, 0 } },
        { name = '冰雪魔', 皮肤 = 9104, 外形 = 2099, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 6 }, { '法力', -3 }, { '速度', 7 }, { '抗火', -6 }, { '抗水', 4 }, { '抗雷', 4 }, { '抗风', 4 }, { '物理吸收', 4 } }, 等级 = 85, 亲和力 = 10, 种类 = '妖', 五行 = { 0, 0, 100, 0, 0 } },
    },
    精怪卡 = {
        { name = '精怪', 皮肤 = 9082, 外形 = 2019, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 2 }, { '法力', -1 }, { '力量', 8 }, { '速度', -1 }, { '加强昏睡', 2 }, { '加强封印', 6 } }, 等级 = 63, 亲和力 = 15, 种类 = '妖', 五行 = { 80, 0, 0, 20, 0 } },
        { name = '精怪', 皮肤 = 9082, 外形 = 2019, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', 2 }, { '法力', -1 }, { '力量', 8 }, { '速度', -1 }, { '忽视防御几率', 6 }, { '躲闪率', 4 }, { '忽视防御程度', 3 } }, 等级 = 63, 亲和力 = 15, 种类 = '妖', 五行 = { 80, 0, 0, 20, 0 } },
        { name = '精怪', 皮肤 = 9082, 外形 = 2019, 分类 = '抗性', 价格 = 130000, 属性 = { { '气血', 2 }, { '法力', -1 }, { '力量', 8 }, { '速度', -1 }, { '抗水', 3 }, { '抗雷', 5 }, { '抗风', -1 } }, 等级 = 63, 亲和力 = 15, 种类 = '妖', 五行 = { 80, 0, 0, 20, 0 } },
    },
    大象卡 = {
        { name = '大象', 皮肤 = 9051, 外形 = 2085, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 5 }, { '力量', 4 }, { '速度', -3 }, { '加强风', 2 }, { '加强混乱', 3 } }, 等级 = 32, 亲和力 = 11, 种类 = '兽', 五行 = { 0, 35, 0, 0, 65 } },
        { name = '大象', 皮肤 = 9051, 外形 = 2085, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 5 }, { '力量', 4 }, { '速度', -3 }, { '忽视防御几率', 4 }, { '忽视防御程度', 2 }, { '狂暴几率', 3 } }, 等级 = 32, 亲和力 = 11, 种类 = '兽', 五行 = { 0, 35, 0, 0, 65 } },
        { name = '大象', 皮肤 = 9051, 外形 = 2085, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 5 }, { '力量', 4 }, { '速度', -3 }, { '抗火', -2 }, { '抗水', 3 }, { '物理吸收', 5 }, { '抗昏睡', -1 } }, 等级 = 32, 亲和力 = 11, 种类 = '兽', 五行 = { 0, 35, 0, 0, 65 } },
    },
    孤魂卡 = {
        { name = '孤魂', 皮肤 = 9071, 外形 = 2054, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 3 }, { '力量', 4 }, { '速度', -2 }, { '加强毒', 7 } }, 等级 = 52, 亲和力 = 13, 种类 = '鬼', 五行 = { 0, 35, 0, 0, 65 } },
        { name = '孤魂', 皮肤 = 9071, 外形 = 2054, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 3 }, { '力量', 4 }, { '速度', -2 }, { '忽视防御几率', 3 }, { '忽视防御程度', 3 }, { '狂暴几率', 3 } }, 等级 = 52, 亲和力 = 13, 种类 = '鬼', 五行 = { 0, 35, 0, 0, 65 } },
        { name = '孤魂', 皮肤 = 9071, 外形 = 2054, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 3 }, { '力量', 4 }, { '速度', -2 }, { '抗震慑', 1 }, { '物理吸收', 2 }, { '抗混乱', 4 } }, 等级 = 52, 亲和力 = 13, 种类 = '鬼', 五行 = { 0, 35, 0, 0, 65 } },
    },
    死灵卡 = {
        { name = '死灵', 皮肤 = 9091, 外形 = 2027, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 5 }, { '力量', 6 }, { '速度', -2 }, { '加强封印', 4 }, { '加强混乱', 4 } }, 等级 = 71, 亲和力 = 14, 种类 = '鬼', 五行 = { 0, 0, 30, 0, 70 } },
        { name = '死灵', 皮肤 = 9091, 外形 = 2027, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', 5 }, { '力量', 6 }, { '速度', -2 }, { '躲闪率', 5 }, { '狂暴几率', 3 } }, 等级 = 71, 亲和力 = 14, 种类 = '鬼', 五行 = { 0, 0, 30, 0, 70 } },
        { name = '死灵', 皮肤 = 9091, 外形 = 2027, 分类 = '抗性', 价格 = 130000, 属性 = { { '气血', 5 }, { '力量', 6 }, { '速度', -2 }, { '抗震慑', 2 }, { '抗中毒', 3 }, { '物理吸收', 3 } }, 等级 = 71, 亲和力 = 14, 种类 = '鬼', 五行 = { 0, 0, 30, 0, 70 } },
    },
    野蛮王卡 = {
        { name = '野蛮王', 皮肤 = 9090, 外形 = 2026, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 3 }, { '法力', 1 }, { '力量', 3 }, { '速度', 2 }, { '加强昏睡', 5 }, { '加强封印', 3 } }, 等级 = 73, 亲和力 = 18, 种类 = '人', 五行 = { 0, 60, 40, 0, 0 } },
        { name = '野蛮王', 皮肤 = 9090, 外形 = 2026, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', 3 }, { '法力', 1 }, { '力量', 3 }, { '速度', 2 }, { '忽视防御几率', 4 }, { '忽视防御程度', 2 }, { '狂暴几率', 6 } }, 等级 = 73, 亲和力 = 18, 种类 = '人', 五行 = { 0, 60, 40, 0, 0 } },
        { name = '野蛮王', 皮肤 = 9090, 外形 = 2026, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 3 }, { '法力', 1 }, { '力量', 3 }, { '速度', 2 }, { '抗昏睡', 1 }, { '物理吸收', 4 }, { '抗混乱', 3 } }, 等级 = 73, 亲和力 = 18, 种类 = '人', 五行 = { 0, 60, 40, 0, 0 } },
    },
    鸟嘴兽卡 = {
        { name = '鸟嘴兽', 皮肤 = 9081, 外形 = 2014, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 7 }, { '法力', 2 }, { '力量', 1 }, { '速度', -2 }, { '加强混乱', 5 }, { '加强火', 3 } }, 等级 = 62, 亲和力 = 17, 种类 = '兽', 五行 = { 60, 0, 0, 0, 40 } },
        { name = '鸟嘴兽', 皮肤 = 9081, 外形 = 2014, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', 7 }, { '法力', 2 }, { '力量', 1 }, { '速度', -2 }, { '反震率', 5 }, { '反击率', 2 }, { '反震程度', 5 }, { '反击次数', 2 } }, 等级 = 62, 亲和力 = 17, 种类 = '兽', 五行 = { 60, 0, 0, 0, 40 } },
        { name = '鸟嘴兽', 皮肤 = 9081, 外形 = 2014, 分类 = '抗性', 价格 = 130000, 属性 = { { '气血', 7 }, { '法力', 2 }, { '力量', 1 }, { '速度', -2 }, { '物理吸收', 3 }, { '抗雷', 4 } }, 等级 = 62, 亲和力 = 17, 种类 = '兽', 五行 = { 60, 0, 0, 0, 40 } },
    },
    桃花仙卡 = {
        { name = '桃花仙', 皮肤 = 9101, 外形 = 2096, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 2 }, { '速度', 2 }, { '加强风', 5 }, { '加强水', 4 } }, 等级 = 82, 亲和力 = 14, 种类 = '神', 五行 = { 0, 100, 0, 0, 0 } },
        { name = '桃花仙', 皮肤 = 9101, 外形 = 2096, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 2 }, { '速度', 2 }, { '反震率', 6 }, { '反震程度', 12 } }, 等级 = 82, 亲和力 = 14, 种类 = '神', 五行 = { 0, 100, 0, 0, 0 } },
        { name = '桃花仙', 皮肤 = 9101, 外形 = 2096, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 2 }, { '速度', 2 }, { '抗火', -5 }, { '抗水', 5 }, { '抗雷', 5 }, { '抗风', 4 } }, 等级 = 82, 亲和力 = 14, 种类 = '神', 五行 = { 0, 100, 0, 0, 0 } },
    },
    垂云叟卡 = {
        { name = '垂云叟', 皮肤 = 9116, 外形 = 2112, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 10 }, { '法力', 12 }, { '抗火', -6 }, { '抗水', 8 }, { '抗雷', 4 }, { '抗风', 7 }, { '抗混乱', 3 }, { '抗昏睡', 4 }, { '抗震慑', 3 } }, 等级 = 100, 亲和力 = 18, 种类 = '人', 五行 = { 10, 10, 50, 10, 20 } },
        { name = '垂云叟', 皮肤 = 9116, 外形 = 2112, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 10 }, { '法力', 12 }, { '加强封印', 8 }, { '加强毒', 10 } }, 等级 = 100, 亲和力 = 18, 种类 = '人', 五行 = { 10, 10, 50, 10, 20 } },
        { name = '垂云叟', 皮肤 = 9116, 外形 = 2112, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 10 }, { '法力', 12 }, { '反震程度', 18 }, { '反震几率', 7 } }, 等级 = 100, 亲和力 = 18, 种类 = '人', 五行 = { 10, 10, 50, 10, 20 } },
    },
    幽灵卡 = {
        { name = '幽灵', 皮肤 = 9072, 外形 = 2051, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 3 }, { '速度', -2 }, { '加强火', 7 } }, 等级 = 53, 亲和力 = 14, 种类 = '鬼', 五行 = { 0, 0, 40, 0, 60 } },
        { name = '幽灵', 皮肤 = 9072, 外形 = 2051, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 3 }, { '速度', -2 }, { '连击次数', 8 }, { '连击率', 4 } }, 等级 = 53, 亲和力 = 14, 种类 = '鬼', 五行 = { 0, 0, 40, 0, 60 } },
        { name = '幽灵', 皮肤 = 9072, 外形 = 2051, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 3 }, { '速度', -2 }, { '抗震慑', 1 }, { '抗昏睡', 4 }, { '物理吸收', 2 } }, 等级 = 53, 亲和力 = 14, 种类 = '鬼', 五行 = { 0, 0, 40, 0, 60 } },
    },
    龙马卡 = {
        { name = '龙马', 皮肤 = 9281, 外形 = 2453, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 13 }, { '法力', 3 }, { '力量', 18 }, { '抗雷', 3 }, { '抗风', -3 }, { '抗混乱', 5 }, { '抗封印', 2 } }, 等级 = 100, 亲和力 = 12, 种类 = '兽', 五行 = { 0, 0, 50, 0, 50 } },
        { name = '龙马', 皮肤 = 9281, 外形 = 2453, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 13 }, { '法力', 3 }, { '力量', 18 }, { '加强混乱', 8 }, { '加强昏睡', 7 } }, 等级 = 100, 亲和力 = 12, 种类 = '兽', 五行 = { 0, 0, 50, 0, 50 } },
        { name = '龙马', 皮肤 = 9281, 外形 = 2453, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 13 }, { '法力', 3 }, { '力量', 18 }, { '连击次数', 2 }, { '连击率', 9 }, { '狂暴几率', 12 }, { '忽视防御程度', 15 }, { '忽视防御几率', 8 } }, 等级 = 100, 亲和力 = 12, 种类 = '兽', 五行 = { 0, 0, 50, 0, 50 } },
    },
    雷鸟人卡 = {
        { name = '雷鸟人', 皮肤 = 9087, 外形 = 2023, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 7 }, { '法力', -2 }, { '力量', 5 }, { '速度', -1 }, { '加强风', 4 }, { '加强雷', 4 } }, 等级 = 68, 亲和力 = 16, 种类 = '神', 五行 = { 40, 0, 0, 60, 0 } },
        { name = '雷鸟人', 皮肤 = 9087, 外形 = 2023, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', 7 }, { '法力', -2 }, { '力量', 5 }, { '速度', -1 }, { '忽视防御几率', 4 }, { '忽视防御程度', 2 }, { '狂暴几率', 5 } }, 等级 = 68, 亲和力 = 16, 种类 = '神', 五行 = { 40, 0, 0, 60, 0 } },
        { name = '雷鸟人', 皮肤 = 9087, 外形 = 2023, 分类 = '抗性', 价格 = 130000, 属性 = { { '气血', 7 }, { '法力', -2 }, { '力量', 5 }, { '速度', -1 }, { '物理吸收', 3 }, { '抗雷', 5 } }, 等级 = 68, 亲和力 = 16, 种类 = '神', 五行 = { 40, 0, 0, 60, 0 } },
    },
    赭炎卡 = {
        { name = '赭炎', 皮肤 = 9302, 外形 = 2377, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', -2 }, { '力量', 14 }, { '速度', 2 }, { '抗火', 4 }, { '抗水', -4 }, { '抗雷', 4 }, { '抗混乱', 4 }, { '抗封印', 4 } }, 等级 = 100, 亲和力 = 11, 种类 = '妖', 五行 = { 0, 0, 0, 100, 0 } },
        { name = '赭炎', 皮肤 = 9302, 外形 = 2377, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', -2 }, { '力量', 14 }, { '速度', 2 }, { '加强火', 9 }, { '加强雷', 7 } }, 等级 = 100, 亲和力 = 11, 种类 = '妖', 五行 = { 0, 0, 0, 100, 0 } },
        { name = '赭炎', 皮肤 = 9302, 外形 = 2377, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', -2 }, { '力量', 14 }, { '速度', 2 }, { '忽视防御程度', 11 }, { '忽视防御几率', 8 } }, 等级 = 100, 亲和力 = 11, 种类 = '妖', 五行 = { 0, 0, 0, 100, 0 } },
    },
    寒钢怪卡 = {
        { name = '寒钢怪', 皮肤 = 9088, 外形 = 2008, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 3 }, { '加强昏睡', 6 }, { '加强封印', 2 } }, 等级 = 69, 亲和力 = 11, 种类 = '妖', 五行 = { 95, 0, 5, 0, 0 } },
        { name = '寒钢怪', 皮肤 = 9088, 外形 = 2008, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 3 }, { '狂暴几率', 8 } }, 等级 = 69, 亲和力 = 11, 种类 = '妖', 五行 = { 95, 0, 5, 0, 0 } },
        { name = '寒钢怪', 皮肤 = 9088, 外形 = 2008, 分类 = '抗性', 价格 = 130000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 3 }, { '抗雷', 8 } }, 等级 = 69, 亲和力 = 11, 种类 = '妖', 五行 = { 95, 0, 5, 0, 0 } },
    },
    麒麟兽卡 = {
        { name = '麒麟兽', 皮肤 = 9110, 外形 = 2105, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 10 }, { '法力', 10 }, { '速度', -40 }, { '加强风', 2 }, { '加强雷', 2 }, { '加强火', 3 }, { '加强水', 3 } }, 等级 = 91, 亲和力 = 19, 种类 = '兽', 五行 = { 0, 0, 0, 100, 0 } },
        { name = '麒麟兽', 皮肤 = 9110, 外形 = 2105, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 10 }, { '法力', 10 }, { '速度', -40 }, { '狂暴几率', 2 }, { '致命几率', 8 } }, 等级 = 91, 亲和力 = 19, 种类 = '兽', 五行 = { 0, 0, 0, 100, 0 } },
        { name = '麒麟兽', 皮肤 = 9110, 外形 = 2105, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 10 }, { '法力', 10 }, { '速度', -40 }, { '抗水', -3 }, { '抗雷', 4 }, { '抗风', 4 }, { '物理吸收', 5 } }, 等级 = 91, 亲和力 = 19, 种类 = '兽', 五行 = { 0, 0, 0, 100, 0 } },
    },
    五叶卡 = {
        { name = '五叶', 皮肤 = 9122, 外形 = 2111, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 10 }, { '法力', -2 }, { '速度', 8 }, { '物理吸收', 5 }, { '抗混乱', 4 }, { '抗昏睡', 2 }, { '抗封印', 5 } }, 等级 = 100, 亲和力 = 12, 种类 = '神', 五行 = { 10, 50, 20, 10, 10 } },
        { name = '五叶', 皮肤 = 9122, 外形 = 2111, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 10 }, { '法力', -2 }, { '速度', 8 }, { '加强风', 8 }, { '加强水', 9 } }, 等级 = 100, 亲和力 = 12, 种类 = '神', 五行 = { 10, 50, 20, 10, 10 } },
        { name = '五叶', 皮肤 = 9122, 外形 = 2111, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 10 }, { '法力', -2 }, { '速度', 8 }, { '反震程度', 5 }, { '反震几率', 20 }, { '躲闪率', 3 } }, 等级 = 100, 亲和力 = 12, 种类 = '神', 五行 = { 10, 50, 20, 10, 10 } },
    },
    两角怪卡 = {
        { name = '两角怪', 皮肤 = 9077, 外形 = 2013, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 4 }, { '法力', 2 }, { '力量', 3 }, { '速度', -1 }, { '加强雷', 4 }, { '加强封印', 3 } }, 等级 = 58, 亲和力 = 16, 种类 = '妖', 五行 = { 50, 0, 0, 0, 50 } },
        { name = '两角怪', 皮肤 = 9077, 外形 = 2013, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', 4 }, { '法力', 2 }, { '力量', 3 }, { '速度', -1 }, { '反击率', 5 }, { '反击次数', 3 }, { '致命几率', 3 } }, 等级 = 58, 亲和力 = 16, 种类 = '妖', 五行 = { 50, 0, 0, 0, 50 } },
        { name = '两角怪', 皮肤 = 9077, 外形 = 2013, 分类 = '抗性', 价格 = 130000, 属性 = { { '气血', 4 }, { '法力', 2 }, { '力量', 3 }, { '速度', -1 }, { '抗封印', 3 }, { '抗混乱', 4 } }, 等级 = 58, 亲和力 = 16, 种类 = '妖', 五行 = { 50, 0, 0, 0, 50 } },
    },
    小龙女卡 = {
        { name = '小龙女', 皮肤 = 9044, 外形 = 2024, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 3 }, { '抗水', 5 }, { '加强雷', 1 }, { '加强水', 4 } }, 等级 = 25, 亲和力 = 4, 种类 = '妖', 五行 = { 0, 0, 25, 5, 0 } },
        { name = '小龙女', 皮肤 = 9044, 外形 = 2024, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 3 }, { '忽视防御几率', 4 }, { '躲闪率', 2 }, { '忽视防御程度', 2 } }, 等级 = 25, 亲和力 = 4, 种类 = '妖', 五行 = { 0, 0, 25, 5, 0 } },
        { name = '小龙女', 皮肤 = 9044, 外形 = 2024, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 3 }, { '抗昏睡', -2 }, { '抗雷', 1 }, { '抗水', 6 } }, 等级 = 25, 亲和力 = 4, 种类 = '妖', 五行 = { 0, 0, 25, 5, 0 } },
    },
    神兵卡 = {
        { name = '神兵', 皮肤 = 9097, 外形 = 2061, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 1 }, { '力量', 7 }, { '速度', 2 }, { '加强昏睡', 5 }, { '加强封印', 4 } }, 等级 = 78, 亲和力 = 18, 种类 = '神', 五行 = { 65, 0, 0, 0, 35 } },
        { name = '神兵', 皮肤 = 9097, 外形 = 2061, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 1 }, { '力量', 7 }, { '速度', 2 }, { '忽视防御几率', 10 }, { '躲闪率', 2 }, { '忽视防御程度', 6 } }, 等级 = 78, 亲和力 = 18, 种类 = '神', 五行 = { 65, 0, 0, 0, 35 } },
        { name = '神兵', 皮肤 = 9097, 外形 = 2061, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 1 }, { '力量', 7 }, { '速度', 2 }, { '抗封印', 2 }, { '抗中毒', 1 }, { '抗中毒', 3 }, { '抗混乱', 3 } }, 等级 = 78, 亲和力 = 18, 种类 = '神', 五行 = { 65, 0, 0, 0, 35 } },
    },
    凤凰卡 = {
        { name = '凤凰', 皮肤 = 9095, 外形 = 2071, 分类 = '强法', 价格 = 195000, 属性 = { { '法力', 5 }, { '速度', 5 }, { '加强雷', 2 }, { '加强火', 7 } }, 等级 = 76, 亲和力 = 10, 种类 = '兽', 五行 = { 0, 0, 0, 95, 5 } },
        { name = '凤凰', 皮肤 = 9095, 外形 = 2071, 分类 = '强法', 价格 = 195000, 属性 = { { '法力', 5 }, { '速度', 5 }, { '忽视防御几率', 4 }, { '躲闪率', 4 }, { '忽视防御程度', 2 }, { '致命几率', 2 } }, 等级 = 76, 亲和力 = 10, 种类 = '兽', 五行 = { 0, 0, 0, 95, 5 } },
        { name = '凤凰', 皮肤 = 9095, 外形 = 2071, 分类 = '强法', 价格 = 195000, 属性 = { { '法力', 5 }, { '速度', 5 }, { '抗火', 7 }, { '抗水', -3 }, { '抗雷', 2 }, { '抗风', 3 } }, 等级 = 76, 亲和力 = 10, 种类 = '兽', 五行 = { 0, 0, 0, 95, 5 } },
    },
    复活女娲卡 = {
        { name = '复活女娲', 皮肤 = 9065, 外形 = 2288, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 4 }, { '速度', 1 }, { '加强雷', 6 } }, 等级 = 46, 亲和力 = 16, 种类 = '神', 五行 = { 75, 0, 0, 25, 0 } },
        { name = '复活女娲', 皮肤 = 9065, 外形 = 2288, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 4 }, { '速度', 1 }, { '躲闪率', 3 }, { '致命几率', 3 } }, 等级 = 46, 亲和力 = 16, 种类 = '神', 五行 = { 75, 0, 0, 25, 0 } },
        { name = '复活女娲', 皮肤 = 9065, 外形 = 2288, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 4 }, { '速度', 1 }, { '抗水', 4 }, { '抗雷', 1 }, { '抗风', 1 } }, 等级 = 46, 亲和力 = 16, 种类 = '神', 五行 = { 75, 0, 0, 25, 0 } },
    },
    金不换卡 = {
        { name = '金不换', 皮肤 = 9304, 外形 = 3847, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 2 }, { '法力', 11 }, { '速度', 6 }, { '抗火', -2 }, { '抗雷', 2 }, { '抗混乱', 5 } }, 等级 = 100, 亲和力 = 17, 种类 = '人', 五行 = { 80, 0, 0, 20, 0 } },
        { name = '金不换', 皮肤 = 9304, 外形 = 3847, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 2 }, { '法力', 11 }, { '速度', 6 }, { '加强风', 7 }, { '加强水', 8 } }, 等级 = 100, 亲和力 = 17, 种类 = '人', 五行 = { 80, 0, 0, 20, 0 } },
        { name = '金不换', 皮肤 = 9304, 外形 = 3847, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 2 }, { '法力', 11 }, { '速度', 6 }, { '连击率', 15 }, { '连击次数', 6 } }, 等级 = 100, 亲和力 = 17, 种类 = '人', 五行 = { 80, 0, 0, 20, 0 } },
    },
    武士卡 = {
        { name = '武士', 皮肤 = 9035, 外形 = 2043, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 2 }, { '力量', 3 }, { '速度', -1 }, { '加强昏睡', 3 }, { '加强火', 1 } }, 等级 = 7, 亲和力 = 15, 种类 = '人', 五行 = { 0, 0, 0, 50, 50 } },
        { name = '武士', 皮肤 = 9035, 外形 = 2043, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 3 }, { '力量', 2 }, { '速度', -1 }, { '加强昏睡', 3 }, { '加强火', 1 } }, 等级 = 7, 亲和力 = 15, 种类 = '人', 五行 = { 0, 0, 0, 50, 50 } },
        { name = '武士', 皮肤 = 9035, 外形 = 2043, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 2 }, { '力量', 3 }, { '速度', -1 }, { '连击次数', 4 }, { '连击率', 4 } }, 等级 = 7, 亲和力 = 15, 种类 = '人', 五行 = { 0, 0, 0, 50, 50 } },
        { name = '武士', 皮肤 = 9036, 外形 = 2043, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 3 }, { '力量', 2 }, { '速度', -1 }, { '忽视防御几率', 8 }, { '忽视防御程度', 4 } }, 等级 = 7, 亲和力 = 15, 种类 = '人', 五行 = { 0, 0, 0, 50, 50 } },
        { name = '武士', 皮肤 = 9036, 外形 = 2043, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 2 }, { '力量', 3 }, { '速度', -1 }, { '抗封印', 1 }, { '抗昏睡', 1 }, { '抗混乱', 2 } }, 等级 = 7, 亲和力 = 15, 种类 = '人', 五行 = { 0, 0, 0, 50, 50 } },
        { name = '武士', 皮肤 = 9036, 外形 = 2043, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 3 }, { '力量', 2 }, { '速度', -1 }, { '抗风', 3 }, { '物理吸收', 1 } }, 等级 = 7, 亲和力 = 15, 种类 = '人', 五行 = { 0, 0, 0, 50, 50 } },
    },
    独眼巨人卡 = {
        { name = '独眼巨人', 皮肤 = 9089, 外形 = 2018, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 2 }, { '速度', 1 }, { '加强封印', 1 }, { '加强混乱', 7 } }, 等级 = 70, 亲和力 = 17, 种类 = '人', 五行 = { 0, 0, 0, 30, 70 } },
        { name = '独眼巨人', 皮肤 = 9089, 外形 = 2018, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 2 }, { '速度', 1 }, { '狂暴几率', 4 }, { '致命几率', 4 } }, 等级 = 70, 亲和力 = 17, 种类 = '人', 五行 = { 0, 0, 0, 30, 70 } },
        { name = '独眼巨人', 皮肤 = 9089, 外形 = 2018, 分类 = '抗性', 价格 = 130000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 2 }, { '速度', 1 }, { '抗昏睡', 3 }, { '抗雷', 3 }, { '物理吸收', 2 } }, 等级 = 70, 亲和力 = 17, 种类 = '人', 五行 = { 0, 0, 0, 30, 70 } },
    },
    -- 妖蝎卡={
    -- {name='妖蝎',皮肤=9003,外形=1,分类='抗性',价格=195000,属性={{'气血',-3},{'力量',9},{'速度',5},{'抗混乱',3}},等级=100,亲和力=18,种类='妖',五行={0,25,0,0,75}},
    -- {name='妖蝎',皮肤=9003,外形=1,分类='强法',价格=195000,属性={{'气血',-3},{'力量',9},{'速度',5},{'加强毒',8},{'加强火',5}},等级=100,亲和力=18,种类='妖',五行={0,25,0,0,75}},
    -- {name='妖蝎',皮肤=9003,外形=1,分类='物理',价格=195000,属性={{'气血',-3},{'力量',9},{'速度',5},{'连击率',6},{'忽视防御几率',4},{'忽视防御程度',9}},等级=100,亲和力=18,种类='妖',五行={0,25,0,0,75}},
    -- },
    打手卡 = {
        { name = '打手', 皮肤 = 9061, 外形 = 2087, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 3 }, { '力量', 4 }, { '速度', -1 }, { '加强昏睡', 2 }, { '加强封印', 4 } }, 等级 = 37, 亲和力 = 15, 种类 = '人', 五行 = { 50, 50, 0, 0, 0 } },
        { name = '打手', 皮肤 = 9061, 外形 = 2087, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 3 }, { '力量', 4 }, { '速度', -1 }, { '躲闪率', 1 }, { '狂暴几率', 4 } }, 等级 = 37, 亲和力 = 15, 种类 = '人', 五行 = { 50, 50, 0, 0, 0 } },
        { name = '打手', 皮肤 = 9061, 外形 = 2087, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 3 }, { '力量', 4 }, { '速度', -1 }, { '物理吸收', 4 }, { '抗震慑', 2 } }, 等级 = 37, 亲和力 = 15, 种类 = '人', 五行 = { 50, 50, 0, 0, 0 } },
    },
    山妖卡 = {
        { name = '山妖', 皮肤 = 9083, 外形 = 2025, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 7 }, { '速度', -1 }, { '加强风', 8 } }, 等级 = 64, 亲和力 = 12, 种类 = '妖', 五行 = { 30, 0, 0, 0, 70 } },
        { name = '山妖', 皮肤 = 9083, 外形 = 2025, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 7 }, { '速度', -1 }, { '狂暴几率', 4 }, { '致命几率', 3 } }, 等级 = 64, 亲和力 = 12, 种类 = '妖', 五行 = { 30, 0, 0, 0, 70 } },
        { name = '山妖', 皮肤 = 9083, 外形 = 2025, 分类 = '抗性', 价格 = 130000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 7 }, { '速度', -1 }, { '抗雷', 4 }, { '物理吸收', 4 } }, 等级 = 64, 亲和力 = 12, 种类 = '妖', 五行 = { 30, 0, 0, 0, 70 } },
    },
    蝴蝶仙子卡 = {
        { name = '蝴蝶仙子', 皮肤 = 9084, 外形 = 2011, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', -2 }, { '法力', -2 }, { '力量', 6 }, { '速度', 6 }, { '加强火', 8 } }, 等级 = 65, 亲和力 = 9, 种类 = '神', 五行 = { 0, 60, 40, 0, 0 } },
        { name = '蝴蝶仙子', 皮肤 = 9084, 外形 = 2011, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', -2 }, { '法力', -2 }, { '力量', 6 }, { '速度', 6 }, { '躲闪率', 7 } }, 等级 = 65, 亲和力 = 9, 种类 = '神', 五行 = { 0, 60, 40, 0, 0 } },
        { name = '蝴蝶仙子', 皮肤 = 9084, 外形 = 2011, 分类 = '抗性', 价格 = 130000, 属性 = { { '气血', -2 }, { '法力', -2 }, { '力量', 6 }, { '速度', 6 }, { '抗昏睡', 4 }, { '抗风', -2 }, { '抗封印', 3 }, { '抗混乱', 3 } }, 等级 = 65, 亲和力 = 9, 种类 = '神', 五行 = { 0, 60, 40, 0, 0 } },
    },
    古代瑞兽卡 = {
        { name = '古代瑞兽', 皮肤 = 9085, 外形 = 2041, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 8 }, { '法力', 4 }, { '力量', -3 }, { '速度', -1 }, { '加强混乱', 4 }, { '加强封印', 4 } }, 等级 = 66, 亲和力 = 17, 种类 = '兽', 五行 = { 65, 0, 0, 0, 35 } },
        { name = '古代瑞兽', 皮肤 = 9085, 外形 = 2041, 分类 = '物理', 价格 = 130000, 属性 = { { '气血', 8 }, { '法力', 4 }, { '力量', -3 }, { '速度', -1 }, { '反震率', 10 }, { '反震程度', 4 } }, 等级 = 66, 亲和力 = 17, 种类 = '兽', 五行 = { 65, 0, 0, 0, 35 } },
        { name = '古代瑞兽', 皮肤 = 9085, 外形 = 2041, 分类 = '强法', 价格 = 130000, 属性 = { { '气血', 8 }, { '法力', 4 }, { '力量', -3 }, { '速度', -1 }, { '抗水', 3 }, { '抗中毒', 2 }, { '物理吸收', 3 } }, 等级 = 66, 亲和力 = 17, 种类 = '兽', 五行 = { 65, 0, 0, 0, 35 } },
    },
    松鼠卡 = {
        { name = '松鼠', 皮肤 = 9306, 外形 = 3481, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 5 }, { '力量', 9 }, { '速度', 4 }, { '抗风', 6 }, { '抗混乱', 4 }, { '抗封印', 4 } }, 等级 = 100, 亲和力 = 14, 种类 = '兽', 五行 = { 0, 50, 0, 0, 50 } },
        { name = '松鼠', 皮肤 = 9306, 外形 = 3481, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 5 }, { '力量', 9 }, { '速度', 4 }, { '加强混乱', 8 }, { '加强封印', 6 }, { '加强风', 6 } }, 等级 = 100, 亲和力 = 14, 种类 = '兽', 五行 = { 0, 50, 0, 0, 50 } },
        { name = '松鼠', 皮肤 = 9306, 外形 = 3481, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 5 }, { '力量', 9 }, { '速度', 4 }, { '狂暴几率', 3 }, { '致命几率', 2 }, { '忽视防御程度', 9 }, { '忽视防御几率', 9 } }, 等级 = 100, 亲和力 = 14, 种类 = '兽', 五行 = { 0, 50, 0, 0, 50 } },
    },
    狮蝎卡 = {
        { name = '狮蝎', 皮肤 = 9113, 外形 = 2106, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 1 }, { '法力', 7 }, { '力量', 2 }, { '速度', 3 }, { '抗火', 8 }, { '抗水', -4 }, { '抗雷', 5 }, { '抗风', 4 }, { '抗混乱', 4 }, { '抗震慑', 2 } }, 等级 = 100, 亲和力 = 13, 种类 = '兽', 五行 = { 25, 0, 0, 75, 0 } },
        { name = '狮蝎', 皮肤 = 9113, 外形 = 2106, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 1 }, { '法力', 7 }, { '力量', 2 }, { '速度', 3 }, { '加强毒', 10 }, { '加强火', 10 } }, 等级 = 100, 亲和力 = 13, 种类 = '兽', 五行 = { 25, 0, 0, 75, 0 } },
        { name = '狮蝎', 皮肤 = 9113, 外形 = 2106, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 1 }, { '法力', 7 }, { '力量', 2 }, { '速度', 3 }, { '反震程度', 8 }, { '反震几率', 12 }, { '躲闪率', 9 } }, 等级 = 100, 亲和力 = 13, 种类 = '兽', 五行 = { 25, 0, 0, 75, 0 } },
    },
    羊头怪卡 = {
        { name = '羊头怪', 皮肤 = 9015, 外形 = 2007, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 2 }, { '力量', 1 }, { '加强雷', 1 }, { '加强毒', 2 } }, 等级 = 10, 亲和力 = 10, 种类 = '妖', 五行 = { 0, 55, 45, 0, 0 } },
        { name = '羊头怪', 皮肤 = 9015, 外形 = 2007, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 1 }, { '力量', 2 }, { '加强混乱', 3 } }, 等级 = 10, 亲和力 = 10, 种类 = '妖', 五行 = { 0, 55, 45, 0, 0 } },
        { name = '羊头怪', 皮肤 = 9015, 外形 = 2007, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 2 }, { '力量', 1 }, { '反击率', 2 }, { '躲闪率', 1 }, { '反击次数', 2 } }, 等级 = 10, 亲和力 = 10, 种类 = '妖', 五行 = { 0, 55, 45, 0, 0 } },
        { name = '羊头怪', 皮肤 = 9016, 外形 = 2007, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 1 }, { '力量', 2 }, { '忽视防御几率', 2 }, { '躲闪率', 2 }, { '忽视防御程度', 1 } }, 等级 = 10, 亲和力 = 10, 种类 = '妖', 五行 = { 0, 55, 45, 0, 0 } },
        { name = '羊头怪', 皮肤 = 9016, 外形 = 2007, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 2 }, { '力量', 1 }, { '抗风', 3 } }, 等级 = 10, 亲和力 = 10, 种类 = '妖', 五行 = { 0, 55, 45, 0, 0 } },
        { name = '羊头怪', 皮肤 = 9016, 外形 = 2007, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 1 }, { '力量', 2 }, { '抗封印', 1 }, { '抗昏睡', 1 }, { '抗混乱', 1 } }, 等级 = 10, 亲和力 = 10, 种类 = '妖', 五行 = { 0, 55, 45, 0, 0 } },
    },
    兔妖卡 = {
        { name = '兔妖', 皮肤 = 9013, 外形 = 2001, 分类 = '强法', 价格 = 13000, 属性 = { { '法力', -1 }, { '力量', 2 }, { '速度', 1 }, { '加强雷', 3 } }, 等级 = 9, 亲和力 = 8, 种类 = '妖', 五行 = { 35, 65, 0, 0, 0 } },
        { name = '兔妖', 皮肤 = 9013, 外形 = 2001, 分类 = '强法', 价格 = 13000, 属性 = { { '法力', -1 }, { '力量', 1 }, { '速度', 2 }, { '加强风', 2 }, { '加强雷', 1 } }, 等级 = 9, 亲和力 = 8, 种类 = '妖', 五行 = { 35, 65, 0, 0, 0 } },
        { name = '兔妖', 皮肤 = 9013, 外形 = 2001, 分类 = '物理', 价格 = 13000, 属性 = { { '法力', -1 }, { '力量', 2 }, { '速度', 1 }, { '连击次数', 3 }, { '连击率', 3 } }, 等级 = 9, 亲和力 = 8, 种类 = '妖', 五行 = { 35, 65, 0, 0, 0 } },
        { name = '兔妖', 皮肤 = 9014, 外形 = 2001, 分类 = '物理', 价格 = 13000, 属性 = { { '法力', -1 }, { '力量', 1 }, { '速度', 2 }, { '忽视防御几率', 6 }, { '忽视防御程度', 3 } }, 等级 = 9, 亲和力 = 8, 种类 = '妖', 五行 = { 35, 65, 0, 0, 0 } },
        { name = '兔妖', 皮肤 = 9014, 外形 = 2001, 分类 = '抗性', 价格 = 13000, 属性 = { { '法力', -1 }, { '力量', 1 }, { '速度', 2 }, { '抗雷', 3 } }, 等级 = 9, 亲和力 = 8, 种类 = '妖', 五行 = { 35, 65, 0, 0, 0 } },
        { name = '兔妖', 皮肤 = 9014, 外形 = 2001, 分类 = '抗性', 价格 = 13000, 属性 = { { '力量', 1 }, { '速度', 2 }, { '物理吸收', 2 }, { '抗混乱', 1 } }, 等级 = 9, 亲和力 = 8, 种类 = '妖', 五行 = { 35, 65, 0, 0, 0 } },
    },
    迦楼罗王卡 = {
        { name = '迦楼罗王', 皮肤 = 9118, 外形 = 2170, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 2 }, { '法力', 2 }, { '力量', 15 }, { '速度', 4 }, { '物理吸收', 3 }, { '抗水', 6 }, { '抗混乱', 3 }, { '抗昏睡', 4 }, { '抗封印', 3 } }, 等级 = 100, 亲和力 = 10, 种类 = '神', 五行 = { 40, 0, 60, 0, 0 } },
        { name = '迦楼罗王', 皮肤 = 9118, 外形 = 2170, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 2 }, { '法力', 2 }, { '力量', 15 }, { '速度', 4 }, { '加强昏睡', 7 }, { '加强毒', 9 } }, 等级 = 100, 亲和力 = 10, 种类 = '神', 五行 = { 40, 0, 60, 0, 0 } },
        { name = '迦楼罗王', 皮肤 = 9118, 外形 = 2170, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 2 }, { '法力', 2 }, { '力量', 15 }, { '速度', 4 }, { '连击次数', 4 }, { '连击率', 10 }, { '狂暴几率', 12 }, { '致命几率', 10 } }, 等级 = 100, 亲和力 = 10, 种类 = '神', 五行 = { 40, 0, 60, 0, 0 } },
    },
    赤焰妖卡 = {
        { name = '赤焰妖', 皮肤 = 9108, 外形 = 2103, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 4 }, { '法力', 1 }, { '力量', 4 }, { '速度', 2 }, { '加强火', 5 }, { '加强水', 5 }, { '加强水', 5 } }, 等级 = 89, 亲和力 = 10, 种类 = '妖', 五行 = { 20, 20, 20, 20, 20 } },
        { name = '赤焰妖', 皮肤 = 9108, 外形 = 2103, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 4 }, { '法力', 1 }, { '力量', 4 }, { '速度', 2 }, { '忽视防御几率', 10 }, { '忽视防御程度', 5 }, { '致命几率', 5 } }, 等级 = 89, 亲和力 = 10, 种类 = '妖', 五行 = { 20, 20, 20, 20, 20 } },
        { name = '赤焰妖', 皮肤 = 9108, 外形 = 2103, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 4 }, { '法力', 1 }, { '力量', 4 }, { '速度', 2 }, { '抗昏睡', 4 }, { '抗中毒', 4 }, { '抗水', -6 }, { '抗封印', 4 }, { '抗混乱', 4 } }, 等级 = 89, 亲和力 = 10, 种类 = '妖', 五行 = { 20, 20, 20, 20, 20 } },
    },
    水灵仙卡 = {
        { name = '水灵仙', 皮肤 = 9105, 外形 = 2100, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 2 }, { '法力', 10 }, { '速度', -2 }, { '加强毒', 10 } }, 等级 = 86, 亲和力 = 9, 种类 = '神', 五行 = { 0, 0, 100, 0, 0 } },
        { name = '水灵仙', 皮肤 = 9105, 外形 = 2100, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 2 }, { '法力', 10 }, { '速度', -2 }, { '连击次数', 4 }, { '连击率', 10 }, { '致命几率', 3 } }, 等级 = 86, 亲和力 = 9, 种类 = '神', 五行 = { 0, 0, 100, 0, 0 } },
        { name = '水灵仙', 皮肤 = 9105, 外形 = 2100, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 2 }, { '法力', 10 }, { '速度', -2 }, { '抗火', -4 }, { '抗震慑', 2 }, { '抗水', 6 }, { '抗昏睡', 6 } }, 等级 = 86, 亲和力 = 9, 种类 = '神', 五行 = { 0, 0, 100, 0, 0 } },
    },
    火神女娲卡 = {
        { name = '火神女娲', 皮肤 = 9092, 外形 = 2291, 分类 = '强法', 价格 = 130000, 属性 = { { '法力', 5 }, { '力量', 6 }, { '速度', -2 }, { '加强火', 8 } }, 等级 = 72, 亲和力 = 15, 种类 = '神', 五行 = { 0, 15, 0, 85, 0 } },
        { name = '火神女娲', 皮肤 = 9092, 外形 = 2291, 分类 = '物理', 价格 = 130000, 属性 = { { '法力', 5 }, { '力量', 6 }, { '速度', -2 }, { '致命几率', 8 } }, 等级 = 72, 亲和力 = 15, 种类 = '神', 五行 = { 0, 15, 0, 85, 0 } },
        { name = '火神女娲', 皮肤 = 9092, 外形 = 2291, 分类 = '抗性', 价格 = 130000, 属性 = { { '法力', 5 }, { '力量', 6 }, { '速度', -2 }, { '抗火', 8 }, { '抗水', -2 }, { '物理吸收', 2 } }, 等级 = 72, 亲和力 = 15, 种类 = '神', 五行 = { 0, 15, 0, 85, 0 } },
    },
    剑精灵卡 = {
        { name = '剑精灵', 皮肤 = 9115, 外形 = 2109, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', -1 }, { '法力', 3 }, { '力量', 11 }, { '速度', 7 }, { '抗水', -3 }, { '抗混乱', 3 }, { '抗昏睡', 3 }, { '抗封印', 4 } }, 等级 = 100, 亲和力 = 17, 种类 = '鬼', 五行 = { 75, 0, 25, 0, 0 } },
        { name = '剑精灵', 皮肤 = 9115, 外形 = 2109, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', -1 }, { '法力', 3 }, { '力量', 11 }, { '速度', 7 }, { '抗水', -3 }, { '加强混乱', 8 } }, 等级 = 100, 亲和力 = 17, 种类 = '鬼', 五行 = { 75, 0, 25, 0, 0 } },
        { name = '剑精灵', 皮肤 = 9115, 外形 = 2109, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', -1 }, { '法力', 3 }, { '力量', 11 }, { '速度', 7 }, { '连击率', 5 }, { '狂暴几率', 9 }, { '忽视防御程度', 7 }, { '忽视防御几率', 7 } }, 等级 = 100, 亲和力 = 17, 种类 = '鬼', 五行 = { 75, 0, 25, 0, 0 } },
    },
    毒蛇卡 = {
        { name = '毒蛇', 皮肤 = 9007, 外形 = 2031, 分类 = '强法', 价格 = 1300, 属性 = { { '法力', -1 }, { '力量', 2 }, { '力量', 1 }, { '加强毒', 2 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 65, 35, 0, 0 } },
        { name = '毒蛇', 皮肤 = 9007, 外形 = 2031, 分类 = '强法', 价格 = 1300, 属性 = { { '气血', 1 }, { '法力', -1 }, { '力量', 1 }, { '速度', 1 }, { '加强毒', 1 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 65, 35, 0, 0 } },
        { name = '毒蛇', 皮肤 = 9007, 外形 = 2031, 分类 = '物理', 价格 = 1300, 属性 = { { '法力', -1 }, { '力量', 2 }, { '速度', 1 }, { '反击率', 2 }, { '反击次数', 2 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 65, 35, 0, 0 } },
        { name = '毒蛇', 皮肤 = 9008, 外形 = 2031, 分类 = '物理', 价格 = 1300, 属性 = { { '气血', 1 }, { '法力', -1 }, { '力量', 1 }, { '速度', 1 }, { '忽视防御几率', 2 }, { '忽视防御程度', -1 }, { '致命几率', 1 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 65, 35, 0, 0 } },
        { name = '毒蛇', 皮肤 = 9008, 外形 = 2031, 分类 = '抗性', 价格 = 1300, 属性 = { { '法力', -1 }, { '力量', 2 }, { '速度', 1 }, { '抗震慑', 2 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 65, 35, 0, 0 } },
        { name = '毒蛇', 皮肤 = 9008, 外形 = 2031, 分类 = '抗性', 价格 = 1300, 属性 = { { '气血', 1 }, { '法力', -1 }, { '力量', 1 }, { '速度', 1 }, { '抗中毒', 2 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 65, 35, 0, 0 } },
    },
    花妖卡 = {
        { name = '花妖', 皮肤 = 9033, 外形 = 2012, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 4 }, { '速度', -2 }, { '加强风', 4 } }, 等级 = 21, 亲和力 = 13, 种类 = '妖', 五行 = { 0, 25, 75, 0, 0 } },
        { name = '花妖', 皮肤 = 9033, 外形 = 2012, 分类 = '强法', 价格 = 13000, 属性 = { { '气血', 4 }, { '法力', -1 }, { '力量', 3 }, { '速度', -2 }, { '加强水', 4 } }, 等级 = 21, 亲和力 = 13, 种类 = '妖', 五行 = { 0, 25, 75, 0, 0 } },
        { name = '花妖', 皮肤 = 9033, 外形 = 2012, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 4 }, { '速度', -2 }, { '反击率', 5 }, { '反击次数', 3 } }, 等级 = 21, 亲和力 = 13, 种类 = '妖', 五行 = { 0, 25, 75, 0, 0 } },
        { name = '花妖', 皮肤 = 9034, 外形 = 2012, 分类 = '物理', 价格 = 13000, 属性 = { { '气血', 4 }, { '法力', -1 }, { '力量', 3 }, { '速度', -2 }, { '反击率', 6 }, { '反击次数', 2 } }, 等级 = 21, 亲和力 = 13, 种类 = '妖', 五行 = { 0, 25, 75, 0, 0 } },
        { name = '花妖', 皮肤 = 9034, 外形 = 2012, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 3 }, { '法力', -1 }, { '力量', 4 }, { '速度', -2 }, { '抗火', 2 }, { '抗水', 6 } }, 等级 = 21, 亲和力 = 13, 种类 = '妖', 五行 = { 0, 25, 75, 0, 0 } },
        { name = '花妖', 皮肤 = 9034, 外形 = 2012, 分类 = '抗性', 价格 = 13000, 属性 = { { '气血', 4 }, { '法力', -1 }, { '力量', 3 }, { '速度', -2 }, { '抗水', 3 }, { '抗中毒', -3 }, { '抗雷', -2 } }, 等级 = 21, 亲和力 = 13, 种类 = '妖', 五行 = { 0, 25, 75, 0, 0 } },
    },
    战神女娲卡 = {
        { name = '战神女娲', 皮肤 = 9048, 外形 = 2289, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 2 }, { '速度', 2 }, { '加强雷', 5 } }, 等级 = 30, 亲和力 = 14, 种类 = '神', 五行 = { 10, 90, 0, 0, 0 } },
        { name = '战神女娲', 皮肤 = 9048, 外形 = 2289, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 2 }, { '速度', 2 }, { '连击次数', 5 }, { '连击率', 5 } }, 等级 = 30, 亲和力 = 14, 种类 = '神', 五行 = { 10, 90, 0, 0, 0 } },
        { name = '战神女娲', 皮肤 = 9048, 外形 = 2289, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 2 }, { '法力', 2 }, { '速度', 2 }, { '抗火', -3 }, { '抗水', 5 }, { '抗雷', 3 } }, 等级 = 30, 亲和力 = 14, 种类 = '神', 五行 = { 10, 90, 0, 0, 0 } },
    },
    银狐卡 = {
        { name = '银狐', 皮肤 = 9053, 外形 = 2039, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 1 }, { '法力', -1 }, { '力量', 3 }, { '速度', 3 }, { '加强雷', 2 }, { '加强水', 3 } }, 等级 = 35, 亲和力 = 8, 种类 = '兽', 五行 = { 35, 0, 65, 0, 0 } },
        { name = '银狐', 皮肤 = 9053, 外形 = 2039, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 1 }, { '法力', -1 }, { '力量', 3 }, { '速度', 3 }, { '忽视防御几率', 4 }, { '躲闪率', 3 }, { '忽视防御程度', 2 } }, 等级 = 35, 亲和力 = 8, 种类 = '兽', 五行 = { 35, 0, 65, 0, 0 } },
        { name = '银狐', 皮肤 = 9053, 外形 = 2039, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 1 }, { '法力', -1 }, { '力量', 3 }, { '速度', 3 }, { '抗火', 2 }, { '抗水', 5 }, { '抗风', 2 } }, 等级 = 35, 亲和力 = 8, 种类 = '兽', 五行 = { 35, 0, 65, 0, 0 } },
    },
    无头鬼卡 = {
        { name = '无头鬼', 皮肤 = 9066, 外形 = 2056, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 4 }, { '力量', 4 }, { '速度', 1 }, { '加强昏睡', 4 }, { '加强毒', 2 } }, 等级 = 50, 亲和力 = 12, 种类 = '鬼', 五行 = { 0, 30, 0, 0, 70 } },
        { name = '无头鬼', 皮肤 = 9066, 外形 = 2056, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 4 }, { '力量', 4 }, { '速度', 1 }, { '忽视防御几率', 4 }, { '忽视防御程度', 4 }, { '狂暴几率', 2 } }, 等级 = 50, 亲和力 = 12, 种类 = '鬼', 五行 = { 0, 30, 0, 0, 70 } },
        { name = '无头鬼', 皮肤 = 9066, 外形 = 2056, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 4 }, { '力量', 4 }, { '速度', 1 }, { '抗震慑', 1 }, { '抗风', -1 }, { '物理吸收', 1 }, { '抗混乱', 5 } }, 等级 = 50, 亲和力 = 12, 种类 = '鬼', 五行 = { 0, 30, 0, 0, 70 } },
    },
    泥石怪卡 = {
        { name = '泥石怪', 皮肤 = 9106, 外形 = 2101, 分类 = '强法', 价格 = 195000, 属性 = { { '气血', 8 }, { '力量', 10 }, { '速度', -8 }, { '加强封印', 5 }, { '加强混乱', 5 } }, 等级 = 87, 亲和力 = 12, 种类 = '妖', 五行 = { 0, 0, 0, 0, 100 } },
        { name = '泥石怪', 皮肤 = 9106, 外形 = 2101, 分类 = '物理', 价格 = 195000, 属性 = { { '气血', 8 }, { '力量', 10 }, { '速度', -8 }, { '反震率', 10 }, { '反震程度', 10 } }, 等级 = 87, 亲和力 = 12, 种类 = '妖', 五行 = { 0, 0, 0, 0, 100 } },
        { name = '泥石怪', 皮肤 = 9106, 外形 = 2101, 分类 = '抗性', 价格 = 195000, 属性 = { { '气血', 8 }, { '力量', 10 }, { '速度', -8 }, { '物理吸收', 10 } }, 等级 = 87, 亲和力 = 12, 种类 = '妖', 五行 = { 0, 0, 0, 0, 100 } },
    },
    强盗卡 = {
        { name = '强盗', 皮肤 = 9055, 外形 = 2044, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', 1 }, { '力量', 4 }, { '速度', 1 }, { '加强昏睡', 2 }, { '加强封印', 3 } }, 等级 = 34, 亲和力 = 15, 种类 = '人', 五行 = { 45, 0, 0, 0, 55 } },
        { name = '强盗', 皮肤 = 9055, 外形 = 2044, 分类 = '物理', 价格 = 65000, 属性 = { { '气血', 1 }, { '力量', 4 }, { '速度', 1 }, { '躲闪率', 3 }, { '狂暴几率', 2 } }, 等级 = 34, 亲和力 = 15, 种类 = '人', 五行 = { 45, 0, 0, 0, 55 } },
        { name = '强盗', 皮肤 = 9055, 外形 = 2044, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', 1 }, { '力量', 4 }, { '速度', 1 }, { '抗火', 1 }, { '抗水', 1 }, { '抗风', 2 }, { '物理吸收', 2 } }, 等级 = 34, 亲和力 = 15, 种类 = '人', 五行 = { 45, 0, 0, 0, 55 } },
    },
    五叶卡 = {
        { name = '五叶', 皮肤 = 9265, 外形 = 2111, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', 10 }, { '法力', -2 }, { '速度', 8 }, { '物理吸收', 5 }, { '抗混乱', 4 }, { '抗昏睡', 2 }, { '抗封印', 5 }, { '抗中毒', 3 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 50, 10, 20, 10 } },
        { name = '五叶', 皮肤 = 9265, 外形 = 2111, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 10 }, { '法力', -2 }, { '速度', 8 }, { '加强风', 18 }, { '加强水', 12 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 50, 10, 20, 10 } },
        { name = '五叶', 皮肤 = 9265, 外形 = 2111, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 10 }, { '法力', -2 }, { '速度', 8 }, { '反震程度', 5 }, { '反震几率', 20 }, { '躲闪率', 3 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 50, 10, 20, 10 } },      
    },
    垂云叟卡 = {
        { name = '垂云叟', 皮肤 = 9266, 外形 = 2112, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', 10 }, { '法力', 12 }, { '抗火', -6 }, { '抗水', 8 }, { '抗雷', 4 }, { '抗风', 7 }, { '抗混乱', 3 }, { '抗昏睡', 4 }, { '抗震慑', 3 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 10, 10, 20, 50, 10 } },
        { name = '垂云叟', 皮肤 = 9266, 外形 = 2112, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 10 }, { '法力', 12 }, { '加强封印', 8 }, { '加强毒伤害', 12 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 10, 10, 20, 50, 10 } },
        { name = '垂云叟', 皮肤 = 9266, 外形 = 2112, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 10 }, { '法力', 12 }, { '反震程度', 18 }, { '反震率', 7 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 10, 10, 20, 50, 10 } },      
    },
    颜如玉卡 = {
        { name = '颜如玉', 皮肤 = 9267, 外形 = 2113, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', -2 }, { '法力', 12 }, { '速度', 8 }, { '抗火', -3 }, { '抗水', -6 }, { '抗雷', -4 }, { '抗风', -2 }, { '抗混乱', 4 }, { '抗昏睡', 5 }, { '抗封印', 4 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 20, 10, 10, 10, 50 } },
        { name = '颜如玉', 皮肤 = 9267, 外形 = 2113, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', -2 }, { '法力', 12 }, { '速度', 8 }, { '加强火', 18 }, { '加强水', 12 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 20, 10, 10, 10, 50 } },
        { name = '颜如玉', 皮肤 = 9267, 外形 = 2113, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', -2 }, { '法力', 12 }, { '速度', 8 }, { '连击次数', 5 }, { '连击率', 16 }, { '躲闪率', 20 }, { '致命几率', 8 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 20, 10, 10, 10, 50 } },      
    },
    浪淘沙卡 = {
        { name = '浪淘沙', 皮肤 = 9268, 外形 = 2114, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', 15 }, { '力量', 15 }, { '物理吸收', 5 }, { '抗风', 5 }, { '抗混乱', 6 }, { '抗昏睡', 3 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 50, 10, 10, 10, 20 } },
        { name = '浪淘沙', 皮肤 = 9268, 外形 = 2114, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 15 }, { '力量', 15 }, { '加强混乱', 15 }, { '加昏睡', 9 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 50, 10, 10, 10, 20 } },
        { name = '浪淘沙', 皮肤 = 9268, 外形 = 2114, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 15 }, { '力量', 15 }, { '致命几率', 12 }, { '忽视防御程度', 10 }, { '忽视防御几率', 15 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 50, 10, 10, 10, 20 } },      
    },
    范式之魂卡 = {
        { name = '范式之魂', 皮肤 = 9269, 外形 = 2115, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', -2 }, { '法力', -2 }, { '力量', 15 }, { '速度', 9 }, { '抗混乱', 2 }, { '抗昏睡', 4 }, { '抗封印', 5 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 10, 20, 50, 10, 10 } },
        { name = '范式之魂', 皮肤 = 9269, 外形 = 2115, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', -2 }, { '法力', -2 }, { '力量', 15 }, { '速度', 9 }, { '加强风', 12 }, { '加强雷', 18 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 10, 20, 50, 10, 10 } },
        { name = '范式之魂', 皮肤 = 9269, 外形 = 2115, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', -2 }, { '法力', -2 }, { '力量', 15 }, { '速度', 9 }, { '连击次数', 5 }, { '连击率', 12 }, { '致命几率',12 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 10, 20, 50, 10, 10 } },      
    },
    年兽卡 = {
        { name = '年兽', 皮肤 = 9282, 外形 = 2209, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', 2 }, { '法力', -2 }, { '力量', 3 },{ '速度', 10 }, { '抗水', 4 }, { '抗混乱', 5 }, { '抗昏睡', 2 }, { '抗封印', 2 }, { '抗中毒', 4 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 20, 0, 0, 0, 80 } },
        { name = '年兽', 皮肤 = 9282, 外形 = 2209, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 2 }, { '法力', -2 }, { '力量', 3 },{ '速度', 10 }, { '加强封印', 12 }, { '加强昏睡', 10 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 20, 0, 0, 0, 80 } },
        { name = '年兽', 皮肤 = 9282, 外形 = 2209, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 2 }, { '法力', -2 }, { '力量', 3 },{ '速度', 10 }, { '连击次数', 3 }, { '连击率', 10 }, { '命中率', 15 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 20, 0, 0, 0, 80 } },      
    },
    画中仙卡 = {
        { name = '画中仙', 皮肤 = 9272, 外形 = 2455, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', 4 }, { '法力', -2 }, { '速度', 8 },  { '抗混乱', 3 }, { '抗昏睡', 3 }, { '抗封印', 5 }, { '抗中毒', 5 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 50, 0, 50, 0 } },
        { name = '画中仙', 皮肤 = 9272, 外形 = 2455, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 4 }, { '法力', -2 }, { '速度', 8 }, { '加强风', 12 }, { '加强水', 18 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 50, 0, 50, 0 } },
        { name = '画中仙', 皮肤 = 9272, 外形 = 2455, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 4 }, { '法力', -2 }, { '速度', 8 }, { '反震程度', 15 }, { '反震几率', 10 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 50, 0, 50, 0 } },      
    },
    精卫卡 = {
        { name = '精卫', 皮肤 = 9270, 外形 = 2169, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', -4 }, { '法力', 8 }, { '力量', -2 }, { '速度', 8 }, { '抗火', 6 }, { '抗水', 4 }, { '抗雷', 5 }, { '抗风', 4 }, { '抗遗忘', 3 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 25, 0, 0, 0, 75 } },
        { name = '精卫', 皮肤 = 9270, 外形 = 2169, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 10 }, { '法力', -2 }, { '速度', 8 }, { '加强封印', 7 }, { '加强昏睡', 10 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 25, 0, 0, 0, 75 } },
        { name = '精卫', 皮肤 = 9270, 外形 = 2169, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 10 }, { '法力', -2 }, { '速度', 8 }, { '反震程度', 15 }, { '反震几率', 5 }, { '躲闪率', 12 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 25, 0, 0, 0, 75 } },      
    },
    迦楼罗王卡 = {
        { name = '迦楼罗王', 皮肤 = 9218, 外形 = 2170, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', 2 }, { '法力', 2 }, { '力量', 15 }, { '速度', 4 }, { '物理吸收', 8 }, { '抗混乱', 5 }, { '抗昏睡', 5 }, { '抗封印', 5 }, { '抗中毒', 5 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 40, 0, 0, 60, 0 } },
        { name = '迦楼罗王', 皮肤 = 9218, 外形 = 2170, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 2 }, { '法力', 2 }, { '力量', 15 }, { '速度', 4  }, { '加强昏睡', 7 }, { '加强毒伤害', 9 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 40, 0, 0, 60, 0 } },
        { name = '迦楼罗王', 皮肤 = 9218, 外形 = 2170, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 2 }, { '法力', 2 }, { '力量', 15 }, { '速度', 4  }, { '连击次数', 4 }, { '连击率', 12 }, { '狂暴几率', 15 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 40, 0, 0, 60, 0 } },      
    },
    冥灵妃子卡 = {
        { name = '冥灵妃子', 皮肤 = 9219, 外形 = 2171, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', 5 }, { '法力', 6 }, { '速度', 5 }, { '抗雷', 5 }, { '抗风', 5 }, { '抗混乱', 6 }, { '抗昏睡', 6 }, { '抗封印', 6 }, { '抗震慑', 5 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 75, 0, 0, 25, 0 } },
        { name = '冥灵妃子', 皮肤 = 9219, 外形 = 2171, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 5 }, { '法力', 6 }, { '速度', 5 }, { '加强火', 15 }, { '加强雷', 15 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 75, 0, 0, 25, 0 } },
        { name = '冥灵妃子', 皮肤 = 9219, 外形 = 2171, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 5 }, { '法力', 6 }, { '速度', 5 }, { '反震程度', 15 }, { '反震几率', 20 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 75, 0, 0, 25, 0 } },      
    },
    龙马卡 = {
        { name = '龙马', 皮肤 = 9284, 外形 = 2453, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', 13 }, { '法力', 3 }, { '力量', 18 }, { '抗雷', 6 }, { '抗风', 6 }, { '抗混乱', 5 }, { '抗昏睡', 5 }, { '抗封印', 5 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 0, 50, 50, 0 } },
        { name = '龙马', 皮肤 = 9284, 外形 = 2453, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 13 }, { '法力', 3 }, { '力量', 18 }, { '加强混乱', 10 }, { '加强昏睡', 10 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 0, 50, 50, 0 } },
        { name = '龙马', 皮肤 = 9284, 外形 = 2453, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 13 }, { '法力', 3 }, { '力量', 18 }, { '连击率', 15 }, { '致命几率', 15 }, { '忽视防御程度', 20 }, { '忽视防御几率', 10 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 0, 50, 50, 0 } },      
    },
    画皮娘子卡 = {
        { name = '画皮娘子', 皮肤 = 9299, 外形 = 3836, 分类 = '抗性', 价格 = 2000000, 属性 = { { '力量', 14 }, { '速度', 6 }, { '抗火', 5 }, { '抗水', 4 }, { '抗雷', 3 }, { '抗混乱', 5 }, { '抗昏睡', 4 }, { '抗封印', 3 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 50, 0, 0, 0, 50 } },
        { name = '画皮娘子', 皮肤 = 9299, 外形 = 3836, 分类 = '强法', 价格 = 2000000, 属性 = { { '力量', 14 }, { '速度', 6 }, { '加强封印', 8 }, { '加强昏睡', 11 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 50, 0, 0, 0, 50 } },
        { name = '画皮娘子', 皮肤 = 9299, 外形 = 3836, 分类 = '物理', 价格 = 2000000, 属性 = { { '力量', 14 }, { '速度', 6 }, { '连击率', 15 }, { '连击次数', 3 }, { '致命几率', 10 }, { '忽视防御几率', 10 }, { '忽视防御程度', 10 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 50, 0, 0, 0, 50 } },      
    },
    金不换卡 = {
        { name = '金不换', 皮肤 = 9298, 外形 = 3847, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', 2 }, { '法力', 11 }, { '速度', 9 }, { '抗火', 8 }, { '抗雷', 8 }, { '抗混乱', 5 }, { '抗昏睡', 4 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 80, 0, 0, 0, 20 } },
        { name = '金不换', 皮肤 = 9298, 外形 = 3847, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 2 }, { '法力', 11 }, { '速度', 9 }, { '加强风', 18 }, { '加强水', 10 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 80, 0, 0, 0, 20 } },
        { name = '金不换', 皮肤 = 9298, 外形 = 3847, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 2 }, { '法力', 11 }, { '速度', 9 }, { '连击率', 15 }, { '连击次数', 6 }, { '致命几率', 12 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 80, 0, 0, 0, 20 } },      
    },
    赭炎卡 = {
        { name = '赭炎', 皮肤 = 9308, 外形 = 2377, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', -2 }, { '力量', 14 }, { '速度', 2 }, { '抗火', 5 }, { '抗风', 5 }, { '抗雷', 5 }, { '抗混乱', 4 }, { '抗封印', 4 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 0, 0, 0, 100 } },
        { name = '赭炎', 皮肤 = 9308, 外形 = 2377, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', -2 }, { '力量', 14 }, { '速度', 2 }, { '加强火', 10 }, { '加强雷', 10 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 0, 0, 0, 100 } },
        { name = '赭炎', 皮肤 = 9308, 外形 = 2377, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', -2 }, { '力量', 14 }, { '速度', 2 }, { '忽视防御程度', 15 }, { '忽视防御几率', 10 }, { '躲闪率', 10 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 0, 0, 0, 100 } },      
    },
    当康卡 = {
        { name = '当康', 皮肤 = 9301, 外形 = 3077, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', 14 }, { '速度', 2 }, { '物理吸收', 10 }, { '抗混乱', 6 }, { '抗昏睡', 6 }, { '抗封印', 6 }, { '抗震慑', 5 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 15, 0, 85, 0, 0 } },
        { name = '当康', 皮肤 = 9301, 外形 = 3077, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 14 }, { '速度', 2 }, { '加强水', 7 }, { '加强雷', 8 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 15, 0, 85, 0, 0 } },
        { name = '当康', 皮肤 = 9301, 外形 = 3077, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 14 }, { '速度', 2 }, { '反震程度', 26 }, { '反震几率', 23 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 15, 0, 85, 0, 0 } },      
    },
    吉祥果卡 = {
        { name = '吉祥果', 皮肤 = 9279, 外形 = 2129, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', 9 }, { '法力', -1 }, { '速度', 7 }, { '抗水', 8 }, { '抗风', 8 }, { '抗混乱', 5 }, { '抗昏睡', 5 }, { '抗封印', 5 }, { '抗中毒', 5 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 40, 0, 60, 0, 0 } },
        { name = '吉祥果', 皮肤 = 9279, 外形 = 2129, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 9 }, { '法力', -1 }, { '速度', 7 }, { '加强火', 16 }, { '加强雷', 16 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 40, 0, 60, 0, 0 } },
        { name = '吉祥果', 皮肤 = 9279, 外形 = 2129, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 9 }, { '法力', -1 }, { '速度', 7 }, { '连击率', 10 }, { '连击次数', 2 }, { '躲闪率', 15 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 40, 0, 60, 0, 0 } },      
    },
    松鼠卡 = {
        { name = '松鼠', 皮肤 = 9306, 外形 = 3481, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', 5 }, { '力量', 9 }, { '速度', 4 }, { '物理吸收', 5 }, { '抗混乱', 4 }, { '抗昏睡', 4 }, { '抗封印', 4 }, { '抗中毒', 4 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 50, 50, 0, 0 } },
        { name = '松鼠', 皮肤 = 9306, 外形 = 3481, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 5 }, { '力量', 9 }, { '速度', 4 }, { '加强风', 9 }, { '加强水', 7 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 50, 50, 0, 0 } },
        { name = '松鼠', 皮肤 = 9306, 外形 = 3481, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 5 }, { '力量', 9 }, { '速度', 4 }, { '致命几率', 5 }, { '忽视防御程度', 9 }, { '忽视防御几率', 9 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 50, 50, 0, 0 } },      
    },
    妖蝎卡 = {
        { name = '妖蝎', 皮肤 = 9310, 外形 = 2031, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', -3 }, { '力量', 9 }, { '速度', 5 }, { '物理吸收', 5 }, { '抗混乱', 4 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 0, 100, 0, 0 } },
        { name = '妖蝎', 皮肤 = 9310, 外形 = 2031, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', -3 }, { '力量', 9 }, { '速度', 5 }, { '加强毒', 8 }, { '加强火', 5 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 0, 100, 0, 0 } },
        { name = '妖蝎', 皮肤 = 9310, 外形 = 2031, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', -3 }, { '力量', 9 }, { '速度', 5 }, { '连击率', 5 }, { '忽视防御几率', 5 }, { '忽视防御程度', 9 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 0, 100, 0, 0 } },      
    },
    孔雀明王卡 = {
        { name = '孔雀明王', 皮肤 = 9322, 外形 = 3887, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', 4 }, { '力量', 13 }, { '速度', 6 }, { '抗混乱', 5 }, { '抗昏睡', 4 }, { '抗封印', 4 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 50, 10, 20, 10 } },
        { name = '孔雀明王', 皮肤 = 9322, 外形 = 3887, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 4 }, { '力量', 13 }, { '速度', 6 }, { '加强雷', 9 }, { '加强水', 9 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 50, 10, 20, 10 } },
        { name = '孔雀明王', 皮肤 = 9322, 外形 = 3887, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 4 }, { '力量', 13 }, { '速度', 6 }, { '连击率', 7 }, { '致命几率', 10 }, { '忽视防御几率', 6 }, { '忽视防御程度', 10 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 50, 10, 20, 10 } },      
    },
    剑精灵卡 = {
        { name = '剑精灵', 皮肤 = 9323, 外形 = 2109, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 11 }, { '速度', 7 }, { '物理吸收', 5 }, { '抗混乱', 3 }, { '抗昏睡', 3 }, { '抗封印', 4 }, { '抗中毒', 4 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 75, 0, 0, 25, 10 } },
        { name = '剑精灵', 皮肤 = 9323, 外形 = 2109, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 11 }, { '速度', 7 }, { '加强混乱', 12 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 75, 0, 0, 25, 10 } },
        { name = '剑精灵', 皮肤 = 9323, 外形 = 2109, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 3 }, { '法力', 3 }, { '力量', 11 }, { '速度', 7 }, { '连击率', 15 }, { '忽视防御程度', 10 }, { '忽视防御几率', 10 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 75, 0, 0, 25, 10 } },      
    },
    狮蝎卡 = {
        { name = '狮蝎', 皮肤 = 9324, 外形 = 2106, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', 1 }, { '法力', 7 }, { '力量', 2 }, { '速度', 3 }, { '物理吸收', 5 }, { '抗火', 8 }, { '抗雷', 8 }, { '抗混乱', 5 }, { '抗震慑', 3 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 25, 0, 0, 0, 75 } },
        { name = '狮蝎', 皮肤 = 9324, 外形 = 2106, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 1 }, { '法力', 7 }, { '力量', 2 }, { '速度', 3 }, { '加强毒伤害', 12 }, { '加强火', 10 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 25, 0, 0, 0, 75 } },
        { name = '狮蝎', 皮肤 = 9324, 外形 = 2106, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 1 }, { '法力', 7 }, { '力量', 2 }, { '速度', 3 }, { '反震程度', 12 }, { '反震几率', 8 }, { '躲闪率', 10 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 25, 0, 0, 0, 75 } },      
    },
    哥俩好卡 = {
        { name = '哥俩好', 皮肤 = 9326, 外形 = 2110, 分类 = '抗性', 价格 = 2000000, 属性 = { { '气血', 12 }, { '力量', 13 }, { '速度', 1 }, { '物理吸收', 5 }, { '抗震慑', 5 }, { '抗混乱', 4 }, { '抗昏睡', 4 }, { '抗封印', 4 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 25, 75, 0, 0 } },
        { name = '哥俩好', 皮肤 = 9326, 外形 = 2110, 分类 = '强法', 价格 = 2000000, 属性 = { { '气血', 12 }, { '力量', 13 }, { '速度', 1 }, { '加强封印', 9 }, { '加强昏睡', 9 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 25, 75, 0, 0 } },
        { name = '哥俩好', 皮肤 = 9326, 外形 = 2110, 分类 = '物理', 价格 = 2000000, 属性 = { { '气血', 12 }, { '力量', 13 }, { '速度', 1 }, { '致命几率', 15 }, { '忽视防御几率', 10 }, { '忽视防御程度', 20 } }, 等级 = 3, 亲和力 = 7, 种类 = '兽', 五行 = { 0, 25, 75, 0, 0 } },      
    },
}

local function getdesc(v)
    local s = string.format("等级:%s,亲和力:%s,种类:%s,", v.等级, v.亲和力, v.种类)
    local list = {}
    for index, value in ipairs(v.属性) do
        table.insert(list, string.format('%s:%s%%', value[1], value[2]))
    end
    for index, value in ipairs { "金", "木", "水", "火", "土" } do
        table.insert(list, string.format('%s:%s', value, v.五行[index]))
    end
    s = s .. table.concat(list, ',')
    return s
end



for key, value in pairs(t) do
    for i, v in ipairs(value) do
        t[key][i].介绍 = getdesc(v)
    end
end

return t
