return {
    sun = 0,
    广播 = '#R%s#c44afbf在天女散花中获得了#G#m(%s)[%s]#m#n#c00FFFF#23',
    物品配置 = {

        {道具 = '帮派成就册', 参数 = 1000 ,属性 = "#Y获得1000点成就",几率 = 10,  数量 = 1, 是否广播 = 1},
        {道具 = '人参果王',几率 = 100, 数量 = 1, 是否广播 = 1},
        {道具 = '清盈果',几率 = 1,  数量 = 1, 是否广播 = 1},
        {道具 = '神兵礼盒',几率 = 3,  数量 = 1, 是否广播 = 1},
        {道具 = '亲密丹',几率 = 10, 数量 = 1, 是否广播 = 1},
        {道具 = '变色丹',几率 = 10,  数量 = 1, 是否广播 = 1},
        {道具 = '元气丹',几率 = 10, 数量 = 1, 是否广播 = 1},
        {道具 = '亲密丹',几率 = 5,  数量 = 1, 是否广播 = 1},
        {道具 = '龙之骨',几率 = 5, 数量 = 1, 是否广播 = 1},
        {道具 = '见闻录',几率 = 10,  数量 = 1, 是否广播 = 1},
        {道具 = '盘古精铁',几率 = 10, 数量 = 1, 是否广播 = 1},
        {道具 = '天外飞石',几率 = 10,  数量 = 1, 是否广播 = 1},
        {道具 = '补天神石',几率 = 10, 数量 = 1, 是否广播 = 1},
        {道具 = '神兽碎片',几率 = 10,  数量 = 1, 是否广播 = 1, 限制数量=100},
        {道具 = '积分卡', 参数 = 10 , 属性 = "#Y1000点积分", 几率 = 10,  数量 = 1, 是否广播 = 1 ,限制数量 = 1},
        {道具 = '封印卡', 参数 = "龙马" , 属性 = "#Y龙马宝宝一只", 几率 = 10,  数量 = 1, 是否广播 = 1,限制数量 = 1},
        {道具 = '随机天书', 几率 = 10, 数量 =1, 是否广播 = 1},
        {道具 = '百分比药品', 几率 = 200, 数量 =1, 是否广播 = 1},
        {道具 = '炼化材料', 几率 = 500, 数量 =1, 是否广播 = 1},

        --几率算法是   然后单个奖励的几率 / 所有奖励的几率 加起来  的百分比就是 这个奖励的概率， 有限制数量的 当发放完后 这个奖励就不算在内了


    }
}
