local 确认购买窗口 = 窗口层:创建我的窗口('确认购买窗口', 0, 0, 396, 502)
function 确认购买窗口:初始化()
    self:置精灵(
        self:取老红木窗口(
            self.宽度,
            self.高度,
            '确认购买',
            function()
                self:取拉伸图像_宽高('gires/main/message_box2.png', 340, 165):显示(27, 47)
                self:取拉伸图像_宽高('gires/main/message_box2.png', 340, 94):显示(27, 217)

                --280-422
                __res.JMZ:取图像('购买数量'):显示(86, 328)
                __res.JMZ:取图像('消耗积分'):显示(86, 359)
                __res.JMZ:取图像('拥有积分'):显示(86, 390)
                __res.F14:置颜色(157, 157, 157)
                __res.F14:取图像('暂无可用优惠'):显示(149, 244)
                __res.F14:置颜色(255, 255, 255)

                self:取拉伸图像_宽高('gires/main/border.bmp', 144, 22):显示(162,
                    326):显示(162, 357):显示(162, 389)
                self:取拉伸图像_宽度('gires4/jdmh/yjan/jmfk3.tcp', 296):显示(47, 280)
                    :显示(47, 422)
            end
        )
    )
end

function 确认购买窗口:显示(x, y)
    if self.图标 then
        self.图标:显示(x + 130, y + 80)
    end
end

确认购买窗口:创建关闭按钮()

local 文本 = 确认购买窗口:创建文本("介绍文本", 27, 60, 333, 18)
文本:置文字(__res.F18)
文本:置文本("你确定购买#G物品名称#W吗？")

文本 = 确认购买窗口:创建文本("单价文本", 27, 288, 333, 18)
文本:置文字(__res.F18)
文本:置文本("单价(原价)#G6000仙玉")

确认购买窗口:创建文本("消耗文本", 165, 360, 135, 14)
确认购买窗口:创建文本("仙玉文本", 165, 392, 135, 14)
-- 文本:置文字(__res.F14)
local 数量输入 = 确认购买窗口:创建数字输入('数量输入', 165, 329, 135, 15)
数量输入.最大值 = 99
数量输入:置颜色(255, 255, 255, 255)
function 数量输入:输入数值(n)
    _购买数量 = n
    确认购买窗口.消耗文本:置文本(tostring(_价格 * _购买数量))
end

function 确认购买窗口:刷新商品(r, xy)
    if type(r) == "table" then
        _价格 = r.价格
        self.介绍文本:置文本(string.format("你确定购买#G%s#W吗？", r.名称))
        self.单价文本:置文本(string.format("单价(原价)#G%s积分", _价格))
        self.消耗文本:置文本(tostring(_价格 * _购买数量))
        self.数量输入:置文本(1)
        self.图标 = r.图标120
    end

    self.仙玉文本:置文本(银两颜色(xy))
end

local an = 确认购买窗口:创建中按钮('购买按钮', 155, 437, '确认购买', 100)
function an:左键弹起()
   -- 确认购买窗口:置可见(false)
    local r = __rpc:角色_商城购买(_p, _i, _购买数量)
    if type(r) == 'string' then
        窗口层:提示窗口(r)
    end
end
function 窗口层:刷新仙玉2()
    local n = __rpc:角色_取仙玉()
    确认购买窗口.仙玉文本:置文本(银两颜色(n))
end


function 窗口层:打开确认购买窗口(t, xy, p, i)
    确认购买窗口:置可见(true)
    _p, _i = p, i
    确认购买窗口:置坐标((引擎.宽度 - 确认购买窗口.宽度) // 2, (引擎.高度 - 确认购买窗口.高度
        ) // 2)

    _价格 = 0
    _购买数量 = 1
    确认购买窗口:刷新商品(t, xy)
end

return 确认购买窗口
