local NPC = {}
local 对话 = [[
宝象国近来颇不平静。公主失踪一十三年，忽传音讯;东土高僧礼乐雍容持文牒而来，驸马爷从天而降，丰神俊雅;银安殿宫娥失头，又风声鹤唳。多事之秋，用人之时。义士高节，还望担起重任，为国为家，尽献己力。
menu
1|除魔卫国，义不容辞

99|事态严重，我等退敞]]
--2|自动降魔(每次消耗组队任我行*1)
--- 在哪自动的  鬼王 
function NPC:NPC对话(玩家, i)
    return 对话
end

function NPC:NPC菜单(玩家, i)
    if i == '1' then
        return self:领取降魔任务(玩家)
    end
end

local _任务对话 = {
    [1] = "三藏一行前往宝象，途径黑松林，却见南方一座宝塔，金光闪烁，彩气腾腾。三藏破门而入，却是误闯了黄袍怪老巢，正是“蛇头上苍蝇，自来的衣食”。走起~我宝象义士速去营救！",
    [2] = "宝象国真个好去处，看不尽那国中景致！唐僧师徒三众特去面驾，倒换文牒。八戒于殿前表演了大神通之法，更扬言往平顶山捉妖去也！我宝象国义士，还不前往助一臂之力？！",
    [3] = "失踪一十三年的公主？化作斑斓猛虎的高僧？凭空而降的驸马爷？银安殿宫娥失头案？……宝象国迷情重重，委实蹊跷，还望义士前往探听究竟。",
    [4] = "听说那孙大圣三打白骨精后遭师父驱逐，索性按落云头重回了傲来国，正是“重修花果山，复整水帘洞”。眼下三藏一行危机重重，他却哪里管得？义士速去告知大圣爷详情，邀其前来宝象，除妖伏魔！",
    [5] = "那黄袍怪神通广大，万不可轻敌。且听从大圣妙计，环环紧扣，各个击破，方能挫敌。",
    [6] = "那黄袍怪穷途现形，原是天庭奎木狼，与披香殿侍香玉女思凡下界，方有此间种种。决战在睫，义士们，请速去打败奎木狼！",
}

function NPC:领取降魔任务(玩家)
    if not 玩家.是否组队 then
        玩家:常规提示('#Y需要3个人以上的组队来帮我！')
        return
    end
    if 玩家:取队伍人数() < 1 then
        玩家:常规提示('#Y需要3个人以上的组队来帮我！')
        return
    end

    local t = {}
    -- for _, v in 玩家:遍历队伍() do
    --     if v:判断等级是否低于(143, 3) then
    --         table.insert(t, v.名称)
    --     end
    -- end
    -- if #t > 0 then
    --     玩家:常规提示('#Y' .. table.concat(t, '、 ') .. '#W低于3转143级,无法领取')
    --     return
    -- end

    for _, v in 玩家:遍历队伍() do
        if v:取任务('日常_降魔任务') then
            table.insert(t, v.名称)
        end
    end
    if #t > 0 then
        玩家:常规提示('#Y' .. table.concat(t, '、 ') .. '已有此任务,无法重复领取')
        return
    end

    local 分类 = math.random(6)

    local r = 生成任务 { 名称 = '日常_降魔任务', 分类 = 分类, 进度 = 1 }

    if r and r:生成怪物(玩家) then
        local ff = _任务对话[分类]
        for _, v in 玩家:遍历队伍() do
            v:最后对话(ff, self.外形)
        end
    end
end

return NPC
