local NPC = {}
local 对话 = [[
我是寻找那批失落镖银的官员。如果大侠能找到哪批镖银，下官感激不尽。
menu
1|兑换全部镖银
2|我要给与你镖银
3|帮我变成强盗的样子吧（20000两）
4|我什么都不想做
]]

function NPC:NPC对话(玩家, i)
    return 对话
end

local _强盗卡 = {
    { 属性类型 = 1, 等级 = 34, 外形 = 2044, 亲和力 = 15, 种类 = '人', 五行 = { 45, 0, 0, 0, 55 },
        皮肤 = 9055, 属性 = { { '气血', 1 }, { '力量', 4 }, { '速度', 1 }, { '加强昏睡', 2 }, { '加强封印',
            3 } } },
    { 属性类型 = 1, 等级 = 34, 外形 = 2044, 亲和力 = 15, 种类 = '人', 五行 = { 45, 0, 0, 0, 55 },
        皮肤 = 9055, 属性 = { { '气血', 1 }, { '力量', 4 }, { '速度', 1 }, { '躲闪率', 3 }, { '狂暴几率',
            2 } } },

    { 属性类型 = 1, 等级 = 34, 外形 = 2044, 亲和力 = 15, 种类 = '人', 五行 = { 45, 0, 0, 0, 55 },
        皮肤 = 9055, { { '气血', 1 }, { '力量', 4 }, { '速度', 1 }, { '抗火', 1 }, { '抗水', 1 }, { '抗风',
            2 },
            { '物理吸收', 2 } } },

}
local _药品范围 = {
    '玫瑰仙叶',
    '千年熊胆',
    '修罗玉',
    '仙鹿茸',
    '夜叉石',
    '海蓝石',
    '孔雀明王羽',
    '五龙圣丹',
}

local _装备范围 = {
    '九转水晶',
    '八宝仙履',
    '玄武战盔',
    '血饮魔刀',
    '青云扇',
    '青霜剑',
    '凤凰羽衣',
    '天宫战斧',
    '八卦紫金锤',
    '大力降魔杵',
    '寒玉佛尘',
    '穿云索',
    '八宝天岚丝',
    '雷光矛',
    '雷神钩',
    '天魔爪',
    '寒玉手',

}


function NPC:NPC菜单(玩家, i)
    if i == '1' then
        if not 玩家:取包裹空位() then
            return "请至少保留一个物品栏"
        end
        local r = 玩家:取物品是否存在("赈灾之银")
        local dd = '你身上没有我要的东西#24'

        if r then
            local x = r.数量
            for n = 1, x do
                local wp
                if math.random(100) < 90 then
                    wp = 生成物品 { 名称 = _药品范围[math.random(#_药品范围)], 数量 = 1 }
                else
                    wp = 生成装备 { 名称 = _装备范围[math.random(#_装备范围)] }
                end
                if wp then
                    if 玩家:添加物品({ wp }) then
                        r:减少(1)
                    end
                end
                if not 玩家:取包裹空位() or r.数量 <= 0 then
                    dd = '太好了,这正是我们要找的镖银，少侠能拿回来给我们真是感激得鼻涕直流#52再没有什么好表达我无比的谢意了,就给少侠一件物品吧,聊表心意#98'
                    break
                end
            end
        end
        return dd
    elseif i == '2' then
        if not 玩家:取包裹空位() then
            return "请至少保留一个物品栏"
        end
        local r = 玩家:取物品是否存在("赈灾之银")
        if r then
            local wp
            if math.random(100) < 90 then
                wp = 生成物品 { 名称 = _药品范围[math.random(#_药品范围)], 数量 = 1 }
            else
                wp = 生成装备 { 名称 = _装备范围[math.random(#_装备范围)] }
            end
            if wp then
                if 玩家:添加物品({ wp }) then
                    r:减少(1)
                end
                return '太好了,这正是我们要找的镖银，少侠能拿回来给我们真是感激得鼻涕直流#52再没有什么好表达我无比的谢意了,就给少侠一件物品吧,聊表心意#98'
            end
        end
        return '你身上没有我要的东西#24'
    elseif i == '3' then
        if 玩家:扣除师贡(20000) then
            local rw = 生成任务 { 名称 = '变身卡' }
            if rw then
                rw:添加任务2(玩家, _强盗卡[math.random(3)])
            end
        else
            return "你没有那么多师贡"
        end
    elseif i == '4' then
    end
end

return NPC
