return {
    [1] = {
        [1] = { 名称 = "白马", 种族 = 1, 几座 = 1 },
        [2] = { 名称 = "骆驼", 种族 = 1, 几座 = 2 },
        [3] = { 名称 = "白狼", 种族 = 1, 几座 = 3 },
        [4] = { 名称 = "鸵鸟", 种族 = 1, 几座 = 4 },
        [5] = { 名称 = "大象", 种族 = 1, 几座 = 5 },
        [6] = { 名称 = "喷火牛", 种族 = 1, 几座 = 6 },
    },
    [2] = {
        [1] = { 名称 = "黑熊", 种族 = 2, 几座 = 1 },
        [2] = { 名称 = "豹", 种族 = 2, 几座 = 2 },
        [3] = { 名称 = "老虎", 种族 = 2, 几座 = 3 },
        [4] = { 名称 = "鸟嘴兽", 种族 = 2, 几座 = 4 },
        [5] = { 名称 = "古代瑞兽", 种族 = 2, 几座 = 5 },
        [6] = { 名称 = "独角蜥蜴", 种族 = 2, 几座 = 6 },
    },
    [3] = {
        [1] = { 名称 = "仙鹿", 种族 = 3, 几座 = 1 },
        [2] = { 名称 = "白虎", 种族 = 3, 几座 = 2 },
        [3] = { 名称 = "银狐", 种族 = 3, 几座 = 3 },
        [4] = { 名称 = "三尾兽", 种族 = 3, 几座 = 4 },
        [5] = { 名称 = "神龟", 种族 = 3, 几座 = 5 },
        [6] = { 名称 = "麒麟", 种族 = 3, 几座 = 6 },
    },
    [4] = {
        [1] = { 名称 = "婴鲤", 种族 = 4, 几座 = 1 },
        [2] = { 名称 = "猫鬼", 种族 = 4, 几座 = 2 },
        [3] = { 名称 = "幽灵马", 种族 = 4, 几座 = 3 },
        [4] = { 名称 = "梦魇", 种族 = 4, 几座 = 4 },
        [5] = { 名称 = "奈何舟", 种族 = 4, 几座 = 5 },
        [6] = { 名称 = "冥轿", 种族 = 4, 几座 = 6 },  
    },
}
