local list = {
    孩子库 = {
        [1] = {
            名称 = '宝宝',
            原名 = '男孩',
            外形 = 46,
            原形 = 46,
            性别 = 1,
            阶段 = 1,
            职业 = '',
            气质 = 0,
            悟性 = 0,
            智力 = 0,
            耐力 = 0,
            内力 = 0,
            亲密 = 0,
            孝心 = 0,
            疲劳 = 0,
            温饱 = 0,
            评价 = 0,
            天资 = { "淘气", "天真", "好奇" },
            物品 = { 引导 = 0, 修炼 = 0 },
            装备 = {},
            其他属性 = {}
        },

        [2] = {
            名称 = '宝宝',
            原名 = '女孩',
            外形 = 47,
            原形 = 47,
            性别 = 2,
            阶段 = 1,
            职业 = '',
            气质 = 0,
            悟性 = 0,
            智力 = 0,
            耐力 = 0,
            内力 = 0,
            亲密 = 0,
            孝心 = 0,
            疲劳 = 0,
            温饱 = 0,
            评价 = 0,
            天资 = { "淘气", "天真", "好奇" },
            物品 = { 引导 = 0, 修炼 = 0 },
            装备 = {},
            其他属性 = {}
        },
    },
    属性范围 = { "气质", "悟性", "智力", "内力", "耐力" },
    引导道具 = {
        -- 无字天书 -5点玩性
        -- 仙童果 +1-5点亲密
        -- 孝经 +1-5点孝心
        玉佩 = { 气质 = 3, 悟性 = 1, 内力 = 1 },
        鬼谷子 = { 智力 = 3, 悟性 = 1, 耐力 = 1 },
        六韬三略 = { 智力 = 3, 悟性 = 2 },
        百年茯苓 = { 耐力 = 3, 内力 = 2 },
        戒指 = { 气质 = 3, 智力 = 1, 耐力 = 1 },
        千字文 = { 悟性 = 3, 智力 = 1, 气质 = 1 },
        百年雪莲 = { 内力 = 3, 气质 = 2 },
        内功心法 = { 内力 = 3, 气质 = 1, 耐力 = 1 },
        百年何首乌 = { 智力 = 1, 气质 = 1, 耐力 = 3 },
        三字经 = { 悟性 = 3, 智力 = 2 },
        高级玉佩 = { 气质 = 3, 悟性 = 1, 内力 = 1 },
        高级鬼谷子 = { 智力 = 3, 悟性 = 1, 耐力 = 1 },
        高级六韬三略 = { 智力 = 3, 悟性 = 2 },
        高级百年茯苓 = { 耐力 = 3, 内力 = 2 },
        高级戒指 = { 气质 = 3, 智力 = 1, 耐力 = 1 },
        高级千字文 = { 悟性 = 3, 智力 = 1, 气质 = 1 },
        高级百年雪莲 = { 内力 = 3, 气质 = 2 },
        高级内功心法 = { 内力 = 3, 气质 = 1, 耐力 = 1 },
        高级百年何首乌 = { 智力 = 1, 气质 = 1, 耐力 = 3 },
        高级三字经 = { 悟性 = 3, 智力 = 2 },
    },
    属性上限表 = {
        琴 = { 气质 = 631, 悟性 = 154, 智力 = 54, 内力 = 207, 耐力 = 54 },
        书画 = { 气质 = 54, 悟性 = 154, 智力 = 631, 内力 = 54, 耐力 = 207 },
        剑舞 = { 气质 = 207, 悟性 = 154, 智力 = 54, 内力 = 631, 耐力 = 54 },
        兵法 = { 气质 = 54, 悟性 = 154, 智力 = 207, 内力 = 54, 耐力 = 631 },
    },
    随机天资 = {
        '先发制人',
        '清风徐来',
        '激流暗涌',
        '江枫渔火',
        '紫电一闪',
        '震慑强化',
        '水系吸收',
        '火系吸收',
        '雷系吸收',
        '风系吸收',
        '破甲',
        '混乱术',
        '封印术',
        '猛毒术',
        '昏睡术',
        '清心咒',
        '破冰术',
        '解毒术',
        '定心咒',
        '铁布衫',
        -- '幽冥冷火',
        -- '玉枕尸虫',
        -- '忘川水煮',
        -- '鬼火吸收',

        '龙腾',
        '风卷残云',
        '排江倒海',
        '芳华绝代',
        '雷霆万钧',
        '摄气诀',
        '玄冰甲',
        '烈火甲',
        '天雷甲',
        '狂风甲',
        '嗜血狂攻',
        '孙子兵法',
        '千里冰封',
        '肝肠寸断',
        '摇篮曲',
        '莲台心法',
        '飞龙在天',
        '丹青妙手',
        '龙神心法',
        '金刚护体',
        -- '鬼火追人',
        -- '尾闾尸虫',
        -- '三生无石',
        -- '冥火甲',
    },
    随机低级天资 = {
        '先发制人',
        '清风徐来',
        '激流暗涌',
        '江枫渔火',
        '紫电一闪',
        '震慑强化',
        '水系吸收',
        '火系吸收',
        '雷系吸收',
        '风系吸收',
        '破甲',
        '混乱术',
        '封印术',
        '猛毒术',
        '昏睡术',
        '清心咒',
        '破冰术',
        '解毒术',
        '定心咒',
        '铁布衫',
        -- '幽冥冷火',
        -- '玉枕尸虫',
        -- '忘川水煮',
        -- '鬼火吸收',
    },
    随机高级天资 = {
        '龙腾',
        '风卷残云',
        '排江倒海',
        '芳华绝代',
        '雷霆万钧',
        '摄气诀',
        '玄冰甲',
        '烈火甲',
        '天雷甲',
        '狂风甲',
        '嗜血狂攻',
        '孙子兵法',
        '千里冰封',
        '肝肠寸断',
        '摇篮曲',
        '莲台心法',
        '飞龙在天',
        '丹青妙手',
        '龙神心法',
        '金刚护体',
        -- '鬼火追人',
        -- '尾闾尸虫',
        -- '三生无石',
        -- '冥火甲',
    },
    取孩子技能几率 = function(评价, 亲密, 孝心, 技能)
        local 评价系数 = 评价 * (0.4 + 8 * 10 ^ -4 * (亲密 + 孝心)) * 0.01
        local 几率 = 0
        if 技能 == "金刚护体" or 技能 == "嗜血狂攻" then -- 43.4824
            几率 = 评价系数
        elseif 技能 == "猛毒术" or 技能 == "飞龙在天"  then --13.04
            几率 = 0.3 * 评价系数
        elseif 技能 == "龙腾" or 技能 == "清风徐来" or 技能 == "激流暗涌" or 技能 == "江枫渔火" or 技能 == "紫电一闪"  then -- 16.30
            几率 = 0.375 * 评价系数
        elseif 技能 == "玄冰甲" or 技能 == "烈火甲" or 技能 == "天雷甲" or 技能 == "狂风甲" then --26089.44
            几率 = 600 * 评价系数
        -- elseif 技能 == "冥火甲" then -- 23915.32
        --     几率 = 550 * 评价系数
        elseif 技能 == "孙子兵法" or 技能 == "千里冰封" or 技能 == "肝肠寸断" or 技能 == "先发制人" or 技能 == "摄气诀" then --10.87
            几率 = 0.25 * 评价系数
        elseif 技能 == "水系吸收" or 技能 == "火系吸收" or 技能 == "雷系吸收" or 技能 == "风系吸收" then -- 19567.07
            几率 = 450 * 评价系数
        -- elseif 技能 == "鬼火吸收" then -- 17392.96
        --     几率 = 400 * 评价系数
        elseif 技能 == "定心咒" or 技能 == "风卷残云" or 技能 == "排江倒海" or 技能 == "芳华绝代" or 技能 == "雷霆万钧"  then --21.74
            几率 = 0.5 * 评价系数
        elseif 技能 == "混乱术" or 技能 == "封印术" or 技能 == "昏睡术" or 技能 == "震慑强化" or 技能 == "清心咒" then -- 7.60
            几率 = 0.175 * 评价系数
        elseif 技能 == "摇篮曲"  then -- 17.39
            几率 = 0.4 * 评价系数
        elseif 技能 == "破冰术" or 技能 == "解毒术" then -- 8.69
            几率 = 0.2 * 评价系数
        elseif 技能 == "龙神心法" or 技能 == "破甲" or 技能 == "铁布衫" or 技能 == "丹青妙手" then --32.61
            几率 = 0.75 * 评价系数
        elseif 技能 == "莲台心法" then -- 10.87
            几率 = 0.25 * 评价系数
        end
        return 几率
    end,
    技能描述 = {
        淘气 = "#Y淘气\n#W增加AP",
        天真 = "#Y天真\n#W增加HP",
        好奇 = "#Y好奇\n#W增加MP",
        先发制人 = "#Y先发制人\n#W每回合在所有战斗单位先出手前有#G%s％#W几率对你释放单体的加速法术，该法术效果为增加200SP，持续时间为1回合",
        龙腾 = "#Y龙腾\n#W每回合在所有战斗单位先出手前有#G%s％#W几率对你释放单体的加速法术，该法术效果为增加200SP，持续时间为1回合",
        清风徐来 = "#Y清风徐来\n#W使用多体风系法术时有#G%s％#W几率增加一个攻击单位",
        风卷残云 = "#Y风卷残云\n#W使用多体风系法术时有#G%s％#W几率增加一个攻击单位",
        激流暗涌 = "#Y激流暗涌\n#W使用多体水系法术时有#G%s％#W几率增加一个攻击单位",
        排江倒海 = "#Y排江倒海\n#W使用多体水系法术时有#G%s％#W几率增加一个攻击单位",
        江枫渔火 = "#Y江枫渔火\n#W使用多体火系法术时有#G%s％#W几率增加一个攻击单位",
        芳华绝代 = "#Y芳华绝代\n#W使用多体火系法术时有#G%s％#W几率增加一个攻击单位",
        紫电一闪 = "#Y紫电一闪\n#W使用多体雷系法术时有#G%s％#W几率增加一个攻击单位",
        雷霆万钧 = "#Y雷霆万钧\n#W使用多体雷系法术时有#G%s％#W几率增加一个攻击单位",
        震慑强化 = "#Y震慑强化\n#W使用震慑法术时有#G%s％#W几率增加一个攻击单位",
        摄气诀 = "#Y摄气诀\n#W使用震慑法术时有#G%s％#W几率增加一个攻击单位",
        水系吸收 = "#Y水系吸收\n#W受到水系法术攻击时有40％几率减少#G%s#W伤害",
        玄冰甲 = "#Y玄冰甲\n#W受到水系法术攻击时有40％几率减少#G%s#W伤害",
        火系吸收 = "#Y火系吸收\n#W受到火系法术攻击时有40％几率减少#G%s#W伤害",
        烈火甲 = "#Y烈火甲\n#W受到火系法术攻击时有40％几率减少#G%s#W伤害",
        雷系吸收 = "#Y雷系吸收\n#W受到雷系法术攻击时有40％几率减少#G%s#W伤害",
        天雷甲 = "#Y天雷甲\n#W受到雷系法术攻击时有40％几率减少#G%s#W伤害",
        风系吸收 = "#Y风系吸收\n#W受到风系法术攻击时有40％几率减少#G%s#W伤害",
        狂风甲 = "#Y狂风甲\n#W受到风系法术攻击时有40％几率减少#G%s#W伤害",
        破甲 = "#Y破甲\n#W物理攻击时有#G%s％#W几率达到100％命中效果",
        嗜血狂攻 = "#Y嗜血狂攻\n#W物理攻击时有#G%s％#W几率达到100％命中效果",
        混乱术 = "#Y混乱术\n#W使用多体混乱法术时有#G%s％#W几率增加一个攻击单位",
        孙子兵法 = "#Y孙子兵法\n#W使用多体混乱法术时有#G%s％#W几率增加一个攻击单位",
        封印术 = "#Y封印术\n#W使用多体封印法术时有#G%s％#W几率增加一个攻击单位",
        千里冰封 = "#Y千里冰封\n#W使用多体封印法术时有#G%s％#W几率增加一个攻击单位",
        猛毒术 = "#Y猛毒术\n#W使用多体毒法术时有#G%s％#W几率增加一个攻击单位",
        肝肠寸断 = "#Y肝肠寸断\n#W使用多体毒法术时有#G%s％#W几率增加一个攻击单位",
        昏睡术 = "#Y昏睡术\n#W使用多体昏睡法术时有#G%s％#W几率增加一个攻击单位",
        摇篮曲 = "#Y摇篮曲\n#W使用多体昏睡法术时有#G%s％#W几率增加一个攻击单位",
        清心咒 = "#Y清心咒\n#W被混乱时每回合有#G%s％#W几率自行摆脱",
        莲台心法 = "#Y莲台心法\n#W被混乱时每回合有#G%s％#W几率自行摆脱",
        破冰术 = "#Y破冰术\n#W被封印时每回合有#G%s％#W几率自行摆脱",
        飞龙在天 = "#Y飞龙在天\n#W被封印时每回合有#G%s％#W几率自行摆脱",
        解毒术 = "#Y解毒术\n#W每回合有#G%s％#W几率从中毒状态中解脱",
        丹青妙手 = "#Y丹青妙手\n#W每回合有#G%s％#W几率从中毒状态中解脱",
        定心咒 = "#Y定心咒\n#W被震慑法术攻击时有#G%s％#W几率不减MP",
        龙神心法 = "#Y龙神心法\n#W被震慑法术攻击时有#G%s％#W几率不减MP",
        铁布衫 = "#Y铁布衫\n#W有#G%s％#W几率抵消每回合第一次物理攻击",
        金刚护体 = "#Y金刚护体\n#W有#G%s％#W几率抵消每回合前两次物理攻击",
        -- 幽冥冷火 = "#Y幽冥冷火\n#W使用多体鬼火法术时有#G%s％#W几率增加一个攻击单位", -- todo
        -- 鬼火追人 = "#Y鬼火追人\n#W使用多体鬼火法术时有#G%s％#W几率增加一个攻击单位", -- todo
        -- 玉枕尸虫 = "#Y玉枕尸虫\n#W使用多体三尸虫法术时有#G%s％#W几率增加一个攻击单位", -- todo -- todo
        -- 尾闾尸虫 = "#Y尾闾尸虫\n#W使用多体三尸虫法术时有#G%s％#W几率增加一个攻击单位", -- todo
        -- 忘川水煮 = "#Y忘川水煮\n#W使用多体遗忘法术时有#G%s％#W几率增加一个攻击单位", -- todo
        -- 三生无石 = "#Y三生无石\n#W使用多体遗忘法术时有#G%s％#W几率增加一个攻击单位", -- todo
        -- 鬼火吸收 = "#Y鬼火吸收\n#W受到鬼火法术攻击时有40％几率减少#G%s#W伤害", -- todo
        -- 冥火甲 = "#Y冥火甲\n#W受到鬼火法术攻击时有40％几率减少#G%s#W伤害", -- todo
        -- 蟠龙术 = "#Y蟠龙术\n#W使用多体霹雳法术时有#G%s％#W几率增加一个目标", -- todo
        -- 双龙戏珠 = "#Y双龙戏珠\n#W使用多体霹雳法术时有#G%s％#W几率增加一个目标", -- todo
        -- 润物诀 = "#Y润物诀\n#W使用多体甘霖法术时有#G%s％#W几率增加一个目标", -- todo
        -- 碧木双生 = "#Y碧木双生\n#W使用多体甘霖法术时有#G%s％#W几率增加一个目标" -- todo
    },
    多目标技能 = {
        昏睡术 = { '离魂咒', '百日眠' },
        摇篮曲 = { '离魂咒', '百日眠' },
        混乱术 = { '谗言相加', '失心狂乱' },
        孙子兵法 = { '谗言相加', '失心狂乱' },
        封印术 = { '天罗地网', '四面楚歌' },
        千里冰封 = { '天罗地网', '四面楚歌' },
        猛毒术 = { '断肠烈散', '万毒攻心' },
        肝肠寸断 = { '断肠烈散', '万毒攻心' },
        紫电一闪 = { '雷神怒击', '天诛地灭' },
        雷霆万钧 = { '雷神怒击', '天诛地灭' },
        激流暗涌 = { '龙啸九天', '九龙冰封' },
        排江倒海 = { '龙啸九天', '九龙冰封' },
        清风徐来 = { '太乙生风', '袖里乾坤' },
        风卷残云 = { '太乙生风', '袖里乾坤' },
        江枫渔火 = { '三味真火', '九阴纯火' },
        芳华绝代 = { '三味真火', '九阴纯火' },
        震慑强化 = { '魔音摄心', '阎罗追命' },
        摄气诀 = { '魔音摄心', '阎罗追命' },
        -- 幽冥冷火 = { '冥烟销骨', '血海深仇' },
        -- 鬼火追人 = { '冥烟销骨', '血海深仇' },
        -- 玉枕尸虫 = { '啮骨抽髓', '吸星大法' },
        -- 尾闾尸虫 = { '啮骨抽髓', '吸星大法' },
        -- 忘川水煮 = { '乱魂钉', '孟婆汤' },
        -- 三生无石 = { '乱魂钉', '孟婆汤' },
    }
    -- 以下是新版孩子引导物品
    -- 引导道具 = {
    --     玉佩 = {
    --         气质 = 3,
    --         智力 = 1,
    --         耐力 = 0,
    --         内力 = 0,
    --         名气 = 0,
    --         道德 = 1,
    --         叛逆 = 0,
    --         玩性 = 0,
    --         温饱 = 0
    --     },
    --     戒指 = {
    --         气质 = 3,
    --         智力 = 0,
    --         耐力 = 0,
    --         内力 = 1,
    --         名气 = 1,
    --         道德 = 0,
    --         叛逆 = 0,
    --         玩性 = 0,
    --         温饱 = 0
    --     },
    --     三字经 = {
    --         气质 = 0,
    --         智力 = 0,
    --         耐力 = 1,
    --         内力 = 0,
    --         名气 = 1,
    --         道德 = 3,
    --         叛逆 = 0,
    --         玩性 = 0,
    --         温饱 = 0
    --     },
    --     千字文 = {
    --         气质 = 1,
    --         智力 = 0,
    --         耐力 = 1,
    --         内力 = 0,
    --         名气 = 0,
    --         道德 = 3,
    --         叛逆 = 0,
    --         玩性 = 0,
    --         温饱 = 0
    --     },
    --     鬼谷子 = {
    --         气质 = 0,
    --         智力 = 1,
    --         耐力 = 3,
    --         内力 = 0,
    --         名气 = 0,
    --         道德 = 1,
    --         叛逆 = 0,
    --         玩性 = 0,
    --         温饱 = 0
    --     },
    --     六韬三略 = {
    --         气质 = 0,
    --         智力 = 0,
    --         耐力 = 3,
    --         内力 = 0,
    --         名气 = 1,
    --         道德 = 1,
    --         叛逆 = 0,
    --         玩性 = 0,
    --         温饱 = 0
    --     },
    --     内功心法 = {
    --         气质 = 0,
    --         智力 = 3,
    --         耐力 = 0,
    --         内力 = 1,
    --         名气 = 1,
    --         道德 = 0,
    --         叛逆 = 0,
    --         玩性 = 0,
    --         温饱 = 0
    --     },
    --     百年雪莲 = {
    --         气质 = 1,
    --         智力 = 3,
    --         耐力 = 0,
    --         内力 = 0,
    --         名气 = 1,
    --         道德 = 0,
    --         叛逆 = 0,
    --         玩性 = 0,
    --         温饱 = 0
    --     },
    --     百年茯苓 = {
    --         气质 = 0,
    --         智力 = 1,
    --         耐力 = 0,
    --         内力 = 3,
    --         名气 = 1,
    --         道德 = 0,
    --         叛逆 = 0,
    --         玩性 = 0,
    --         温饱 = 0
    --     },
    --     百年何首乌 = {
    --         气质 = 1,
    --         智力 = 0,
    --         耐力 = 1,
    --         内力 = 3,
    --         名气 = 0,
    --         道德 = 0,
    --         叛逆 = 0,
    --         玩性 = 0,
    --         温饱 = 0
    --     },
    --     浮生画卷 = {
    --         气质 = 0,
    --         智力 = 0,
    --         耐力 = 0,
    --         内力 = 0,
    --         名气 = 0,
    --         道德 = 0,
    --         叛逆 = 5,
    --         玩性 = 3,
    --         温饱 = 0
    --     },
    --     道祖经 = {
    --         气质 = 0,
    --         智力 = 0,
    --         耐力 = 0,
    --         内力 = 1,
    --         名气 = 3,
    --         道德 = 0,
    --         叛逆 = 1,
    --         玩性 = 0,
    --         温饱 = 0
    --     },
    --     金柳露 = {
    --         气质 = 0,
    --         智力 = 0,
    --         耐力 = 0,
    --         内力 = 0,
    --         名气 = 0,
    --         道德 = 0,
    --         叛逆 = 0,
    --         玩性 = 0,
    --         温饱 = 50
    --     },
    --     高级金柳露 = {
    --         气质 = 0,
    --         智力 = 0,
    --         耐力 = 0,
    --         内力 = 0,
    --         名气 = 0,
    --         道德 = 0,
    --         叛逆 = 0,
    --         玩性 = 0,
    --         温饱 = 100
    --     },
    --     超级金柳露 = {
    --         气质 = 0,
    --         智力 = 0,
    --         耐力 = 0,
    --         内力 = 0,
    --         名气 = 0,
    --         道德 = 0,
    --         叛逆 = 0,
    --         玩性 = 0,
    --         温饱 = 250
    --     },
    -- }
}

if __config.种族 ==  4 or __config.种族 == 4.1 then
    list = {
        孩子库 = {
            [1] = {
                名称 = '宝宝',
                原名 = '男孩',
                外形 = 46,
                原形 = 46,
                性别 = 1,
                阶段 = 1,
                职业 = '',
                气质 = 0,
                悟性 = 0,
                智力 = 0,
                耐力 = 0,
                内力 = 0,
                亲密 = 0,
                孝心 = 0,
                疲劳 = 0,
                温饱 = 0,
                评价 = 0,
                天资 = { "淘气", "天真", "好奇" },
                物品 = { 引导 = 0, 修炼 = 0 },
                装备 = {},
                其他属性 = {}
            },

            [2] = {
                名称 = '宝宝',
                原名 = '女孩',
                外形 = 47,
                原形 = 47,
                性别 = 2,
                阶段 = 1,
                职业 = '',
                气质 = 0,
                悟性 = 0,
                智力 = 0,
                耐力 = 0,
                内力 = 0,
                亲密 = 0,
                孝心 = 0,
                疲劳 = 0,
                温饱 = 0,
                评价 = 0,
                天资 = { "淘气", "天真", "好奇" },
                物品 = { 引导 = 0, 修炼 = 0 },
                装备 = {},
                其他属性 = {}
            },
        },
        属性范围 = { "气质", "悟性", "智力", "内力", "耐力" },
        引导道具 = {
            -- 无字天书 -5点玩性
            -- 仙童果 +1-5点亲密
            -- 孝经 +1-5点孝心
            玉佩 = { 气质 = 3, 悟性 = 1, 内力 = 1 },
            鬼谷子 = { 智力 = 3, 悟性 = 1, 耐力 = 1 },
            六韬三略 = { 智力 = 3, 悟性 = 2 },
            百年茯苓 = { 耐力 = 3, 内力 = 2 },
            戒指 = { 气质 = 3, 智力 = 1, 耐力 = 1 },
            千字文 = { 悟性 = 3, 智力 = 1, 气质 = 1 },
            百年雪莲 = { 内力 = 3, 气质 = 2 },
            内功心法 = { 内力 = 3, 气质 = 1, 耐力 = 1 },
            百年何首乌 = { 智力 = 1, 气质 = 1, 耐力 = 3 },
            三字经 = { 悟性 = 3, 智力 = 2 },
            高级玉佩 = { 气质 = 3, 悟性 = 1, 内力 = 1 },
            高级鬼谷子 = { 智力 = 3, 悟性 = 1, 耐力 = 1 },
            高级六韬三略 = { 智力 = 3, 悟性 = 2 },
            高级百年茯苓 = { 耐力 = 3, 内力 = 2 },
            高级戒指 = { 气质 = 3, 智力 = 1, 耐力 = 1 },
            高级千字文 = { 悟性 = 3, 智力 = 1, 气质 = 1 },
            高级百年雪莲 = { 内力 = 3, 气质 = 2 },
            高级内功心法 = { 内力 = 3, 气质 = 1, 耐力 = 1 },
            高级百年何首乌 = { 智力 = 1, 气质 = 1, 耐力 = 3 },
            高级三字经 = { 悟性 = 3, 智力 = 2 },
        },
        属性上限表 = {
            琴 = { 气质 = 631, 悟性 = 154, 智力 = 54, 内力 = 207, 耐力 = 54 },
            书画 = { 气质 = 54, 悟性 = 154, 智力 = 631, 内力 = 54, 耐力 = 207 },
            剑舞 = { 气质 = 207, 悟性 = 154, 智力 = 54, 内力 = 631, 耐力 = 54 },
            兵法 = { 气质 = 54, 悟性 = 154, 智力 = 207, 内力 = 54, 耐力 = 631 },
        },
        随机天资 = {
            '先发制人',
            '清风徐来',
            '激流暗涌',
            '江枫渔火',
            '紫电一闪',
            '震慑强化',
            '水系吸收',
            '火系吸收',
            '雷系吸收',
            '风系吸收',
            '破甲',
            '混乱术',
            '封印术',
            '猛毒术',
            '昏睡术',
            '清心咒',
            '破冰术',
            '解毒术',
            '定心咒',
            '铁布衫',
            '幽冥冷火',
            '玉枕尸虫',
            '忘川水煮',
            '鬼火吸收',

            '龙腾',
            '风卷残云',
            '排江倒海',
            '芳华绝代',
            '雷霆万钧',
            '摄气诀',
            '玄冰甲',
            '烈火甲',
            '天雷甲',
            '狂风甲',
            '嗜血狂攻',
            '孙子兵法',
            '千里冰封',
            '肝肠寸断',
            '摇篮曲',
            '莲台心法',
            '飞龙在天',
            '丹青妙手',
            '龙神心法',
            '金刚护体',
            '鬼火追人',
            '尾闾尸虫',
            '三生无石',
            '冥火甲',
        },
        随机低级天资 = {
            '先发制人',
            '清风徐来',
            '激流暗涌',
            '江枫渔火',
            '紫电一闪',
            '震慑强化',
            '水系吸收',
            '火系吸收',
            '雷系吸收',
            '风系吸收',
            '破甲',
            '混乱术',
            '封印术',
            '猛毒术',
            '昏睡术',
            '清心咒',
            '破冰术',
            '解毒术',
            '定心咒',
            '铁布衫',
            '幽冥冷火',
            '玉枕尸虫',
            '忘川水煮',
            '鬼火吸收',
        },
        随机高级天资 = {
            '龙腾',
            '风卷残云',
            '排江倒海',
            '芳华绝代',
            '雷霆万钧',
            '摄气诀',
            '玄冰甲',
            '烈火甲',
            '天雷甲',
            '狂风甲',
            '嗜血狂攻',
            '孙子兵法',
            '千里冰封',
            '肝肠寸断',
            '摇篮曲',
            '莲台心法',
            '飞龙在天',
            '丹青妙手',
            '龙神心法',
            '金刚护体',
            '鬼火追人',
            '尾闾尸虫',
            '三生无石',
            '冥火甲',
        },
        取孩子技能几率 = function(评价, 亲密, 孝心, 技能)
            local 评价系数 = 评价 * (0.4 + 8 * 10 ^ -4 * (亲密 + 孝心)) * 0.01
            local 几率 = 0
            if 技能 == "金刚护体" or 技能 == "嗜血狂攻" then -- 43.4824           
                几率 = 评价系数
            elseif 技能 == "猛毒术" or 技能 == "飞龙在天" or 技能 == "忘川水煮" then --13.04
                几率 = 0.3 * 评价系数
            elseif 技能 == "龙腾" or 技能 == "清风徐来" or 技能 == "激流暗涌" or 技能 == "江枫渔火" or 技能 == "紫电一闪" or 技能 == "玉枕尸虫" or 技能 == "幽冥冷火" then -- 16.30
                几率 = 0.375 * 评价系数
            elseif 技能 == "玄冰甲" or 技能 == "烈火甲" or 技能 == "天雷甲" or 技能 == "狂风甲" then --26089.44
                几率 = 600 * 评价系数
            elseif 技能 == "冥火甲" then -- 23915.32
                几率 = 550 * 评价系数
            elseif 技能 == "孙子兵法" or 技能 == "千里冰封" or 技能 == "肝肠寸断" or 技能 == "先发制人" or 技能 == "摄气诀" then --10.87
                几率 = 0.25 * 评价系数
            elseif 技能 == "水系吸收" or 技能 == "火系吸收" or 技能 == "雷系吸收" or 技能 == "风系吸收" then -- 19567.07
                几率 = 450 * 评价系数
            elseif 技能 == "鬼火吸收" then -- 17392.96
                几率 = 400 * 评价系数
            elseif 技能 == "定心咒" or 技能 == "风卷残云" or 技能 == "排江倒海" or 技能 == "芳华绝代" or 技能 == "雷霆万钧" or 技能 == "鬼火追人" then --21.74
                几率 = 0.5 * 评价系数
            elseif 技能 == "混乱术" or 技能 == "封印术" or 技能 == "昏睡术" or 技能 == "震慑强化" or 技能 == "清心咒" then -- 7.60
                几率 = 0.175 * 评价系数
            elseif 技能 == "摇篮曲" or 技能 == "三生无石" or 技能 == "尾闾尸虫" then -- 17.39   
                几率 = 0.4 * 评价系数
            elseif 技能 == "破冰术" or 技能 == "解毒术" then -- 8.69
                几率 = 0.2 * 评价系数
            elseif 技能 == "龙神心法" or 技能 == "破甲" or 技能 == "铁布衫" or 技能 == "丹青妙手" then --32.61
                几率 = 0.75 * 评价系数
            elseif 技能 == "莲台心法" then -- 10.87
                几率 = 0.25 * 评价系数
            end
            return 几率
        end,
        技能描述 = {
            淘气 = "#Y淘气\n#W增加AP",
            天真 = "#Y天真\n#W增加HP",
            好奇 = "#Y好奇\n#W增加MP",
            先发制人 = "#Y先发制人\n#W每回合在所有战斗单位先出手前有#G%s％#W几率对你释放单体的加速法术，该法术效果为增加200SP，持续时间为1回合",
            龙腾 = "#Y龙腾\n#W每回合在所有战斗单位先出手前有#G%s％#W几率对你释放单体的加速法术，该法术效果为增加200SP，持续时间为1回合",
            清风徐来 = "#Y清风徐来\n#W使用多体风系法术时有#G%s％#W几率增加一个攻击单位",
            风卷残云 = "#Y风卷残云\n#W使用多体风系法术时有#G%s％#W几率增加一个攻击单位",
            激流暗涌 = "#Y激流暗涌\n#W使用多体水系法术时有#G%s％#W几率增加一个攻击单位",
            排江倒海 = "#Y排江倒海\n#W使用多体水系法术时有#G%s％#W几率增加一个攻击单位",
            江枫渔火 = "#Y江枫渔火\n#W使用多体火系法术时有#G%s％#W几率增加一个攻击单位",
            芳华绝代 = "#Y芳华绝代\n#W使用多体火系法术时有#G%s％#W几率增加一个攻击单位",
            紫电一闪 = "#Y紫电一闪\n#W使用多体雷系法术时有#G%s％#W几率增加一个攻击单位",
            雷霆万钧 = "#Y雷霆万钧\n#W使用多体雷系法术时有#G%s％#W几率增加一个攻击单位",
            震慑强化 = "#Y震慑强化\n#W使用震慑法术时有#G%s％#W几率增加一个攻击单位",
            摄气诀 = "#Y摄气诀\n#W使用震慑法术时有#G%s％#W几率增加一个攻击单位",
            水系吸收 = "#Y水系吸收\n#W受到水系法术攻击时有40％几率减少#G%s#W伤害",
            玄冰甲 = "#Y玄冰甲\n#W受到水系法术攻击时有40％几率减少#G%s#W伤害",
            火系吸收 = "#Y火系吸收\n#W受到火系法术攻击时有40％几率减少#G%s#W伤害",
            烈火甲 = "#Y烈火甲\n#W受到火系法术攻击时有40％几率减少#G%s#W伤害",
            雷系吸收 = "#Y雷系吸收\n#W受到雷系法术攻击时有40％几率减少#G%s#W伤害",
            天雷甲 = "#Y天雷甲\n#W受到雷系法术攻击时有40％几率减少#G%s#W伤害",
            风系吸收 = "#Y风系吸收\n#W受到风系法术攻击时有40％几率减少#G%s#W伤害",
            狂风甲 = "#Y狂风甲\n#W受到风系法术攻击时有40％几率减少#G%s#W伤害",
            破甲 = "#Y破甲\n#W物理攻击时有#G%s％#W几率达到100％命中效果",
            嗜血狂攻 = "#Y嗜血狂攻\n#W物理攻击时有#G%s％#W几率达到100％命中效果",
            混乱术 = "#Y混乱术\n#W使用多体混乱法术时有#G%s％#W几率增加一个攻击单位",
            孙子兵法 = "#Y孙子兵法\n#W使用多体混乱法术时有#G%s％#W几率增加一个攻击单位",
            封印术 = "#Y封印术\n#W使用多体封印法术时有#G%s％#W几率增加一个攻击单位",
            千里冰封 = "#Y千里冰封\n#W使用多体封印法术时有#G%s％#W几率增加一个攻击单位",
            猛毒术 = "#Y猛毒术\n#W使用多体毒法术时有#G%s％#W几率增加一个攻击单位",
            肝肠寸断 = "#Y肝肠寸断\n#W使用多体毒法术时有#G%s％#W几率增加一个攻击单位",
            昏睡术 = "#Y昏睡术\n#W使用多体昏睡法术时有#G%s％#W几率增加一个攻击单位",
            摇篮曲 = "#Y摇篮曲\n#W使用多体昏睡法术时有#G%s％#W几率增加一个攻击单位",
            清心咒 = "#Y清心咒\n#W被混乱时每回合有#G%s％#W几率自行摆脱",
            莲台心法 = "#Y莲台心法\n#W被混乱时每回合有#G%s％#W几率自行摆脱",
            破冰术 = "#Y破冰术\n#W被封印时每回合有#G%s％#W几率自行摆脱",
            飞龙在天 = "#Y飞龙在天\n#W被封印时每回合有#G%s％#W几率自行摆脱",
            解毒术 = "#Y解毒术\n#W每回合有#G%s％#W几率从中毒状态中解脱",
            丹青妙手 = "#Y丹青妙手\n#W每回合有#G%s％#W几率从中毒状态中解脱",
            定心咒 = "#Y定心咒\n#W被震慑法术攻击时有#G%s％#W几率不减MP",
            龙神心法 = "#Y龙神心法\n#W被震慑法术攻击时有#G%s％#W几率不减MP",
            铁布衫 = "#Y铁布衫\n#W有#G%s％#W几率抵消每回合第一次物理攻击",
            金刚护体 = "#Y金刚护体\n#W有#G%s％#W几率抵消每回合前两次物理攻击",
            幽冥冷火 = "#Y幽冥冷火\n#W使用多体鬼火法术时有#G%s％#W几率增加一个攻击单位", -- todo
            鬼火追人 = "#Y鬼火追人\n#W使用多体鬼火法术时有#G%s％#W几率增加一个攻击单位", -- todo
            玉枕尸虫 = "#Y玉枕尸虫\n#W使用多体三尸虫法术时有#G%s％#W几率增加一个攻击单位", -- todo -- todo
            尾闾尸虫 = "#Y尾闾尸虫\n#W使用多体三尸虫法术时有#G%s％#W几率增加一个攻击单位", -- todo
            忘川水煮 = "#Y忘川水煮\n#W使用多体遗忘法术时有#G%s％#W几率增加一个攻击单位", -- todo
            三生无石 = "#Y三生无石\n#W使用多体遗忘法术时有#G%s％#W几率增加一个攻击单位", -- todo
            鬼火吸收 = "#Y鬼火吸收\n#W受到鬼火法术攻击时有40％几率减少#G%s#W伤害", -- todo
            冥火甲 = "#Y冥火甲\n#W受到鬼火法术攻击时有40％几率减少#G%s#W伤害", -- todo
            蟠龙术 = "#Y蟠龙术\n#W使用多体霹雳法术时有#G%s％#W几率增加一个目标", -- todo
            双龙戏珠 = "#Y双龙戏珠\n#W使用多体霹雳法术时有#G%s％#W几率增加一个目标", -- todo
            润物诀 = "#Y润物诀\n#W使用多体甘霖法术时有#G%s％#W几率增加一个目标", -- todo
            碧木双生 = "#Y碧木双生\n#W使用多体甘霖法术时有#G%s％#W几率增加一个目标" -- todo
        },
        多目标技能 = {
            昏睡术 = { '离魂咒', '百日眠' },
            摇篮曲 = { '离魂咒', '百日眠' },
            混乱术 = { '谗言相加', '失心狂乱' },
            孙子兵法 = { '谗言相加', '失心狂乱' },
            封印术 = { '天罗地网', '四面楚歌' },
            千里冰封 = { '天罗地网', '四面楚歌' },
            猛毒术 = { '断肠烈散', '万毒攻心' },
            肝肠寸断 = { '断肠烈散', '万毒攻心' },
            紫电一闪 = { '雷神怒击', '天诛地灭' },
            雷霆万钧 = { '雷神怒击', '天诛地灭' },
            激流暗涌 = { '龙啸九天', '九龙冰封' },
            排江倒海 = { '龙啸九天', '九龙冰封' },
            清风徐来 = { '太乙生风', '袖里乾坤' },
            风卷残云 = { '太乙生风', '袖里乾坤' },
            江枫渔火 = { '三味真火', '九阴纯火' },
            芳华绝代 = { '三味真火', '九阴纯火' },
            震慑强化 = { '魔音摄心', '阎罗追命' },
            摄气诀 = { '魔音摄心', '阎罗追命' },
            幽冥冷火 = { '冥烟销骨', '血海深仇' },
            鬼火追人 = { '冥烟销骨', '血海深仇' },
            玉枕尸虫 = { '啮骨抽髓', '吸星大法' },
            尾闾尸虫 = { '啮骨抽髓', '吸星大法' },
            忘川水煮 = { '乱魂钉', '孟婆汤' },
            三生无石 = { '乱魂钉', '孟婆汤' },
        }
    }
end
return list
-- 气质 智力 耐力 内力 名气 道德 叛逆
-- 亲密、孝心会提高孩子天资发动几率；
-- 玩性会降低职业评价及天资发动几率；
-- 疲劳度太高会导致孩子无法进行学习和实践。

-- 结局 判断规则
-- 神结局达成条件：男孩（革命领袖）、女孩（倾国女神）
-- 条件均为气质、耐力、智力、内力、名气≥999，没有要求哪一项最高。
-- 强化天资: 强化全部高级天资, 强化全部高级天资, 强化全部天资

-- 人族 专属结局达成条件: 男孩（富家小主公）、女孩（舞蹈家）
-- 区别：男孩需要到访国子监30次，女孩需要学习舞蹈30次。(未实现)
-- 条件均为气质、道德、智力≥999，气质最高。
-- 强化天资: 强化人族高级天资, 强化通用高级天资, 强化全部低级天资

-- 仙族 专属结局达成条件: 男孩（大法术师）、女孩（音乐家）
-- 区别：男孩需要学习武术30次，女孩需要学习音律30次(未实现)
-- 条件均为智力、名气、气质≥999，智力最高。
-- 强化天资: 强化仙族高级天资, 强化通用高级天资, 强化全部低级天资

-- 魔族 专属结局达成条件: 男孩（大内第一高手）、女孩（女侠客）
-- 区别：男孩需要完成御膳房火工30次，女孩需要完成帮工30次。(未实现)
-- 条件均为耐力、内力、名气≥999，耐力最高。
-- 强化天资: 强化仙族高级天资, 强化通用高级天资, 强化全部低级天资

-- 鬼族 专属结局达成条件: 男孩（江湖话事人）、女孩（旅行家）
-- 区别：男孩需要帮工30次，女孩需要驿站收银30次。
-- 条件均为内力、叛逆、耐力≥999，内力最高。
-- 强化天资: 强化仙族高级天资, 强化通用高级天资, 强化全部低级天资

-- 孩子属性 = {
--     名称 = '宝宝',
--     -- 外形 = 46 男
--     -- 原型 = 47 女
--     -- 性別 = 1男 | 2女
--     年龄 = { 岁 = 0, 月 = 0 },
--     是否参战 = false,
--     -- 阶段 1婴儿 2儿童 3青年 4成年
--     阶段 = 1,
--     气质 = 0,
--     智力 = 0,
--     耐力 = 0,
--     内力 = 0,
--     名气 = 0,
--     道德 = 0,
--     叛逆 = 0,

--     亲密 = 0,
--     孝心 = 0,
--     玩性 = 0,
--     温饱 = 0,
--     疲劳 = 0,
--     养育金 = 0,
--     -- 引导/8 得月数 月数/12 得年龄 加温饱的不计入次数
--     引导 = 0,
--     职业 = 0,
--     修炼 = 0,

--     评价 = 0,
--     结局 = '',
--     天资 = {},
--     强化天资 = {},

--     装备 = {},
--     装备属性 = {},
--     技能 = {},
--     获得时间 = 0,
--     丢弃时间 = 0,
-- }
