return {
    所有召唤兽技能  = {
      乱舞狂刀 = 1,    --大浪
      慧心巧思 = 1,    --颜如玉
      黄泉一笑 = 1,    --范式
      积水为海 = 1,     --老头
      皮糙肉厚 = 1,    --五叶
      元宵快乐 = 1,   --包子
      一年一度 = 1,    --包子
      蜃光流星 = 1,    --1      --乘黄专用 
      剑荡八荒 = 1,    --1  --惜红衣这个也是专属技能 
      临风剑意 = 1,    --1   --惜红衣没见过
      画魂叠影  = 1,  -- 龙马   画皮娘子
      龙象般若  = 1,     -- 孔雀明王
      天降脱兔  = 1,      --龙兔
      移花接玉  = 1,     --画中仙 
      泽披天下  = 1,    --白泽
      万箭齐发 = 1,  --莲花生 
      万籁俱寂 = 1,
      以退为进 = 1,
      倍道兼行 = 1,
      兵临城下 = 1,
      冰冻三尺 = 1,
      刀枪不入 = 1,
      分光要诀 = 1,
      分裂攻击 = 1,
      劫火万丈 = 1,
      厚土诀 = 1,
      反哺之私 = 1,
      大义 = 1,
      大隐于朝 = 1,
      天魔要诀 = 1,
      夺魂索命 = 1,
      奋蹄扬威 = 1,
      如人饮水 = 1,
      如来神掌 = 1,
      如虎添翼 = 1,
      妙手回春 = 1,
      妙转乾坤 = 1,
      寒木春华 = 1,
      寸土不让 = 1,
      封印 = 1,
      涅槃 = 1,
      小楼要诀 = 1,
      帐饮东都 = 1,
      开山裂石 = 1,
      强心术 = 1,
      忠不避危 = 1,
      忠肝义胆 = 1,
      忠诚 = 1,
      怒仙 = 1,
      恭行天罚 = 1,
      慈乌反哺 = 1,
      慧眼菩提 = 1,
      戟指怒目 = 1,
      扶伤 = 1,
      拖泥带水 = 1,
      挥戈回日 = 1,
      春回大地 = 1,
      春风拂面 = 1,
      暗影离魂 = 1,
      大圣神通 = 1,
      朗月清风 = 1,
      朝云暮雨 = 1,
      木灵诀 = 1,
      杀身成仁 = 1,
      枯木缠身 = 1,
      枯木逢春 = 1,
      柔若无骨 = 1,
      此恨绵绵 = 1,
      气贯长虹 = 1,
      水中探月 = 1,
      水到渠成 = 1,
      沧海诀 = 1,
      波澜不惊 = 1,
      泥足巨人 = 1,
      洞若观火 = 1,
      混乱 = 1,
      清明术 = 1,
      清风拂面 = 1,
      源泉万斛 = 1,
      潮鸣电挚 = 1,
      濯后涤尘 = 1,
      灵犀诀 = 1,
      灵逸 = 1,
      炊金馔玉 = 1,
      炳若观火 = 1,
      烈火诀 = 1,
      烟行媚视 = 1,
      焦金流石 = 1,
      百草竞发 = 1,
      矢志不渝 = 1,
      碧血丹心 = 1,
      神出鬼没 = 1,
      神工鬼力 = 1,
      神迟魂钝 = 1,
      精贯白日 = 1,
      红衰翠减 = 1,
      终极技能 = 1,
      绝境逢生 = 1,
      脱困术 = 1,
      自医 = 1,
      草木俱朽 = 1,
      西天净土 = 1,
      赴汤蹈火 = 1,
      蹒跚 = 1,
      软红香土 = 1,
      进退自如 = 1,
      迟徊不决 = 1,
      逐水东流 = 1,
      遗产 = 1,
      醍醐灌顶 = 1,
      金刚不坏 = 1, 
      金声玉润 = 1,
      金铭诀 = 1,
      闪现 = 1,
      隐身 = 1,
      雾里看花 = 1,
      震慑抵抗 = 1,
      青面要诀 = 1,
      风火燎原 = 1,
      高级倍道兼行 = 1,
      高级分裂攻击 = 1,
      高级反哺之私 = 1,
      高级奋蹄扬威 = 1,
      高级帐饮东都 = 1,
      高级强心术 = 1,
      高级慈乌反哺 = 1,
      高级清明术 = 1,
      高级源泉万斛 = 1,
      高级神工鬼力 = 1,
      高级脱困术 = 1,
      鼓音三叠 = 1,
      报复 = 1,
      悬刃 = 1,
      强化悬刃 = 1,
      遗患 = 1,
      强化遗患 = 1,
      恨仙 = 1,
      妙手仁心 = 1,
      仙风道骨 = 1,
      步步生莲 = 1,
      春意盎然 = 1,
      飞燕回翔 = 1,
      分花拂柳 = 1,
      福禄双全 = 1,
      腐水 = 1,
      鬼神莫测 = 1,
      横云断峰 = 1,
      回源 = 1,
      击其不意 = 1,
      吉人天相 = 1,
      亢龙有悔 = 1,
      昆山玉碎 = 1,
      礼之火叶神 = 1,
      裂土 = 1,
      柳暗花明 = 1,
      妙笔生花 = 1,
      拈花一笑 = 1,
      破木 = 1,
      牵制 = 1,
      祛火 = 1,
      取之有道 = 1,
      人来疯 = 1,
      仁之木叶神 = 1,
      日月重光 = 1,
      熔金 = 1,
      舍生取义 = 1,
      审时度势 = 1,
      视死如归 = 1,
      顺水推舟 = 1,
      探海屠龙 = 1,
      讨命 = 1,
      天地同寿 = 1,
      信之土叶神 = 1,
      义之金叶神 = 1,
      鹰击长空 = 1,
      智之水叶神 = 1,
      顾影自怜 = 1,
      春暖花开 = 1,
      明察秋毫 = 1,
      当头棒喝 = 1,
      化无 = 1,
      将死 = 1,
      双管齐下 = 1,
      以牙还牙 = 1,
      子虚乌有 = 1,
      作鸟兽散 = 1,
      天降流火 = 1
    },
    -- 0 普通 1高级 2神兽技能 3终极
    普通技能 = {
        -- "一年一度",   -- 年专用
        -- "乱舞狂刀",   -- 浪淘沙专用
        -- "奋蹄扬威",   -- 龙马专属
        -- "如来神掌",   -- 孔雀明王专属     
        -- "慧心巧思",   -- 颜如玉专用  
        -- "暗影离魂",   -- 孟极专用
        -- "水中探月",   -- 水月镜花  专属技能
        -- "百草竞发",   -- 去疾 专属技能
        -- "雾里看花",   -- 水月镜花  专属技能
        -- "开山裂石",   -- 迦楼罗王 专属
        -- "恭行天罚",   -- 迦楼罗王 年专属
        -- "柔若无骨",   -- 冥灵妃子
        -- "此恨绵绵",   -- 冥灵妃子
        -- "洞若观火",   -- 龙涎丸召唤兽
        -- "高级奋蹄扬威",  -- 2013年鎏金宝鉴召唤兽——画皮娘子
        -- "剑荡八荒",   -- 惜红衣专属
        -- "临风剑意",
        -- "蜃光流星",   -- 乘黄专属
        -- "画魂叠影",   -- 龙马   画皮娘子
        -- "龙象般若",   -- 孔雀明王
        -- "天降脱兔",   -- 龙兔
        -- "移花接玉",   -- 画中仙 
        -- "泽披天下",   -- 白泽
        "以退为进",
        "倍道兼行",
        "刀枪不入",
        "分光要诀",
        "分裂攻击",
        "反哺之私",
        "大义",
        "天魔要诀",
        "封印",
        "小楼要诀",
        "帐饮东都",
        "强心术",
        "忠不避危",
        "忠肝义胆",
        "忠诚",
        "怒仙",
        "慈乌反哺",
        "水到渠成",
        "混乱",
        "清风拂面",
        "源泉万斛",
        "炳若观火",
        "矢志不渝",
        "神工鬼力",
        "积水为海",
        "脱困术",
        "自医",
        "蹒跚",
        "软红香土",
        "遗产",
        "金刚不坏",
        "金声玉润",
        "万箭齐发",
        "闪现",
        "隐身",
        "青面要诀",
        "逐水东流",
        "赴汤蹈火",
        "劫火万丈",
        "焦金流石",
        "草木俱朽",
        "朝云暮雨",
        "挥戈回日",
        "寸土不让",
        "恨仙",

    },
    高级技能 = {
        -- "寒木春华",   --1 金五行≥50才能领悟  冲突关系：金声玉润 寒木春华 水到渠成 炳若观火 软红香土 　　相互冲突，后领悟/学习的技能生效     
        -- "枯木缠身",   --1
        -- "冰冻三尺",   --1
        -- "强化悬刃",
        -- "强化遗患",
        -- "步步生莲",    --1
        -- "飞燕回翔",    --1
        -- "横云断峰",    --1 
        -- "亢龙有悔",    --1 
        -- "昆山玉碎",    --1 
        -- "拈花一笑",    --1 
        -- "探海屠龙",     --1 
        -- "鹰击长空",     --1
        "灵犀诀",     --1
        "清明术",     --1
        "灵逸",       --1
        "神出鬼没",   --1
        "烈火诀",     --1
        "进退自如",   --1
        "金铭诀",     --1       
        "万籁俱寂",   --1  
        "如人饮水",   --1
        "妙手回春",   --1
        "朗月清风",   --1
        "木灵诀",     --1
        "沧海诀",     --1
        "扶伤",      --1  扶伤技能和忠诚,灵逸,大义,自医存在 覆盖关系
        "厚土诀",     --1
        "大隐于朝",   --1
        "枯木逢春",   --1
        "炊金馔玉",   --1
        "西天净土",   --1     
        "风火燎原",  --1
        "高级倍道兼行",  --1
        "高级分裂攻击",  --1
        "高级反哺之私",  --1       
        "高级帐饮东都",  --1
        "高级强心术",    --1
        "高级慈乌反哺",   --1
        "高级清明术",    --1
        "高级源泉万斛",  --1
        "高级神工鬼力",  --1 
        "高级脱困术",  --1
        "悬刃",
        "遗患",
        "妙手仁心",   --0
        "仙风道骨",   --0      
        "春意盎然",    --1     
        "分花拂柳",    --1
        "福禄双全",    --1
        "腐水",    --1 
        "鬼神莫测",    --1 
        "回源",    --1 
        "击其不意",    --1 
        "吉人天相",    --1      
        "礼之火叶神",    --1 
        "裂土",    --1
        "柳暗花明",    --1 
        "妙笔生花",    --1 
        "破木",    --1 
        "牵制",    --1 
        "祛火",     --1 
        "取之有道",     --1 
        "人来疯",     --1 
        "仁之木叶神",     --1 
        "日月重光",     --1 
        "熔金",     --1 
        "舍生取义",     --1 
        "审时度势",     --1       
        "视死如归",     --1 
        "顺水推舟",     --1  
        "讨命",     --1 
        "天地同寿",     --1 
        "信之土叶神",     --1 
        "义之金叶神",     --1 
        "智之水叶神",    --1 
        "春风拂面",   --3  春风拂面和当头棒喝存在覆盖关系      

    },
    终极技能 = {
     "绝境逢生",  --3
     "夺魂索命",   --3
     "春回大地",   --3
     "春暖花开",
     "明察秋毫",
     "当头棒喝",
     "化无",
     "将死",
     "双管齐下",
     "以牙还牙",
     "子虚乌有",
     "作鸟兽散"
    },

    -- 只能在灵兽大仙处领悟 是显示在中间的 只有神兽可以领悟
    神兽领悟技能 = {
      "如虎添翼",   --2
      "如虎添翼",   --2
      "潮鸣电挚",   --2
      "涅槃",       --2
      "精贯白日",   --2
      "精贯白日",   --2
      "精贯白日",   --2
      "兵临城下",   --2
      "顾影自怜",   --2
    },
    -- 覆盖规则 = {
    --   分裂攻击 = {"高级分裂攻击","分花拂柳"},
    --   高级分裂攻击 = {"分裂攻击","分花拂柳"},
    --   分花拂柳 = {"分裂攻击","高级分裂攻击"},
    --   枯木逢春 = {"风火燎原","西天净土","炊金馔玉","如人饮水",},
    --   风火燎原 = {"枯木逢春","西天净土","炊金馔玉","如人饮水",},
    --   西天净土 = {"风火燎原","枯木逢春","炊金馔玉","如人饮水",},
    --   炊金馔玉 = {"风火燎原","西天净土","枯木逢春","如人饮水",},
    --   如人饮水 = {"风火燎原","西天净土","炊金馔玉","枯木逢春",},
    -- },

    冲突组 = {
      [1]={"绝境逢生","妙手回春"},
      [2]={"化无","遗患","强化悬刃","强化遗患","悬刃"},
      [3]={"将死","遗产","天地同寿","视死如归","作鸟兽散"},
      [4]={"春风拂面","当头棒喝"},
      [5]={"双管齐下","讨命"},
      [6]={"春回大地","春意盎然"},
      [7]={"兵临城下","背水一战"},
      [8]={"涅槃","吉人天相"},
      [9]={"潮鸣电掣","帐饮东都","源泉万斛","神工鬼力","倍道兼行","蹒跚","高级神工鬼力","高级源泉万斛","高级帐饮东都","高级倍道兼行"},
      [10]={"义之金叶神","仁之木叶神","信之土叶神","智之水叶神","礼之火叶神","鬼神莫测","神出鬼没","大隐于朝"},
      [11]={"进退自如","以退为进"},
      [12]={"分花拂柳","高级分裂攻击","分裂攻击"},
      [13]={"朗月清风","灵犀诀","金铭诀","木灵诀","厚土诀","烈火诀","沧海诀"},
      [14]={"高级清明术","高级脱困术","高级强心术","清明术","脱困术","强心术"},
      [15]={"高级慈乌反哺","慈乌反哺","高级反哺之私","反哺之私"},
      [16]={"高级反哺之私","反哺之私","高级慈乌反哺","慈乌反哺"},
      [17]={"回源","报复"},
      [18]={"炊金镶玉","枯木逢春","如人饮水","风火燎原","西天净土","万籁俱寂"},
      [19]={"仙风道骨","妙手仁心"},
      [20]={"封印","混乱"},
      [21]={"天魔要诀","分光要诀","青面要诀","小楼要诀"},

      -- 日月重光  朗月清风 金铭诀 木灵诀 厚土诀 沧海诀 烈火诀 日月重光 灵犀诀。
    },
    五行要求规则 = {
      万箭齐发 = {金=50,灵性=450},
      劫火万丈 = {火=50,灵性=450},
      分裂攻击 = {力量=450},
      金声玉润 = {火=50},
      寒木春华 = {金=50},
      水到渠成 = {土=50},
      炳若观火 = {水=50},
      软红香土 = {木=50},
      枯木缠身 = {木=50},
      冰冻三尺 = {水=50},
      舍生取义 = {土=50,根骨=450},
      高级分裂攻击 = {力量=450},
      礼之火叶神 = {火=50},
      义之金叶神 = {金=50},
      信之土叶神 = {土=50},
      智之水叶神 = {水=50},
      仁之木叶神 = {木=50},
      拈花一笑 = {灵性=400},
      飞燕回翔 = {灵性=600},
      神出鬼没 = {水=50},
      鬼神莫测 = {火=50},
      大隐于朝 = {木=50},
      鹰击长空 = {力量=450},
      分花拂柳 = {力量=450},

    },

    取技能冲突类型 = function (名称)
      local 类型 = 0
      if 名称=="绝境逢生"or 名称=="妙手回春" then
        类型 = 1
      elseif 名称=="化无"or 名称=="遗患"or 名称=="悬刃"or 名称=="强化悬刃"or 名称=="强化遗患" then
        类型 = 2
      elseif 名称=="将死"or 名称=="遗产"or 名称=="天地同寿"or 名称=="视死如归"or 名称=="作鸟兽散" then
        类型 = 3
      elseif 名称=="春风拂面"or 名称=="当头棒喝" then
        类型 = 4
      elseif 名称=="双管齐下"or 名称=="讨命" then
        类型 = 5
      elseif 名称=="春回大地"or 名称=="春意盎然" then
        类型 = 6
      elseif 名称=="兵临城下"or 名称=="背水一战" then
        类型 = 7
      elseif 名称=="涅槃"or 名称=="吉人天相" then
        类型 = 8
      elseif 名称=="潮鸣电掣"or 名称=="帐饮东都"or 名称=="源泉万斛"or 名称=="神工鬼力"or 名称=="倍道兼行"or 名称=="蹒跚" or 名称=="高级神工鬼力"or 名称=="高级源泉万斛"or 名称=="高级帐饮东都"or 名称=="高级倍道兼行" then
        类型 = 9
      elseif 名称=="义之金叶神"or 名称=="仁之木叶神"or 名称=="信之土叶神"or 名称=="智之水叶神"or 名称=="礼之火叶神"or 名称=="鬼神莫测"or 名称=="神出鬼没"or 名称=="大隐于朝" then
        类型 = 10
      elseif 名称=="进退自如"or 名称=="以退为进" then
        类型 = 11
      elseif 名称=="分花拂柳"or 名称=="高级分裂攻击"or 名称=="分裂攻击" then
        类型 = 12
      elseif 名称=="朗月清风"or 名称=="灵犀诀"or 名称=="金铭诀"or 名称=="木灵诀"or 名称=="厚土诀"or 名称=="烈火诀"or 名称=="沧海诀" then
        类型 = 13
      elseif 名称=="高级清明术"or 名称=="高级脱困术"or 名称=="高级强心术"or 名称=="清明术"or 名称=="脱困术"or 名称=="强心术" then
        类型 = 14
      elseif 名称=="高级慈乌反哺"or 名称=="慈乌反哺"or 名称=="高级反哺之私"or 名称=="反哺之私" then
        类型 = 15
      elseif 名称=="高级反哺之私"or 名称=="反哺之私" or 名称=="高级慈乌反哺"or 名称=="慈乌反哺" then
        类型 = 16
      elseif 名称=="回源"or 名称=="报复" then
        类型 = 17
      elseif 名称=="炊金镶玉"or 名称=="枯木逢春"or 名称=="如人饮水"or 名称=="风火燎原"or 名称=="西天净土"or 名称=="万籁俱寂" then
        类型 = 18
      elseif 名称=="仙风道骨"or 名称=="妙手仁心" then
        类型 = 19
      elseif 名称=="封印"or 名称=="混乱" then
        类型 = 20
      elseif 名称=="天魔要诀"or 名称=="分光要诀"or 名称=="青面要诀"or 名称=="小楼要诀" then
        类型 = 21
      end
      return 类型
    end
}



-- 终极技能 = {
--     "作鸟兽散","子虚乌有","以牙还牙","双管齐下","明察秋毫","绝境逢生","将死","化无","夺魂索命","当头棒喝","春暖花开","春回大地"
-- },
-- 高级技能 = {
--     "报复","冰冻三尺","沧海诀","炊金馔玉","春意盎然","大隐于朝","分花拂柳","风火燎原","扶伤","高级慈乌反哺","高级反哺之私","高级分裂攻击",
--     "高级强心术","高级清明术","高级脱困术","厚土诀","回源","吉人天相","金铭诀","枯木缠身","枯木逢春","朗月清风","礼之火叶神","烈火诀",
--     "妙手回春","木灵诀","牵制","春风拂面","取之有道","仁之木叶神","如人饮水","舍生取义","神出鬼没","鬼神莫测","视死如归","讨命",
--     "天地同寿","万籁俱寂","西天净土","信之土叶神","悬刃","遗患","义之金叶神","智之水叶神","进退自如"
-- },
-- 普通技能 = {
--     "自医","逐水东流","忠肝义胆","忠诚","忠不避危","帐饮东都","源泉万斛","隐身","以退为进","仙风道骨","万箭齐发","脱困术",
--     "天魔要诀","矢志不渝","神工鬼力","闪现","清明术","青面要诀","强心术","蹒跚","妙手仁心","灵逸","金刚不坏","寒木春华",
--     "劫火万丈","焦金流石","混乱","挥戈回日","赴汤蹈火","封印","分裂攻击","分光要诀","反哺之私","刀枪不入","寸土不让","慈乌反哺",
--     "朝云暮雨","草木俱朽","倍道兼行","怒仙","恨仙","大义","清风拂面","小楼要诀","炳若观火","金声玉润","软红香土","水到渠成"
-- },
-- 神兽技能 = {
--     "如虎添翼","强化遗患","强化悬刃","涅槃","精贯白日","潮鸣电挚","兵临城下"
-- },
