local t = {
    银索金铃 = { 名称 = '银索金铃', 阴阳 = 0, 称谓 = 0, lv = 8 },
    将军令 = { 名称 = '将军令', 阴阳 = 1, 称谓 = 1, lv = 16 },
    大势锤 = { 名称 = '大势锤', 阴阳 = 1, 称谓 = 2, lv = 24 },
    七宝玲珑塔 = { 名称 = '七宝玲珑塔', 阴阳 = 0, 称谓 = 3, lv = 32 },
    黑龙珠 = { 名称 = '黑龙珠', 阴阳 = 1, 称谓 = 4, lv = 40 },
    幽冥鬼手 = { 名称 = '幽冥鬼手', 阴阳 = 0, 称谓 = 5, lv = 48 },
    大手印 = { 名称 = '大手印', 阴阳 = 1, 称谓 = 6, lv = 56 },
    绝情鞭 = { 名称 = '绝情鞭', 阴阳 = 0, 称谓 = 7, lv = 64 },
    情网 = { 名称 = '情网', 阴阳 = 0, 称谓 = 8, lv = 72 },
    宝莲灯 = { 名称 = '宝莲灯', 阴阳 = 1, 称谓 = 9, lv = 80 },
    金箍儿 = { 名称 = '金箍儿', 阴阳 = 1, 称谓 = 10, lv = 88 },
    番天印 = { 名称 = '番天印', 阴阳 = 0, 称谓 = 11, lv = 96 },
    锦襕袈裟 = { 名称 = '锦襕袈裟', 阴阳 = 1, 称谓 = 12, lv = 104 },
    白骨爪 = { 名称 = '白骨爪', 阴阳 = 0, 称谓 = 13, lv = 112 },
    化蝶 = { 名称 = '化蝶', 阴阳 = 0, 称谓 = 14, lv = 120 },
}

return t
