local _ENV = require('数据库/装备属性_共用')


local _面具抗性范围 = { "抗混乱", "抗封印", "抗昏睡", "抗风", "抗火", "抗水", "抗雷"}
local _面具附加范围 = { "抗封印", "抗混乱", "抗昏睡", "速度", "抗风", "抗火", "抗水", "抗雷" }
local _佩饰面具抗性_通用 = {
    根骨 = { 6, 6, 6, 6, 6, 8, 8 },
    力量 = { 6, 6, 6, 6, 6, 8, 8 },
    灵性 = { 6, 6, 6, 6, 6, 8, 8 },
    敏捷 = { 6, 6, 6, 6, 6, 8, 8 },
    抗混乱 = { 16, 22, 27, 30, 33, 40, 42 },
    抗封印 = { 16, 22, 27, 30, 33, 40, 42 },
    抗昏睡 = { 16, 22, 27, 30, 33, 40, 42 },
    抗风 = { 19, 24, 31, 34, 37, 44, 46 },
    抗雷 = { 19, 24, 31, 34, 37, 44, 46 },
    抗水 = { 19, 24, 31, 34, 37, 44, 46 },
    抗火 = { 19, 24, 31, 34, 37, 44, 46 },
    附加攻击 = { 600, 800, 1000, 1200, 1400, 1600, 1800 },
    附加气血 = { 600, 1000, 1400, 1800, 2200, 2600, 3000 },
}
local _佩饰面具抗性_敏捷 = {
    根骨 = { 2, 2, 2, 2, 2, 4, 4 },
    力量 = { 2, 2, 2, 2, 2, 4, 4 },
    灵性 = { 2, 2, 2, 2, 2, 4, 4 },
    敏捷 = { 2, 2, 2, 2, 2, 4, 4 },
    抗混乱 = { 13, 18, 23, 28, 31, 38, 40 },
    抗封印 = { 13, 18, 23, 28, 31, 38, 40 },
    抗昏睡 = { 13, 18, 23, 28, 31, 38, 40 },
    抗风 = { 16, 22, 27, 30, 33, 40, 42 },
    抗火 = { 16, 22, 27, 30, 33, 40, 42 },
    抗水 = { 16, 22, 27, 30, 33, 40, 42 },
    抗雷 = { 16, 22, 27, 30, 33, 40, 42 },
    附加气血 = { 200, 400, 600, 800, 1000, 1200, 1400 },
}

local _面具属性_属性点 = {
    根骨 = { 6, 6, 6, 6, 6, 8, 8 },
    力量 = { 6, 6, 6, 6, 6, 8, 8 },
    灵性 = { 6, 6, 6, 6, 6, 8, 8 },
    敏捷 = { 2, 2, 2, 2, 2, 4, 4 }
}
local _面具属性_附加 = {
    抗昏睡 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
    抗封印 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
    抗混乱 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
    抗风 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
    抗火 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
    抗雷 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
    抗水 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
    速度 = { 17, 19, 21, 24, 27, 30, 33 },
}


local _面具名称 = {

    { '昆仑奴面具', '杀手头巾', '粉墨人生', '行军眼罩', '龙纹', '黑曜石冠', '琅琊梦断' },

    { '蝉翼纱巾', '梨花带雨', '花旦面具', '落梅妆', '鎏金额饰', '月牙梳', '半面妆' },

}


return {

    取佩饰等级需求 = function(级别)
        return 取佩饰等级需求(级别)
    end,
    取佩饰属性需求 = function(级别)
        return 取佩饰属性需求(级别)
    end,
    取基础属性 = function(级别, 属性要求)
        local list = {}
        local 属性 = 随机表(_属性范围)
        local n = _面具属性_属性点[属性要求][级别]
        table.insert(list, { 属性, n })
        if 属性要求 == "力量" then
            n = _佩饰面具抗性_通用.附加攻击[级别]
            table.insert(list, { "附加攻击", n })
        elseif 属性要求 == "敏捷" then
            n = _佩饰面具抗性_敏捷.附加气血[级别]
            table.insert(list, { "附加气血", n })
        else
            n = _佩饰面具抗性_通用.附加气血[级别]
            table.insert(list, { "附加气血", n })
        end
        属性 = _面具抗性范围[math.random(#_面具抗性范围)]
        if 属性要求 == "敏捷" then
            n = _佩饰面具抗性_敏捷[属性][级别]
        else
            n = _佩饰面具抗性_通用[属性][级别]
        end
        table.insert(list, { 属性, n })
        return list
    end,
    取附加抗性 = function(级别)
        local list = {}
        local 属性 = 随机表(_面具附加范围)
        local n = _面具属性_附加[属性][级别]
        if _整数范围[属性] then
            table.insert(list, { 属性, math.ceil(n * 0.01), n })
        else
            table.insert(list, { 属性, math.ceil(n * 0.1) * 0.1, n })
        end
        local 属性2 = 随机表(_面具附加范围)

        while 属性 == 属性2 do
            属性2 = 随机表(_面具附加范围)
        end
        n = _面具属性_附加[属性2][级别]
        if _整数范围[属性2] then
            table.insert(list, { 属性2, math.ceil(n * 0.01), n })
        else
            table.insert(list, { 属性2, math.ceil(n * 0.1) * 0.1, n })
        end
        return list
    end,
    取升级名称 = function(n, 性别)
        return _面具名称[性别][n]
    end,
    取升级属性 = function(t, 附加, 级别, 属性要求)
        local 基本属性 = {}
        local 附加属性 = {}
        local 属性类型 = t[1][1]
        local n = _面具属性_属性点[属性要求][级别]
        table.insert(基本属性, { 属性类型, n })
        if 属性要求 == "力量" then
            n = _佩饰面具抗性_通用.附加攻击[级别]
            table.insert(基本属性, { "附加攻击", n })
        elseif 属性要求 == "敏捷" then
            n = _佩饰面具抗性_敏捷.附加气血[级别]
            table.insert(基本属性, { "附加气血", n })
        else
            n = _佩饰面具抗性_通用.附加气血[级别]
            table.insert(基本属性, { "附加气血", n })
        end
        属性类型 = t[3][1]
        if 属性要求 == "敏捷" then
            n = _佩饰面具抗性_敏捷[属性类型][级别]
        else
            n = _佩饰面具抗性_通用[属性类型][级别]
        end
        table.insert(基本属性, { 属性类型, n })

        属性类型 = 附加[1][1]
        local n = _面具属性_附加[属性类型][级别]
        if _整数范围[属性类型] then
            table.insert(附加属性, { 属性类型, math.ceil(n * 0.01), n })
        else
            table.insert(附加属性, { 属性类型, math.ceil(n * 0.1) * 0.1, n })
        end

        属性类型 = 附加[2][1]
        local n = _面具属性_附加[属性类型][级别]
        if _整数范围[属性类型] then
            table.insert(附加属性, { 属性类型, math.ceil(n * 0.01), n })
        else
            table.insert(附加属性, { 属性类型, math.ceil(n * 0.1) * 0.1, n })
        end
        return 基本属性, 附加属性
    end,

    取升级佩饰等级需求 = function(级别, 属性要求)
        return 取升级佩饰等级需求(级别, 属性要求)
    end,
    取升级佩饰属性需求 = function(级别, 属性要求)
        return 取升级佩饰属性需求(级别, 属性要求)
    end,





}
