local _ENV = require('数据库/装备属性_共用')


--顺序1+附加气血/2附加魔法/3抗性 双加 有几率10%几率3附加 有1%4附加
local _挂件抗性范围 = { "抗混乱", "抗封印", "抗昏睡", "抗风", "抗水", "抗雷", "抗火" }
local _挂件附加范围 = { "抗混乱", "抗封印", "抗昏睡", "抗风", "抗水", "抗雷", "抗火", "速度" }
local _挂件抗性_通用 = {
    抗混乱 = { 16, 22, 27, 30, 33, 40, 42 },
    抗封印 = { 16, 22, 27, 30, 33, 40, 42 },
    抗昏睡 = { 16, 22, 27, 30, 33, 40, 42 },
    抗风 = { 19, 24, 31, 34, 37, 44, 46 },
    抗雷 = { 19, 24, 31, 34, 37, 44, 46 },
    抗水 = { 19, 24, 31, 34, 37, 44, 46 },
    抗火 = { 19, 24, 31, 34, 37, 44, 46 },
    附加气血 = { 600, 1000, 1400, 1800, 2200, 2600, 3000 }, --已修改
    附加魔法 = { 600, 1000, 1400, 1800, 2200, 2600, 3000 }, --已修改
}
local _挂件抗性_敏捷 = {
    抗混乱 = { 16, 22, 27, 30, 33, 40, 42 },
    抗封印 = { 16, 22, 27, 30, 33, 40, 42 },
    抗昏睡 = { 16, 22, 27, 30, 33, 40, 42 },
    抗风 = { 19, 24, 31, 34, 37, 44, 46 },
    抗雷 = { 19, 24, 31, 34, 37, 44, 46 },
    抗水 = { 19, 24, 31, 34, 37, 44, 46 },
    抗火 = { 19, 24, 31, 34, 37, 44, 46 },
    附加气血 = { 600, 1000, 1400, 1800, 2200, 2600, 3000 }, --已修改
    附加魔法 = { 600, 1000, 1400, 1800, 2200, 2600, 3000 }, --已修改
}

local _挂件属性_附加 = {
    抗昏睡 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 }, --已修改
    抗封印 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 }, --已修改
    抗混乱 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 }, --已修改
    抗风 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 }, --已修改
    抗水 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 }, --已修改
    抗火 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 }, --已修改
    抗雷 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 }, --已修改
    速度 = { 17, 19, 21, 24, 27, 30, 33 }, ----已修改

}

local _挂件名称 = { '水苍玉佩', '怀梦香囊', '黄琅如意', '落雪风铃', '流景扬辉', '霁月古镜', '伽蓝碎雨' }

return {
    取佩饰等级需求 = function(级别)
        return 取佩饰等级需求(级别)
    end,
    取佩饰属性需求 = function(级别)
        return 取佩饰属性需求(级别)
    end,
    取基础属性 = function(级别, 属性要求)
        local list = {}
        local 属性 = "附加气血"
        local n = _挂件抗性_通用.附加气血[级别]
        table.insert(list, { 属性, n })
        属性 = "附加魔法"
        n = _挂件抗性_通用.附加魔法[级别]
        table.insert(list, { 属性, n })
        属性 = _挂件抗性范围[math.random(#_挂件抗性范围)]

        if 属性要求 == "敏捷" then
            n = _挂件抗性_敏捷[属性][级别]
        else
            n = _挂件抗性_通用[属性][级别]
        end
        table.insert(list, { 属性, n })
        return list
    end,
    取附加抗性 = function(级别)
        local list = {}
        local 属性 = 随机表(_挂件附加范围)
        local n = _挂件属性_附加[属性][级别]
        if _整数范围[属性] then
            table.insert(list, { 属性, math.ceil(n * 0.01), n })
        else
            table.insert(list, { 属性, math.ceil(n * 0.1) * 0.1, n })
        end
        local 属性2 = 随机表(_挂件附加范围)

        while 属性 == 属性2 do
            属性2 = 随机表(_挂件附加范围)
        end
        n = _挂件属性_附加[属性2][级别]
        if _整数范围[属性2] then
            table.insert(list, { 属性2, math.ceil(n * 0.01), n })
        else
            table.insert(list, { 属性2, math.ceil(n * 0.1) * 0.1, n })
        end
        return list
    end,
    取升级名称 = function(n, 性别)
        return _挂件名称[n]
    end,
    取升级佩饰等级需求 = function(级别, 属性要求)
        return 取升级佩饰等级需求(级别, 属性要求)
    end,
    取升级佩饰属性需求 = function(级别, 属性要求)
        return 取升级佩饰属性需求(级别, 属性要求)
    end,

    取升级属性 = function(t, 附加, 级别, 属性要求)
        local 基本属性 = {}
        local 附加属性 = {}
        local 属性 = "附加气血"
        local n = _挂件抗性_通用.附加气血[级别]
        table.insert(基本属性, { "附加气血", n })
        属性 = "附加魔法"
        n = _挂件抗性_通用.附加魔法[级别]
        table.insert(基本属性, { "附加魔法", n })
        属性 = t[3][1]
        if 属性要求 == "敏捷" then
            n = _挂件抗性_敏捷[属性][级别]
        else
            n = _挂件抗性_通用[属性][级别]
        end
        table.insert(基本属性, { 属性, n })

        属性 = 附加[1][1]
        local n = _挂件属性_附加[属性][级别]
        if _整数范围[属性] then
            table.insert(附加属性, { 属性, math.ceil(n * 0.01), n })
        else
            table.insert(附加属性, { 属性, math.ceil(n * 0.1) * 0.1, n })
        end
        属性 = 附加[2][1]
        local n = _挂件属性_附加[属性][级别]
        if _整数范围[属性] then
            table.insert(附加属性, { 属性, math.ceil(n * 0.01), n })
        else
            table.insert(附加属性, { 属性, math.ceil(n * 0.1) * 0.1, n })
        end


        return 基本属性, 附加属性
    end,








}
