local _ENV = require('数据库/装备属性_共用')

local _腰带抗性范围 = { "抗风", "抗火", "抗水", "抗雷" }
local _腰带附加范围 = {  "抗封印", "抗混乱", "抗昏睡", "抗风", "抗火", "抗水", "抗雷", "抗震慑", "速度" }
local _腰带抗性_通用 = {
    根骨 = { 6, 6, 6, 6, 6, 8, 8 },
    力量 = { 6, 6, 6, 6, 6, 8, 8 },
    灵性 = { 6, 6, 6, 6, 6, 8, 8 },
    敏捷 = { 6, 6, 6, 6, 6, 8, 8 },
    抗风 = { 19, 24, 31, 34, 37, 44, 46 },
    抗雷 = { 19, 24, 31, 34, 37, 44, 46 },
    抗水 = { 19, 24, 31, 34, 37, 44, 46 },
    抗火 = { 19, 24, 31, 34, 37, 44, 46 },
    附加气血 = { 600, 1000, 1400, 1800, 2200, 2600, 3000 },
    附加攻击 = { 600, 800, 1000, 1200, 1400, 1800, 2000 }, --已修改
}
local _腰带抗性_敏捷 = {
    根骨 = { 2, 2, 2, 2, 2, 4, 4 },
    力量 = { 2, 2, 2, 2, 2, 4, 4 },
    灵性 = { 2, 2, 2, 2, 2, 4, 4 },
    敏捷 = { 2, 2, 2, 2, 2, 4, 4 },
    抗风 = { 16, 22, 27, 30, 33, 40, 42 },
    抗火 = { 16, 22, 27, 30, 33, 40, 42 },
    抗水 = { 16, 22, 27, 30, 33, 40, 42 },
    抗雷 = { 16, 22, 27, 30, 33, 40, 42 },
}

local _腰带属性_属性点 = {
    根骨 = { 6, 6, 6, 6, 6, 8, 8 },
    力量 = { 6, 6, 6, 6, 6, 8, 8 },
    灵性 = { 6, 6, 6, 6, 6, 8, 8 },
    敏捷 = { 2, 2, 2, 2, 2, 4, 4 }
}
local _腰带属性_附加 = {
    速度 = { 17, 19, 21, 24, 27, 30, 33 }, -- 已修改
    抗昏睡 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
    抗封印 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
    抗混乱 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
    抗风 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
    抗火 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
    抗雷 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
    抗水 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
    抗震慑 = { 0.1, 0.3,0.4, 0.5, 0.8, 1.3, 1.5 },
}

if __config.种族 ==  4 or __config.种族 == 4.1 then
    _腰带抗性范围 = { "抗风", "抗火", "抗水", "抗雷", "抗遗忘", "抗鬼火" }
    _腰带附加范围 = { "抗封印",  "抗混乱", "抗昏睡", "抗风", "抗火", "抗水", "抗雷", "速度", "抗震慑", "抗遗忘" }
    _腰带抗性_通用 = {
        根骨 = { 6, 6, 6, 6, 6, 8, 8 },
        力量 = { 6, 6, 6, 6, 6, 8, 8 },
        灵性 = { 6, 6, 6, 6, 6, 8, 8 },
        敏捷 = { 6, 6, 6, 6, 6, 8, 8 },
        抗风 = { 19, 24, 31, 34, 37, 44, 46 },
        抗雷 = { 19, 24, 31, 34, 37, 44, 46 },
        抗水 = { 19, 24, 31, 34, 37, 44, 46 },
        抗火 = { 19, 24, 31, 34, 37, 44, 46 },
        抗遗忘 = { 16, 22, 27, 30, 33, 40, 42 },
        抗鬼火 = { 19, 24, 31, 34, 37, 44, 46 },
        附加气血 = { 600, 1000, 1400, 1800, 2200, 2600, 3000 },
        附加攻击 = { 600, 800, 1000, 1200, 1400, 1800, 2000 }, --已修改
    }
    _腰带抗性_敏捷 = {
        根骨 = { 2, 2, 2, 2, 2, 4, 4 },
        力量 = { 2, 2, 2, 2, 2, 4, 4 },
        灵性 = { 2, 2, 2, 2, 2, 4, 4 },
        敏捷 = { 2, 2, 2, 2, 2, 4, 4 },
        抗风 = { 16, 22, 27, 30, 33, 40, 42 },
        抗火 = { 16, 22, 27, 30, 33, 40, 42 },
        抗水 = { 16, 22, 27, 30, 33, 40, 42 },
        抗雷 = { 16, 22, 27, 30, 33, 40, 42 },
        抗遗忘 = { 13, 18, 23, 28, 31, 38, 40 },
        抗鬼火 = { 16, 22, 27, 30, 33, 40, 42 },
    }

    _腰带属性_属性点 = {
        根骨 = { 6, 6, 6, 6, 6, 8, 8 },
        力量 = { 6, 6, 6, 6, 6, 8, 8 },
        灵性 = { 6, 6, 6, 6, 6, 8, 8 },
        敏捷 = { 2, 2, 2, 2, 2, 4, 4 }
    }
    _腰带属性_附加 = {
        速度 = { 17, 19, 21, 24, 27, 30, 33 }, ----已修改
        抗昏睡 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
        抗封印 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
        抗混乱 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
        抗风 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
        抗火 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
        抗雷 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
        抗水 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 },
        抗震慑 = { 2.4, 3.4, 4.8, 5.9, 6.8, 7.6, 8.3 }, --已修改
        抗遗忘 = { 4.2, 5.9, 8.3, 10.1, 11.7, 13, 14.3 }, --已修改
    }
end

local _腰带名称 = { '流纨束带', '辟邪腰带', '辟寒犀带', '月影犀带', '黄琅腰带', '星辰之约', '祥云流带' }

return {
    取佩饰等级需求 = function(级别)
        return 取佩饰等级需求(级别)
    end,
    取佩饰属性需求 = function(级别)
        return 取佩饰属性需求(级别)
    end,
    取基础属性 = function(级别, 属性要求)
        local list = {}
        local 属性 = 随机表(_属性范围)
        local n = _腰带属性_属性点[属性要求][级别]
        table.insert(list, { 属性, n })
        if 属性要求 == "力量" then
            n = _腰带抗性_通用.附加攻击[级别]
            table.insert(list, { "附加攻击", n })
        elseif 属性要求 == "敏捷" then
        else
            n = _腰带抗性_通用.附加气血[级别]
            table.insert(list, { "附加气血", n })
        end
        属性 = _腰带抗性范围[math.random(#_腰带抗性范围)]
        if 属性要求 == "敏捷" then
            n = _腰带抗性_敏捷[属性][级别]
        else
            n = _腰带抗性_通用[属性][级别]
        end
        table.insert(list, { 属性, n })
        return list
    end,

    取附加抗性 = function(级别)
        local list = {}
        local 属性 = 随机表(_腰带附加范围)
        local n = _腰带属性_附加[属性][级别]
        if _整数范围[属性] then
            table.insert(list, { 属性, math.ceil(n * 0.01), n })
        else
            table.insert(list, { 属性, math.ceil(n * 0.1) * 0.1, n })
        end
        local 属性2 = 随机表(_腰带附加范围)

        while 属性 == 属性2 do
            属性2 = 随机表(_腰带附加范围)
        end
        n = _腰带属性_附加[属性2][级别]
        if _整数范围[属性2] then
            table.insert(list, { 属性2, math.ceil(n * 0.01), n })
        else
            table.insert(list, { 属性2, math.ceil(n * 0.1) * 0.1, n })
        end
        return list
    end,
    取升级名称 = function(n, 性别)
        return _腰带名称[n]
    end,
    取升级佩饰等级需求 = function(级别, 属性要求)
        return 取升级佩饰等级需求(级别, 属性要求)
    end,
    取升级佩饰属性需求 = function(级别, 属性要求)
        return 取升级佩饰属性需求(级别, 属性要求)
    end,
    取升级属性 = function(t, 附加, 级别, 属性要求)
        local 基本属性 = {}
        local 附加属性 = {}
        local 属性 = t[1][1]
        local n = _腰带属性_属性点[属性要求][级别]
        table.insert(基本属性, { 属性, n })

        属性 = t[2][1]
        if 属性要求 == "力量" then
            n = _腰带抗性_通用.附加攻击[级别]
            table.insert(基本属性, { "附加攻击", n })
        elseif 属性要求 == "敏捷" then
        else
            n = _腰带抗性_通用.附加气血[级别]
            table.insert(基本属性, { "附加气血", n })
        end

        属性类型 = t[3][1]
        if 属性要求 == "敏捷" then
            n = _腰带抗性_敏捷[属性类型][级别]
        else
            n = _腰带抗性_通用[属性类型][级别]
        end
        table.insert(基本属性, { 属性类型, n })


        属性 = 附加[1][1]
        local n = _腰带属性_附加[属性][级别]
        if _整数范围[属性] then
            table.insert(附加属性, { 属性, math.ceil(n * 0.01), n })
        else
            table.insert(附加属性, { 属性, math.ceil(n * 0.1) * 0.1, n })
        end
        属性 = 附加[2][1]
        local n = _腰带属性_附加[属性][级别]
        if _整数范围[属性] then
            table.insert(附加属性, { 属性, math.ceil(n * 0.01), n })
        else
            table.insert(附加属性, { 属性, math.ceil(n * 0.1) * 0.1, n })
        end


        return 基本属性, 附加属性
    end,

}