local _ENV = setmetatable({}, { __index = _G })
基本信息 = {
    [1] = { 名称 = '逍遥生', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
    [2] = { 名称 = '剑侠客', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
    [3] = { 名称 = '猛壮士', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
    [4] = { 名称 = '俏千金', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
    [5] = { 名称 = '飞燕女', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
    [6] = { 名称 = '英女侠', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
    --魔
    [7] = { 名称 = '巨魔王', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
    [8] = { 名称 = '夺命妖', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
    [9] = { 名称 = '虎头怪', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
    [10] = { 名称 = '狐美人', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
    [11] = { 名称 = '骨精灵', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
    [12] = { 名称 = '小蛮妖', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
    --仙
    [13] = { 名称 = '神天兵', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
    [14] = { 名称 = '龙战将', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
    [15] = { 名称 = '智圣仙', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
    [16] = { 名称 = '舞天姬', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } },
    [17] = { 名称 = '精灵仙', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } },
    [18] = { 名称 = '玄剑娥', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } },
    ----1转
    [40] = { 名称 = '飞剑侠', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
    [41] = { 名称 = '燕山雪', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
    [42] = { 名称 = '逆天魔', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
    [43] = { 名称 = '媚灵狐', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
    [44] = { 名称 = '武尊神', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
    [45] = { 名称 = '玄天姬', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } },
    ---2转
    [50] = { 名称 = '纯阳子', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
    [51] = { 名称 = '红拂女', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
    [52] = { 名称 = '混天魔', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
    [53] = { 名称 = '九尾狐', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
    [54] = { 名称 = '紫薇神', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
    [55] = { 名称 = '霓裳仙', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } }
}

if __config.种族 ==  4 or __config.种族 == 4.1 then
    基本信息 = {
        [1] = { 名称 = '逍遥生', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
        [2] = { 名称 = '剑侠客', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
        [3] = { 名称 = '猛壮士', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
        [4] = { 名称 = '俏千金', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
        [5] = { 名称 = '飞燕女', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
        [6] = { 名称 = '英女侠', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
        -- 魔
        [7] = { 名称 = '巨魔王', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
        [8] = { 名称 = '夺命妖', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
        [9] = { 名称 = '虎头怪', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
        [10] = { 名称 = '狐美人', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
        [11] = { 名称 = '骨精灵', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
        [12] = { 名称 = '小蛮妖', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
        -- 仙
        [13] = { 名称 = '神天兵', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
        [14] = { 名称 = '龙战将', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
        [15] = { 名称 = '智圣仙', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
        [16] = { 名称 = '舞天姬', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } },
        [17] = { 名称 = '精灵仙', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } },
        [18] = { 名称 = '玄剑娥', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } },
        -- 鬼
        [60] = { 名称 = '猎魂引', 性别 = 1, 种族 = 4, 门派 = { '白骨洞', '阴都', '三尸派' } },
        [61] = { 名称 = '无涯子', 性别 = 1, 种族 = 4, 门派 = { '白骨洞', '阴都', '三尸派' } },
        [62] = { 名称 = '祭剑魂', 性别 = 1, 种族 = 4, 门派 = { '白骨洞', '阴都', '三尸派' } },
        [63] = { 名称 = '夜溪灵', 性别 = 2, 种族 = 4, 门派 = { '白骨洞', '阴都', '兰若寺' } },
        [64] = { 名称 = '幽梦影', 性别 = 2, 种族 = 4, 门派 = { '白骨洞', '阴都', '兰若寺' } },
        [65] = { 名称 = '墨衣行', 性别 = 2, 种族 = 4, 门派 = { '白骨洞', '阴都', '兰若寺' } },
        -- 1转
        [40] = { 名称 = '飞剑侠', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
        [41] = { 名称 = '燕山雪', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
        [42] = { 名称 = '逆天魔', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
        [43] = { 名称 = '媚灵狐', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
        [44] = { 名称 = '武尊神', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
        [45] = { 名称 = '玄天姬', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } },
        -- 2转
        [50] = { 名称 = '纯阳子', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
        [51] = { 名称 = '红拂女', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
        [52] = { 名称 = '混天魔', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
        [53] = { 名称 = '九尾狐', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
        [54] = { 名称 = '紫薇神', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
        [55] = { 名称 = '霓裳仙', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } }
    }
end

local list = {}
for k, v in pairs(基本信息) do
    v.外形 = k
    table.insert(list, v)
end

for i, v in ipairs(list) do
    基本信息[v.名称] = v
end

门派技能 = {
    方寸山 = { '催眠咒', '瞌睡咒', '离魂咒', '迷魂醉', '百日眠' },
    化生寺 = { '反间之计', '情真意切', '谗言相加', '借刀杀人', '失心狂乱' },
    程府 = { '作茧自缚', '金蛇缠丝', '天罗地网', '作壁上观', '四面楚歌' },
    女儿村 = { '蛇蝎美人', '追魂迷香', '断肠烈散', '鹤顶红粉', '万毒攻心' },
    天宫 = { '雷霆霹雳', '日照光华', '雷神怒击', '电闪雷鸣', '天诛地灭' },
    龙宫 = { '龙卷雨击', '龙腾水溅', '龙啸九天', '蛟龙出海', '九龙冰封' },
    五庄观 = { '飞砂走石', '乘风破浪', '太乙生风', '风雷涌动', '袖里乾坤' },
    普陀山 = { '地狱烈火', '天雷怒火', '三味真火', '烈火骄阳', '九阴纯火' },
    魔王寨 = { '妖之魔力', '力神复苏', '狮王之怒', '兽王神力', '魔神附身' },
    地府 = { '夺命勾魂', '追神摄魄', '魔音摄心', '销魂蚀骨', '阎罗追命' },
    盘丝洞 = { '红袖添香', '莲步轻舞', '楚楚可怜', '魔神护体', '含情脉脉' },
    狮驼岭 = { '魔之飞步', '急速之魔', '魔神飞舞', '天外飞魔', '乾坤借速' },
    白骨洞 = { '幽冥鬼火', '火影迷踪', '冥烟销骨', '落日熔金', '血海深仇' },
    阴都 = { '麻沸散', '鬼失惊', '乱魂钉', '失心疯', '孟婆汤' },
    三尸派 = { '吸血水蛭', '六翅毒蝉', '啮骨抽髓', '血煞之蛊', '吸星大法' },
    兰若寺 = { '幽怜魅影', '醉生梦死', '一曲销魂', '秦丝冰雾', '倩女幽魂' }
}

种族称谓 = {
    { '武林新丁', '江湖小虾', '后起之秀', '武林高手', '风尘奇侠', '无双隐士', '世外高人', '江湖侠隐', '无敌圣者', '三界贤君', '夕阳武士', '神通广大', '变化无穷', '火眼金睛' },
    { '古灵精怪', '魅力精灵', '魔幻使者', '妖之奇葩', '天神煞星', '万兽妖灵', '混世魔王', '三界妖仙', '魔神至尊', '齐天妖王', '夕阳武士', '神通广大', '变化无穷', '火眼金睛' },
    { '仙灵小童', '逍遥之仙', '陆地飞仙', '无极天师', '神机真人', '降魔金仙', '金身尊者', '天外飞仙', '万圣天尊', '九天圣佛', '夕阳武士', '神通广大', '变化无穷', '火眼金睛' },
    { '阴曹小鬼', '飘渺之魂', '幽冥鬼士', '勾魂使者', '催命判官', '阴阳无常', '阎罗鬼王', '冥灵鬼仙', '九幽神君', '阴都大帝', '夕阳武士', '神通广大', '变化无穷', '火眼金睛' }
}





return _ENV
--[[
                人物 --0转57, 246, 48 --1转250,120,20--2转0,255,255--3转178,34,34, 飞升120,0,172
               召唤兽 --0转250,120,20 --1转238,130,238--2转147,112,219--3转0,0,205 飞升120,0,172


              ]]
-- race_info: { 1: "人", 2: "魔", 3: "仙", 4: "鬼", 5: "龙" },
-- race_types: {
--   1001: "男人",
--   1002: "男魔",
--   1003: "男仙",
--   1004: "男鬼",
--   1005: "男龙",
--   2001: "女人",
--   2002: "女魔",
--   2003: "女仙",
--   2004: "女鬼",
--   2005: "女龙",
-- },
-- role_types: [
--     [64, "幽梦影", 2, 2004, 36],
--     [40, "飞剑侠", 1, 1001, 4],
--     [41, "燕山雪", 2, 2001, 9],
--     [145, "莫解语", 2, 2005, 49],
--     [154, "临九渊", 2, 2005, 52],
--     [63, "夜溪灵", 2, 2004, 34],
--     [77, "云中君", 2, 2003, 42],
--     [62, "祭剑魂", 1, 1004, 33],
--     [54, "紫薇神", 1, 1003, 25],
--     [72, "神秀生", 1, 1001, 37],
--     [6, "英女侠", 2, 2001, 7],
--     [76, "青阳使", 1, 1003, 41],
--     [4, "俏千金", 2, 2001, 8],
--     [1, "逍遥生", 1, 1001, 1],
--     [51, "红拂女", 2, 2001, 10],
--     [43, "媚灵狐", 2, 2002, 19],
--     [11, "骨精灵", 2, 2002, 18],
--     [74, "绝影魔", 1, 1002, 39],
--     [42, "逆天魔", 1, 1002, 14],
--     [53, "九尾狐", 2, 2002, 20],
--     [50, "纯阳子", 1, 1001, 5],
--     [8, "夺命妖", 1, 1002, 13],
--     [60, "猎魂引", 1, 1004, 32],
--     [13, "神天兵", 1, 1003, 21],
--     [9, "虎头怪", 1, 1002, 11],
--     [143, "忘忧子", 1, 1005, 47],
--     [61, "无涯子", 1, 1004, 31],
--     [45, "玄天姬", 2, 2003, 29],
--     [10, "狐美人", 2, 2002, 16],
--     [55, "霓裳仙", 2, 2003, 30],
--     [141, "沧浪君", 1, 1005, 45],
--     [146, "骊珠儿", 2, 2005, 50],
--     [7, "巨魔王", 1, 1002, 12],
--     [142, "龙渊客", 1, 1005, 46],
--     [78, "南冠客", 1, 1004, 43],
--     [3, "猛壮士", 1, 1001, 3],
--     [79, "镜花影", 2, 2004, 44],
--     [144, "木兰行", 2, 2005, 48],
--     [2, "剑侠客", 1, 1001, 2],
--     [153, "游无极", 1, 1005, 51],
--     [12, "小蛮妖", 2, 2002, 17],
--     [5, "飞燕女", 2, 2001, 6],
--     [65, "墨衣行", 2, 2004, 35],
--     [75, "霜月灵", 2, 2002, 40],
--     [73, "玲珑女", 2, 2001, 38],
--     [18, "玄剑娥", 2, 2003, 27],
--     [52, "混天魔", 1, 1002, 15],
--     [44, "武尊神", 1, 1003, 24],
--     [16, "舞天姬", 2, 2003, 26],
--     [17, "精灵仙", 2, 2003, 28],
--     [14, "龙战将", 1, 1003, 23],
--     [15, "智圣仙", 1, 1003, 22],
--   ],
