-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2023-07-18 00:33:41
-- @Last Modified time  : 2023-07-20 10:36:09

local 战斗 = {}

local _名称 = {
    '地狗星', '地英星', '地奇星', '地猛星', '地平星', '地会星', '地佐星', '地灵星', '地兽星', '地幽星',
    '地捷星', '地镇星', '地稽星', '地异星', '地退星', '地满星', '地遂星', '地理星', '地微星', '地全星',
    '地短星', '地角星', '地丑星', '地数星', '地阴星', '地刑星', '地壮星', '地嵇星', '地明星', '地乐星',
    '地慧星', '地俊星', '地空星', '地孤星', '地佑星', '地耗星', '地贼星', '地伏星', '地暴星', '地正星',
    '地强星', '地奴星', '地察星', '地隐星', '地巧星', '地飞星', '地默星', '地文星', '地然星', '地彗星',
}

local _怪物 = {
    强混 = {
        名称 = function()
            return _名称[math.random(#_名称)]
        end,
        外形 = function(等级, 转生)
            return 随机种族模型('男人', 转生)
        end,
        等级 = 100,
        气血 = 2200000,
        魔法 = 640000,
        攻击 = 14400,
        速度 = 700,
        抗性 = {
            抗混乱 = 104,
            抗封印 = 104,
            抗昏睡 = 104,
            抗中毒 = 44,
            抗风 = 37.5,
            抗火 = 37.5,
            抗水 = 37.5,
            抗雷 = 37.5,
            加强混乱 = 10,
            加强封印 = 10,
            加强昏睡 = 10,
            忽视抗混 = 5,
            忽视抗印 = 5,
            忽视抗睡 = 5,
            加强毒 = 46,
            忽视抗毒 = 28,
            抗震慑 = 11,
            物理吸收 = 57.5,
            躲闪率 = 27.5,
        },
        技能 = {
            { 名称 = "借刀杀人", 熟练度 = 12000 },
            { 名称 = "失心狂乱", 熟练度 = 12000 },
        },
        施法几率 = 100,
        是否消失 = false,
    },
    强毒 = {
        名称 = function()
            return _名称[math.random(#_名称)]
        end,
        外形 = function(等级, 转生)
            return 随机种族模型('女人', 转生)
        end,
        等级 = 100,
        气血 = 2200000,
        魔法 = 640000,
        攻击 = 14400,
        速度 = 600,
        抗性 = {
            抗混乱 = 104,
            抗封印 = 104,
            抗昏睡 = 104,
            抗中毒 = 44,
            抗风 = 37.5,
            抗火 = 37.5,
            抗水 = 37.5,
            抗雷 = 37.5,
            加强混乱 = 10,
            加强封印 = 10,
            加强昏睡 = 10,
            忽视抗混 = 5,
            忽视抗印 = 5,
            忽视抗睡 = 5,
            加强毒 = 46,
            忽视抗毒 = 28,
            抗震慑 = 11,
            物理吸收 = 57.5,
            躲闪率 = 27.5,
        },
        技能 = {
            { 名称 = "鹤顶红粉", 熟练度 = 12000 },
            { 名称 = "万毒攻心", 熟练度 = 12000 },
        },
        施法几率 = 100,
        是否消失 = false,
    },
    冰睡 = {
        名称 = function()
            return _名称[math.random(#_名称)]
        end,
        外形 = function(等级, 转生)
            return 随机种族模型('人族', 转生)
        end,
        等级 = 100,
        气血 = 2200000,
        魔法 = 640000,
        攻击 = 14400,
        速度 = 700,
        抗性 = {
            抗混乱 = 104,
            抗封印 = 104,
            抗昏睡 = 104,
            抗中毒 = 44,
            抗风 = 37.5,
            抗火 = 37.5,
            抗水 = 37.5,
            抗雷 = 37.5,
            加强混乱 = 10,
            加强封印 = 10,
            加强昏睡 = 10,
            忽视抗混 = 5,
            忽视抗印 = 5,
            忽视抗睡 = 5,
            加强毒 = 46,
            忽视抗毒 = 28,
            抗震慑 = 11,
            物理吸收 = 57.5,
            躲闪率 = 27.5,
        },
        技能 = {
            { 名称 = "迷魂醉", 熟练度 = 12000 },
            { 名称 = "百日眠", 熟练度 = 12000 },
            { 名称 = "作壁上观", 熟练度 = 12000 },
            { 名称 = "四面楚歌", 熟练度 = 12000 },
        },
        施法几率 = 100,
        是否消失 = false,
    },
    男魔 = {
        名称 = function()
            return _名称[math.random(#_名称)]
        end,
        外形 = function(等级, 转生)
            return 随机种族模型('男魔', 转生)
        end,
        等级 = 100,
        气血 = 1800000,
        魔法 = 480000,
        攻击 = 37600,
        速度 = 1350,
        抗性 = {
            抗混乱 = 76,
            抗封印 = 76,
            抗昏睡 = 76,
            抗风 = 45,
            抗火 = 45,
            抗水 = 45,
            抗雷 = 45,
            致命几率 = 5,
            狂暴几率 = 5,
            连击率 = 35,
            连击次数 = 4,
            附加震慑攻击 = 60,
            抗震慑 = 16,
            物理吸收 = 60,
        },
        技能 = {
            { 名称 = "魔神附身", 熟练度 = 12000 },
            { 名称 = "乾坤借速", 熟练度 = 12000 },
            { 名称 = "阎罗追命", 熟练度 = 12000 },
        },
        施法几率 = 50,
        是否消失 = false,
    },
    女魔 = {
        名称 = function()
            return _名称[math.random(#_名称)]
        end,
        外形 = function(等级, 转生)
            return 随机种族模型('女魔', 转生)
        end,
        等级 = 100,
        气血 = 1800000,
        魔法 = 480000,
        攻击 = 37600,
        速度 = 1250,
        抗性 = {
            抗混乱 = 76,
            抗封印 = 76,
            抗昏睡 = 76,
            抗风 = 45,
            抗火 = 45,
            抗水 = 45,
            抗雷 = 45,
            致命几率 = 5,
            狂暴几率 = 5,
            连击率 = 35,
            连击次数 = 4,
            附加震慑攻击 = 60,
            抗震慑 = 16,
            物理吸收 = 60,
        },
        技能 = {
            { 名称 = "魔神附身", 熟练度 = 12000 },
            { 名称 = "含情脉脉", 熟练度 = 12000 },
            { 名称 = "阎罗追命", 熟练度 = 12000 },
        },
        施法几率 = 50,
        是否消失 = false,
    },
    大力 = {
        名称 = function()
            return _名称[math.random(#_名称)]
        end,
        外形 = function(等级, 转生)
            return 随机种族模型('魔族', 转生)
        end,
        等级 = 100,
        气血 = 2400000,
        魔法 = 480000,
        攻击 = 75780,
        速度 = 500,
        抗性 = {
            抗混乱 = 86,
            抗封印 = 86,
            抗昏睡 = 86,
            抗风 = 45,
            抗火 = 45,
            抗水 = 45,
            抗雷 = 45,
            致命几率 = 22.5,
            狂暴几率 = 35,
            连击率 = 35,
            连击次数 = 4,
            反击率 = 35,
            反击次数 = 4,
            忽视防御几率 = 100,
            忽视防御程度 = 70,
            抗震慑 = 16,
            物理吸收 = 70,
        },
        是否消失 = false,
    },
    男仙 = {
        名称 = function()
            return _名称[math.random(#_名称)]
        end,
        外形 = function(等级, 转生)
            return 随机种族模型('男仙', 转生)
        end,
        等级 = 100,
        气血 = 1400000,
        魔法 = 3000000,
        攻击 = 12600,
        速度 = 980,
        抗性 = {
            抗混乱 = 76,
            抗封印 = 76,
            抗昏睡 = 76,
            抗风 = 90,
            抗火 = 90,
            抗水 = 90,
            抗雷 = 90,
            加强雷 = 48,
            加强火 = 48,
            加强风 = 48,
            加强水 = 48,
            忽视抗雷 = 30,
            忽视抗火 = 30,
            忽视抗风 = 30,
            忽视抗水 = 30,
            雷系狂暴几率 = 24,
            火系狂暴几率 = 24,
            风系狂暴几率 = 24,
            水系狂暴几率 = 24,
            雷系狂暴程度 = 42,
            火系狂暴程度 = 42,
            风系狂暴程度 = 42,
            水系狂暴程度 = 42,
            抗震慑 = 12,
            躲闪率 = 60,
            物理吸收 = 45,
        },
        技能 = {
            { 名称 = "天诛地灭", 熟练度 = 12000 },
            { 名称 = "九龙冰封", 熟练度 = 12000 },
            { 名称 = "袖里乾坤", 熟练度 = 12000 },
        },
        施法几率 = 100,
        是否消失 = false,
    },
    女仙 = {
        名称 = function()
            return _名称[math.random(#_名称)]
        end,
        外形 = function(等级, 转生)
            return 随机种族模型('女仙', 转生)
        end,
        等级 = 100,
        气血 = 1400000,
        魔法 = 3000000,
        攻击 = 12600,
        速度 = 980,
        抗性 = {
            抗混乱 = 76,
            抗封印 = 76,
            抗昏睡 = 76,
            抗风 = 90,
            抗火 = 90,
            抗水 = 90,
            抗雷 = 90,
            加强雷 = 48,
            加强火 = 48,
            加强风 = 48,
            加强水 = 48,
            忽视抗雷 = 30,
            忽视抗火 = 30,
            忽视抗风 = 30,
            忽视抗水 = 30,
            雷系狂暴几率 = 24,
            火系狂暴几率 = 24,
            风系狂暴几率 = 24,
            水系狂暴几率 = 24,
            雷系狂暴程度 = 42,
            火系狂暴程度 = 42,
            风系狂暴程度 = 42,
            水系狂暴程度 = 42,
            抗震慑 = 12,
            躲闪率 = 60,
            物理吸收 = 45,
        },
        技能 = {
            { 名称 = "天诛地灭", 熟练度 = 12000 },
            { 名称 = "九龙冰封", 熟练度 = 12000 },
            { 名称 = "九阴纯火", 熟练度 = 12000 },
        },
        施法几率 = 100,
        是否消失 = false,
    },
}

local _类型 = {
    '强混', '强毒', '冰睡', '男魔', '女魔', '大力', '男仙', '女仙'
}

function 战斗:战斗初始化(玩家, NPC)
    local 转生 = 1
    local 等级 = 100
    local list = {}
    for i = 1, 8 do
        local v = _怪物[_类型[math.random(#_类型)]]
        table.insert(list, v)
    end
    for i, v in ipairs(list) do
        local t = {}
        for k, s in pairs(v) do
            if type(s) == "function" then
                t[k] = s(等级, 转生)
            else
                t[k] = s
            end
        end
        if i == 1 then
            t.名称 = NPC.名称
        end
        local r = 生成战斗怪物(t)
        self:加入敌方(i, r)
    end
end

function 战斗:战斗回合开始(v)
end

function 战斗:战斗回合结束(v)
end

function 战斗:战斗开始(v)
end

function 战斗:战斗结束(s)
end

return 战斗