
local 战斗 = {
    是否惩罚 = false --死亡
}
local _技能组 = {

    {
        { 名称 = "失心狂乱", 熟练度 = 12000 },
        { 名称 = "借刀杀人", 熟练度 = 12000 },
    },
    {
        { 名称 = "失心狂乱", 熟练度 = 12000 },
        { 名称 = "借刀杀人", 熟练度 = 12000 },
    },

    {
        { 名称 = "失心狂乱", 熟练度 = 12000 },
        { 名称 = "借刀杀人", 熟练度 = 12000 },
    },

}

function 战斗:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 2021,
        名称 = "虚耗",
        等级 = 等级,
        气血 = 200000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 1000 + 等级 * 10 + 转生 * 1,
        速度 = 200+ 等级 * 1 + 转生 * 1,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 60,
                抗封印 = 60,
            抗昏睡 = 60,
            加强混乱 = 5,
            忽视抗混 = 5,
                
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "失心狂乱", 熟练度 = 12000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 3183,
        名称 = "土蝼",
        等级 = 等级,
        气血 = 200000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 1000 + 等级 * 10 + 转生 * 1,
        速度 = 300+ 等级 * 1 + 转生 * 1,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 60,
                抗封印 = 60,
            抗昏睡 = 60,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "阎罗追命", 熟练度 = 12000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))
    self:加入敌方(3, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 6556,
        名称 = "猲狙",
        等级 = 等级,
        气血 = 200000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 1000 + 等级 * 10 + 转生 * 1,
        速度 = 200+ 等级 * 1 + 转生 * 1,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 60,
                抗封印 = 60,
            抗昏睡 = 60,
            加强火 = 5,
            忽视抗火 = 5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "三味真火", 熟练度 = 12000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))
    self:加入敌方(5, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2031,
        名称 = "蝮虫",
        等级 = 等级,
        气血 = 200000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 1000 + 等级 * 10 + 转生 * 1,
        速度 = 200+ 等级 * 1 + 转生 * 1,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 60,
                抗封印 = 60,
            抗昏睡 = 60,
            加强毒 = 5,
            忽视抗毒 = 5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "断肠烈散", 熟练度 = 12000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(6, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 2032,
        名称 = "文鳐",
        等级 = 等级,
        气血 = 200000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 1000 + 等级 * 10 + 转生 * 1,
        速度 = 200+ 等级 * 1 + 转生 * 1,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 60,
                抗封印 = 60,
            抗昏睡 = 60,
            加强水=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "龙啸九天", 熟练度 = 12000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(7, 生成战斗怪物(怪物属性))
    self:加入敌方(8, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2036,
        名称 = "旋龟",
        等级 = 等级,
        气血 = 200000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 1000 + 等级 * 10 + 转生 * 1,
        速度 = 200+ 等级 * 1 + 转生 * 1,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 60,
                抗封印 = 60,
            抗昏睡 = 60,
            加强水=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "龙啸九天", 熟练度 = 12000 }
        },
        施法几率 = 50,
        是否消失 = false,
    }
    self:加入敌方(9, 生成战斗怪物(怪物属性))
    self:加入敌方(10, 生成战斗怪物(怪物属性))


end

function 战斗:进场喊话()
    -- local dd = self:取对象(101)
    -- if dd then
    --     dd:当前喊话("同名小怪需要一起杀死。")
    -- end

end

function 战斗:战斗回合开始(v)

    --第一回主怪敏最快  出手100%遗忘10个目标 特殊遗忘 不能使用道具 150回合
    --红衣 物理攻击他自己回血 百分比70   蓝衣  物理攻击他自己回蓝 百分比70



end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

function 战斗:战斗结束(v)

end

return 战斗
