
local 战斗 = {
    是否惩罚 = false --死亡
}

function 战斗:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 2089,
        名称 = "奢比尸",
        等级 = 等级,
        气血 = 850000 + 等级 * 1000 + 转生 * 100000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 2000 + 等级 * 10 + 转生 * 1,
        速度 = 2000,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
                抗昏睡 = 110,
                加强水=15,
            忽视抗水 = 10,
            加强毒伤害=500,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "阎罗追命", 熟练度 = 20000 },
        
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2012,
        名称 = "花妖",
        等级 = 等级,
        气血 = 800000 + 等级 * 1000 + 转生 * 100000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 2000 + 等级 * 10 + 转生 * 1,
        速度 = 1500,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
                抗昏睡 = 110,
                加强水=15,
            忽视抗水 = 10,
            加强毒伤害=500,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "阎罗追命", 熟练度 = 20000 },
        
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2106,
        名称 = "恶毒的蝎精",
        等级 = 等级,
        气血 = 800000 + 等级 * 1000 + 转生 * 100000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 2000 + 等级 * 10 + 转生 * 1,
        速度 = 1600,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
                抗昏睡 = 110,
                加强火=15,
            忽视抗火 = 10,
            加强毒伤害=500,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = { { 名称 = "魔音摄心", 熟练度 = 20000 },
        { 名称 = "销魂蚀骨", 熟练度 = 20000 },
        
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 2106,
        名称 = "恶毒的蝎精",
        等级 = 等级,
        气血 = 800000 + 等级 * 1000 + 转生 * 100000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 2000 + 等级 * 10 + 转生 * 1,
        速度 = 1600,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
                抗昏睡 = 110,
                加强火=15,
            忽视抗火 = 10,
            加强毒伤害=500,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = { { 名称 = "魔音摄心", 熟练度 = 20000 },
        { 名称 = "销魂蚀骨", 熟练度 = 20000 },
        
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2096,
        名称 = "美丽的花精",
        等级 = 等级,
        气血 = 800000 + 等级 * 1000 + 转生 * 100000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 2000 + 等级 * 10 + 转生 * 1,
        速度 = 1200,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
                抗昏睡 = 110,
                加强混乱=15,
            忽视抗混 = 10,
            加强毒伤害=500,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = { { 名称 = "借刀杀人", 熟练度 = 20000 },
        { 名称 = "失心狂乱", 熟练度 = 20000 },
        
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2096,
        名称 = "美丽的花精",
        等级 = 等级,
        气血 = 800000 + 等级 * 1000 + 转生 * 100000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 2000 + 等级 * 10 + 转生 * 1,
        速度 = 1200,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
                抗昏睡 = 110,
                加强混乱=15,
            忽视抗混 = 10,
            加强毒伤害=500,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = { { 名称 = "借刀杀人", 熟练度 = 20000 },
        { 名称 = "失心狂乱", 熟练度 = 20000 },
        
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(6, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2031,
        名称 = "贪睡的小蛇",
        等级 = 等级,
        气血 = 800000 + 等级 * 1000 + 转生 * 100000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 2000 + 等级 * 10 + 转生 * 1,
        速度 = 900,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
                抗昏睡 = 110,
                加强雷=25,
            忽视抗雷 = 50,
            加强毒伤害=500,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = { { 名称 = "天诛地灭", 熟练度 = 20000 },
        
        
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(7, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2031,
        名称 = "贪睡的小蛇",
        等级 = 等级,
        气血 = 800000 + 等级 * 1000 + 转生 * 100000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 2000 + 等级 * 10 + 转生 * 1,
        速度 = 900,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
                抗昏睡 = 110,
                加强雷=25,
            忽视抗雷 = 50,
            加强毒伤害=500,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = { { 名称 = "天诛地灭", 熟练度 = 20000 },
        
        
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(8, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2031,
        名称 = "贪睡的小蛇",
        等级 = 等级,
        气血 = 800000 + 等级 * 1000 + 转生 * 100000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 2000 + 等级 * 10 + 转生 * 1,
        速度 = 900,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 110,
                抗封印 = 110,
                抗昏睡 = 110,
                加强雷=25,
            忽视抗雷 = 50,
            加强毒伤害=500,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = { { 名称 = "天诛地灭", 熟练度 = 20000 },
        
        
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(9, 生成战斗怪物(怪物属性))



end

function 战斗:进场喊话()

end

function 战斗:战斗回合开始(v)
--花妖不会死 没有控制状态攻击睡着小蛇 都没睡花妖就抽 第一回合小蛇带睡眠buff 5-6回合 解睡以后会仙法狂暴 所有怪死了花妖逃跑 战斗胜利


end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

function 战斗:战斗结束(v)

end

return 战斗
