
local 战斗 = {
    是否惩罚 = false --死亡
}

function 战斗:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 2170,
        名称 = "禺疆",
        等级 = 等级,
        气血 = 400000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 5000 + 等级 * 10 + 转生 * 1,
        速度 = 400+ 等级 * 1 + 转生 * 100,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 80,
                抗封印 = 80,
                抗昏睡 = 80,
                加强混乱=15,
            忽视抗混 = 5,
            加强昏睡=15,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = { { 名称 = "失心狂乱", 熟练度 = 15000 },
        { 名称 = "百日眠", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2288,
        名称 = "金鬼",
        等级 = 等级,
        气血 = 400000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 5000 + 等级 * 10 + 转生 * 1,
        速度 = 400+ 等级 * 1 + 转生 * 100,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 80,
                抗封印 = 80,
                抗昏睡 = 80,
                加强雷=15,
            忽视抗雷 = 5,
            加强昏睡=15,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "天诛地灭", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2289,
        名称 = "木鬼",
        等级 = 等级,
        气血 = 400000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 5000 + 等级 * 10 + 转生 * 1,
        速度 = 400+ 等级 * 1 + 转生 * 100,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 80,
                抗封印 = 80,
                抗昏睡 = 80,
                加强毒=15,
            忽视抗毒 = 5,
            加强昏睡=15,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "万毒攻心", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2290,
        名称 = "水妖",
        等级 = 等级,
        气血 = 400000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 5000 + 等级 * 10 + 转生 * 1,
        速度 = 400+ 等级 * 1 + 转生 * 100,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 80,
                抗封印 = 80,
                抗昏睡 = 80,
                加强水=15,
            忽视抗水 = 5,
            加强昏睡=15,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "九龙冰封", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2291,
        名称 = "火妖",
        等级 = 等级,
        气血 = 400000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 5000 + 等级 * 10 + 转生 * 1,
        速度 = 400+ 等级 * 1 + 转生 * 100,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 80,
                抗封印 = 80,
                抗昏睡 = 80,
                加强火=15,
            忽视抗火 = 5,
            加强昏睡=15,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "九阴纯火", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2292,
        名称 = "尘魔",
        等级 = 等级,
        气血 = 400000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 30000 + 等级 * 10 + 转生 * 5000,
        速度 = 100+ 等级 * 1 + 转生 * 100,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 80,
                抗封印 = 80,
            抗昏睡 = 80,
            连击率 = 70,
            连击次数 = 5,
            致命几率 = 70,
            忽视防御几率 = 100,
            忽视防御程度 = 120,
        },
        技能 = {
        },
        施法几率 = 0,
        是否消失 = false,
    }
    self:加入敌方(6, 生成战斗怪物(怪物属性))

end

function 战斗:进场喊话()

end

function 战斗:战斗回合开始(v)



end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

function 战斗:战斗结束(v)

end

return 战斗
