
local 战斗 = {
    是否惩罚 = false --死亡
}
local _技能组 = {

    {
        { 名称 = "失心狂乱", 熟练度 = 1 },
        { 名称 = "借刀杀人", 熟练度 = 1 },
    },
    {
        { 名称 = "失心狂乱", 熟练度 = 1 },
        { 名称 = "借刀杀人", 熟练度 = 1 },
    },

    {
        { 名称 = "失心狂乱", 熟练度 = 1 },
        { 名称 = "借刀杀人", 熟练度 = 1 },
    },

}

function 战斗:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 2289,
        名称 = "木鬼",
        等级 = 等级,
        气血 = 300000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 5000 + 等级 * 10 + 转生 * 1,
        速度 = 200+ 等级 * 1 + 转生 * 100,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 80,
                抗封印 = 80,
                抗昏睡 = 80,
                加强毒=5,
                忽视抗毒=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "万毒攻心", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2095,
        名称 = "桃树精",
        等级 = 等级,
        气血 = 300000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 5000 + 等级 * 10 + 转生 * 1,
        速度 = 200+ 等级 * 1 + 转生 * 100,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 80,
                抗封印 = 80,
                抗昏睡 = 80,
                加强毒=5,
                忽视抗毒=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "断肠烈散", 熟练度 = 12000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    for i = 1, 6, 1 do
        self:加入敌方(i+1, 生成战斗怪物(怪物属性))
    end




end

function 战斗:进场喊话()

end

function 战斗:战斗回合开始(v)



end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

function 战斗:战斗结束(v)

end

return 战斗
