
local 战斗 = {
    是否惩罚 = false --死亡
}

function 战斗:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 2090,
        名称 = "巫支祁",
        等级 = 等级,
        气血 = 500000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 2000 + 等级 * 10 + 转生 * 1,
        速度 = 500+ 等级 * 2 + 转生 * 100,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 100,
                抗封印 = 100,
                抗昏睡 = 100,
                加强火=15,
            忽视抗火 = 5,
            加强昏睡=15,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "阎罗追命", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2024,
        名称 = "龙女",
        等级 = 等级,
        气血 = 500000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 2000 + 等级 * 10 + 转生 * 1,
        速度 = 600+ 等级 * 1 + 转生 * 100,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 100,
                抗封印 = 100,
                抗昏睡 = 100,
                加强水=15,
            忽视抗水 = 15,
            加强昏睡=15,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = { { 名称 = "龙啸九天", 熟练度 = 15000 },
        { 名称 = "九龙冰封", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2095,
        名称 = "木魅",
        等级 = 等级,
        气血 = 500000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 2000 + 等级 * 10 + 转生 * 1,
        速度 = 600+ 等级 * 1 + 转生 * 100,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 100,
                抗封印 = 100,
                抗昏睡 = 100,
                加强毒=15,
            忽视抗毒 = 10,
            加强毒伤害=500,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "万毒攻心", 熟练度 = 15000 },
        { 名称 = "断肠烈散", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 2069,
        名称 = "水妖",
        等级 = 等级,
        气血 = 500000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 2000 + 等级 * 10 + 转生 * 1,
        速度 = 600+ 等级 * 1 + 转生 * 100,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 100,
                抗封印 = 100,
                抗昏睡 = 100,
                加强水=15,
            忽视抗水 = 10,
            加强毒伤害=500,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "龙啸九天", 熟练度 = 16000 },
        { 名称 = "九龙冰封", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2025,
        名称 = "山精",
        等级 = 等级,
        气血 = 500000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 2000 + 等级 * 10 + 转生 * 1,
        速度 = 600+ 等级 * 1 + 转生 * 100,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 100,
                抗封印 = 100,
                抗昏睡 = 100,
                加强水=15,
            忽视抗水 = 10,
            加强毒伤害=500,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "龙啸九天", 熟练度 = 16000 },
        { 名称 = "九龙冰封", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2101,
        名称 = "石生",
        等级 = 等级,
        气血 = 400000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 30000 + 等级 * 10 + 转生 * 5000,
        速度 = 100+ 等级 * 1 + 转生 * 100,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 100,
                抗封印 = 100,
            抗昏睡 = 100,
            连击率 = 70,
            连击次数 = 5,
            致命几率 = 70,
        },
        技能 = {
        },
        施法几率 = 0,
        是否消失 = false,
    }
    self:加入敌方(6, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2287,
        名称 = "大太子",
        等级 = 等级,
        气血 = 500000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 2000 + 等级 * 10 + 转生 * 1,
        速度 = 600+ 等级 * 1 + 转生 * 100,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 100,
                抗封印 = 100,
                抗昏睡 = 100,
                加强水=15,
            忽视抗水 = 10,
            加强毒伤害=500,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "含情脉脉", 熟练度 = 16000 },
        { 名称 = "楚楚可怜", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(7, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2287,
        名称 = "二太子",
        等级 = 等级,
        气血 = 500000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 2000 + 等级 * 10 + 转生 * 1,
        速度 = 600+ 等级 * 1 + 转生 * 100,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 100,
                抗封印 = 100,
                抗昏睡 = 100,
                加强水=15,
            忽视抗水 = 10,
            加强毒伤害=500,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "魔音摄心", 熟练度 = 16000 },
        { 名称 = "阎罗追命", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(8, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2287,
        名称 = "三太子",
        等级 = 等级,
        气血 = 500000 + 等级 * 1000 + 转生 * 20000,
        魔法 = 20000 + 等级 * 100 + 转生 * 100,
        攻击 = 2000 + 等级 * 10 + 转生 * 1,
        速度 = 600+ 等级 * 2 + 转生 * 100,
        抗性 = {
            物理吸收 = 5,
                抗震慑 = 5,
                抗混乱 = 100,
                抗封印 = 100,
                抗昏睡 = 100,
                加强水=15,
            忽视抗水 = 10,
            加强毒伤害=500,
            忽视抗睡=5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "乾坤借速", 熟练度 = 16000 },
        { 名称 = "天外飞魔", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(9, 生成战斗怪物(怪物属性))



end

function 战斗:进场喊话()

end

function 战斗:战斗回合开始(v)
--龙女不出手 给主怪解控  太子之间会拉血


end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

function 战斗:战斗结束(v)

end

return 战斗
