-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-08-06 16:04:54
-- @Last Modified time  : 2022-08-06 16:13:39
local 物品 = {
    名称 = '充值礼包4000',
    叠加 = 999,
    类别 = 10,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    禁止交易 = true,
    绑定 = true
}

function 物品:使用(对象)
    if 对象:添加物品({
        生成物品 { 名称 = '银票', 参数 = 50000000, 数量 = 40 },
        生成物品 { 名称 = '鸿运宝珠', 数量 = 20 },
        生成物品 { 名称 = '清盈果', 参数 = 1000,  数量 = 24 },
        生成物品 { 名称 = '神兵石', 数量 = 60 },
        生成物品 { 名称 = '龙之骨', 数量 = 18 },
        生成物品 { 名称 = '帮派成就册',参数=1000 , 数量 = 100 },
        生成物品 { 名称 = '筋骨提气丸', 数量 = 3 },
        生成物品 { 名称 = '炼化大礼包', 数量 = 20 },
		生成物品 { 名称 = '五级神兵自选卡', 数量 = 10 },
		生成物品 { 名称 = '封印卡',参数='年', 数量 = 1 },
        生成物品 { 名称 = '随机五常神兽宝盒',  数量 = 5 },
		生成物品 { 名称 = '万兽要诀', 数量 = 150 },
        生成物品 { 名称 = '六级神兵自选卡', 数量 = 5 },
		生成物品 { 名称 = '终极技能书', 数量 = 30 },
		生成物品 { 名称 = '乱舞狂刀技能书', 数量 = 2 },


    }) then
                --对象:添加称谓("资产过亿")
        self.数量 = self.数量 - 1
    else
        对象:常规提示("#Y道具栏不足")
    end

end

return 物品
