-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-08-06 16:04:54
-- @Last Modified time  : 2022-08-06 16:13:39
local 物品 = {
    名称 = '充值礼包100',
    叠加 = 999,
    类别 = 10,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    禁止交易 = true,
    绑定 = true
}

function 物品:使用(对象)
    if 对象:添加物品({
        生成物品 { 名称 = '刮刮乐', 数量 = 10 },
        生成物品 { 名称 = '银票', 参数 = 10000000, 数量 = 2 },
        生成物品 { 名称 = '帮派成就册', 参数 = 10000, 数量 = 1 },
        生成物品 { 名称 = '亲密丹', 参数 = 100000, 数量 = 20 },
        生成物品 { 名称 = '神兵礼盒',参数=1, 数量 = 10 },
        生成物品 { 名称 = '神兵石', 数量 = 10 },
        生成物品 { 名称 = '炼化大礼包', 数量 = 1 },
        生成物品 { 名称 = '封印卡', 参数 = "猴毛", 数量 = 1 },
        生成物品 { 名称 = '龙涎丸', 数量 = 9 },
        生成物品 { 名称 = '九转易筋丸', 数量 = 2 },
        生成物品 { 名称 = '超级金柳露', 数量 = 2 },
        生成物品 { 名称 = '清盈果', 参数 = 1000, 数量 = 10 },
        生成物品 { 名称 = '超级星梦石', 数量 = 1 },
		生成物品 { 名称 = '万兽要诀', 数量 = 5 },
    }) then
        self.数量 = self.数量 - 1
        if 对象.其它.回血 == 0 then
            对象.其它.回血 = 1
        end
    else
        对象:常规提示("#Y道具栏不足")
    end
end

return 物品
