-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-08-06 16:04:54
-- @Last Modified time  : 2022-08-06 16:13:39
local 物品 = {
    名称 = '累计礼包7000',
    叠加 = 999,
    类别 = 10,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    禁止交易 = true,
    绑定 = true
}

function 物品:使用(对象)
    if 对象:添加物品({
        生成物品 { 名称 = '积分卡', 数量 = 1, 参数 =750000, 禁止交易 = true },
        生成物品 { 名称 = '银票', 数量 = 10, 参数 = 100000000 },
        生成物品 { 名称 = '刮刮乐', 数量 = 300 },
        生成物品 { 名称 = '神兵石', 数量 = 200 },
        生成物品 { 名称 = '补天神石', 数量 = 150 },
        生成物品 { 名称 = '盘古精铁', 数量 = 100 },
        生成物品 { 名称 = '天外飞石', 数量 = 100 },
        生成物品 { 名称 = '神兵礼盒', 参数 = 1, 数量 = 50 },     
        生成物品 { 名称 = '神兽自选卡', 数量 = 3 },
        生成物品 { 名称 = '清盈果', 参数 = 1000, 数量 = 60 },
        生成物品 { 名称 = '炼化大礼包', 数量 = 15 },
		生成物品 { 名称 = '封印卡', 参数 = "孙悟空", 数量 = 1 },
		生成物品 { 名称 = '封印卡', 参数 = "大浪淘沙", 数量 = 1 },
        生成物品 { 名称 = '乱舞狂刀技能书', 数量 = 3 },
		
    }) then
        --对象:添加称谓("资产过亿")
        self.数量 = self.数量 - 1
    else
        对象:常规提示("#Y道具栏不足")
    end
end

return 物品
