-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-08-06 16:04:54
-- @Last Modified time  : 2022-08-06 16:13:39
local 物品 = {
    名称 = '累计礼包5000',
    叠加 = 999,
    类别 = 10,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    禁止交易 = true,
    绑定 = true
}

function 物品:使用(对象)
    if 对象:添加物品({
        生成物品 { 名称 = '积分卡', 数量 = 1, 参数 = 450000, 禁止交易 = true },
        生成物品 { 名称 = '银票', 数量 = 2, 参数 = 100000000 },
        生成物品 { 名称 = '刮刮乐', 数量 = 200 },
        生成物品 { 名称 = '神兵石', 数量 = 100 },
        生成物品 { 名称 = '补天神石', 数量 = 100 },
        生成物品 { 名称 = '盘古精铁', 数量 = 60 },
        生成物品 { 名称 = '天外飞石', 数量 = 60 },
        生成物品 { 名称 = '神兵礼盒', 参数 = 1, 数量 = 30 },
        生成物品 { 名称 = '五常神兽宝卷', 数量 = 1 },
        生成物品 { 名称 = '神兽自选卡', 数量 = 1 },
        生成物品 { 名称 = '清盈果', 参数 = 1000, 数量 = 40 },
        生成物品 { 名称 = '炼化大礼包', 数量 = 5 },
		生成物品 { 名称 = '封印卡', 参数 = "超级浪淘沙", 数量 = 1 },
		生成物品 { 名称 = '封印卡', 参数 = "大去疾", 数量 = 1 },
        --生成物品 { 名称 = '封印卡', 参数 = "画中仙", 数量 = 1 },

    }) then
        self.数量 = self.数量 - 1
    else
        对象:常规提示("#Y道具栏不足")
    end
end

return 物品
