local NPC = {}
local 对话 = [[
menu
1|我要更换主抗性
2|我要更换副抗性
99|什么都不想做
]]


local 主抗对话 = [[
你要更换成那种抗性呢？ 
menu
抗风 抗火
抗水 抗雷
抗混乱 抗封印
抗昏睡 抗中毒
物理吸收 99|什么都不想做
]]






--其它对话
local _是否抗性 = {
    抗风 = true,
    抗火 = true,
    抗水 = true,
    抗雷 = true,
    抗混乱 = true,
    抗封印 = true,
    抗昏睡 = true,
    抗中毒 = true,
    物理吸收 = true,
}

function NPC:NPC对话(玩家, i)
    -- print(self.帮派,self.帮派.名称)
    return 对话
end

function NPC:NPC菜单(玩家, i)
    if not 玩家.帮派 or 玩家.帮派 == "" then
        return "你已经不是本帮成员了"
    end
    if 玩家.帮派 ~= self.帮派.名称 then
        return "非本帮派成员，不要参与本帮的事物#04"
    end
    if i == "1" then
        local r = 玩家:选择窗口(主抗对话)
        if _是否抗性[r] then
            return 玩家:更换守护抗性(1, r)
        end


    elseif i == "2" then
        if self.帮派.等级 < 2 then
            return "帮派达到2级再来找我吧"
        end
        local r = 玩家:选择窗口(主抗对话)
        if _是否抗性[r] then
            return 玩家:更换守护抗性(2, r)
        end

    end
end

return NPC
--xx = {"我要更换主抗性","我要更换副抗性","什么都不想做。"}
-- wb[1] = "我是专门为本帮成员驯养坐骑和召唤兽驯养师，想要召唤兽和坐骑迅速的强大起来我是可以帮你的。（#R/驯养坐骑经验与技能熟练度时，需骑乘需要驯养的坐骑；召唤兽驯养需将召唤兽设置成当前参战状态。）"
-- xx = {"我要提高坐骑经验","我要提高坐骑技能熟练度","我要驯养参战召唤兽亲密","什么都不想做。"}
-- if 事件=="我要更换主抗性" then
--     添加最后对话(数字id,"你要更换成那种抗性呢？",{"","抗风","抗火","抗水","抗雷","抗混乱","抗封印","抗昏睡","抗中毒","抗遗忘","抗鬼火"})
--     玩家数据[数字id].最后操作="换主抗性"
-- elseif 事件=="我要更换副抗性" then
--     添加最后对话(数字id,"你要更换成那种抗性呢？",{"物理吸收","抗风","抗火","抗水","抗雷","抗混乱","抗封印","抗昏睡","抗中毒","抗遗忘","抗鬼火"})
--     玩家数据[数字id].最后操作="换副抗性"
-- end
