-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-01 12:16:40
-- @Last Modified time  : 2022-09-07 15:17:32

local 任务 = {
    名称 = '元宵_新春祭祖',
    别名 = '新春祭祖',
    类型 = '节日任务'
}

function 任务:任务初始化(玩家, ...)
    self.进度 = 1
end

function 任务:任务上线(玩家)

end

function 任务:任务更新(玩家, sec)
end

function 任务:任务取消(玩家)

end

function 任务:任务取详情(玩家)
    return string.format('#Y任务目的:#r#W请前往#G%s#W使用#Y祭祖酒#W祭拜先祖。', self.寻路)
end

local _任务类型 = { "元宵_新春祭祖", "元宵_童心祝福", "元宵_团员年饭", "元宵_亲友拜年",
    "元宵_辞旧迎新" }
local _地图 = { 1193, 1110, 1194, 1203, 1140, 1478, 1070, 1091, 1217 }

local _提示 = "忠孝祭祖,念恩思德,这是我们华夏民族的光荣传统!新年到了,身为龙的传人,可要记得带祭祖酒祭拜我们的炎黄先祖，告诉他们在过去一年中你的成长，也许下你新年的愿望!#50去%s#W使用#Y祭祖酒#W祭拜先祖。"

--长安城东，大唐境内，五指山，斧头帮，普陀山，大唐边境，长寿村，长寿村外
function 任务:添加任务(玩家)
    local map = 玩家:取随机地图(_地图)

    if not map then
        return
    end
    local X, Y = map:取随机坐标()
    if not X then
        return
    end
    self.位置 = string.format('#G%s#Y(%d,%d)', map.名称, X, Y)
    self.寻路 = string.format('#u#[%s|%s|%s|$#G%s#]#u#Y(%d,%d)', map.id, X, Y, map.名称, X, Y)
    if 玩家.是否组队 then
        local t = {}
        for _, v in 玩家:遍历队伍() do
            if v:判断等级是否低于(10) then --or not v:剧情称谓是否存在(8)
                table.insert(t, v.名称)
            end
        end
        if #t > 0 then
            玩家:常规提示('#Y' .. table.concat(t, '、 ') .. '#W低于10级,无法领取')
            return
        end
        for _, v in 玩家:遍历队伍() do
            for _, name in pairs(_任务类型) do
                if v:取任务(name) then
                    table.insert(t, v.名称)
                end
            end
        end
        if #t > 0 then
            玩家:常规提示('#Y' .. table.concat(t, '、 ') .. '已有此任务,无法重复领取')
            return
        end

        if not 玩家:添加物品({ 生成物品 { 名称 = "祭祖酒", 数量 = 1 } }) then
            玩家:常规提示('#Y你身上没有多余的地方放任务道具！')
            return
        end

        self.队伍 = {}
        for k, v in 玩家:遍历队伍() do
            table.insert(self.队伍, v.nid)
            v.其它.元宵次数 = v.其它.元宵次数 + 1
            if v.其它.元宵次数 > 6 then
                v.其它.元宵次数 = 1
            end
            v:添加任务(self)
        end
    else
        if 玩家:判断等级是否低于(10) then
            玩家:常规提示('#Y低于10级,无法领取')
            return
        end
        for _, name in pairs(_任务类型) do
            if 玩家:取任务(name) then
                玩家:常规提示('#Y已有此任务,无法重复领取')
                return
            end
        end
        if not 玩家:添加物品({ 生成物品 { 名称 = "祭祖酒", 数量 = 1 } }) then
            玩家:常规提示('#Y你身上没有多余的地方放任务道具！')
            return
        end
        self.队伍 = {}
        table.insert(self.队伍, 玩家.nid)
        玩家.其它.元宵次数 = 玩家.其它.元宵次数 + 1
        if 玩家.其它.元宵次数 > 6 then
            玩家.其它.元宵次数 = 1
        end
        玩家:添加任务(self)
    end

    self.时间 = os.time() + 30 * 60
    self.队长 = 玩家.名称
    self.MAP = map.id
    self.次数 = 玩家.其它.元宵次数
    self.x = X
    self.y = Y
    return string.format(_提示, self.位置)
end

function 任务:完成(玩家, 胜利)
    local r = 玩家:取物品是否存在("祭祖酒")
    if r then
        r:减少(1)
    end



    if 胜利 then
        self:掉落包(玩家)
    end
    self:删除()
end

local _掉落 = {
    { 几率 = 200, 名称 = '九彩云龙珠', 数量 = 1, 参数 = 130 },
    { 几率 = 200, 名称 = '内丹精华', 数量 = 1 },
    { 几率 = 200, 名称 = '血玲珑', 数量 = 1, 参数 = 125 },
    { 几率 = 300, 名称 = '千年寒铁', 数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 300, 名称 = '天外飞石', 数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 310,名称 = "帮派成就册",参数 = 1000,  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 320, 名称 = '盘古精铁', 数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    --{ 几率 = 55,名称 = "高级藏宝图",  数量 = 1, 广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
    { 几率 = 5,名称 = "修正卡",  数量 = 1,  },
    { 几率 = 50, 名称 = "更名卡", 数量 = 1, },
    { 几率 = 100,名称 = "刮刮乐", 数量 = 1, },
    
    --{ 几率 = 3,名称 = "神兵石",  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 10,名称 = "超级星梦石",  数量 = 1, },
    { 几率 = 3,名称 = "筋骨提气丸",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 10,名称 = "九转易筋丸",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 10,名称 = "伐骨洗髓丹",  数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 15,名称 = "高级金柳露",  数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 15,名称 = "混元丹",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 4,名称 = "超级金柳露",  数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 4,名称 = "龙之骨",  数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
   -- { 几率 = 15,名称 = "武帝袍", 参数 = 11,  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
   -- { 几率 = 15,名称 = "灵犀角", 参数 = 11,  数量 = 1,  广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
   -- { 几率 = 15,名称 = "云罗帐", 参数 = 11,  数量 = 1, 广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
  --  { 几率 = 15,名称 = "盘古石", 参数 = 11,  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 200,名称 = "武帝袍", 参数 = 9,  数量 = 1},
    { 几率 = 200,名称 = "灵犀角", 参数 = 9,  数量 = 1, },
    { 几率 = 200,名称 = "云罗帐", 参数 = 9,  数量 = 1, },
    { 几率 = 200,名称 = "盘古石", 参数 = 9,  数量 = 1, },
    { 几率 = 300,名称 = "神兽丹",  数量 = 1,  },
    { 几率 = 300,名称 = "凝精聚气丹",  数量 = 1, },
    { 几率 = 150,名称 = "人参果王",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 150,名称 = "蟠桃王",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 500,名称 = "千年寒铁",  数量 = 1, },
    { 几率 = 500,名称 = "天外飞石",  数量 = 1, },
    { 几率 = 400,名称 = "盘古精铁",  数量 = 1, },
    { 几率 = 400,名称 = "补天神石",  数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    --{ 几率 = 1,名称 = "神兵礼盒",  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    --{ 几率 = 1,名称 = "守护宝卷",  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    --{ 几率 = 1,名称 = "超级变色丹",  数量 = 1, 广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
   -- { 几率 = 1,名称 = "超级元气丹",  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 5,名称 = "轻盈果", 参数 = 500,  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 250,名称 = "天书残卷第一卷",  数量 = 1, },
    { 几率 = 250,名称 = "天书残卷第二卷",  数量 = 1, },
    { 几率 = 250,名称 = "天书残卷第三卷",  数量 = 1, },
    { 几率 = 250,名称 = "天书残卷第四卷",  数量 = 1, },
    { 几率 = 250,名称 = "天书残卷第五卷",  数量 = 1, },
    { 几率 = 250,名称 = "天书残卷第六卷",  数量 = 1, },
    { 几率 = 100,名称 = "见闻录",  数量 = 1, },
    { 几率 = 50,名称 = "六脉化神丸",  数量 = 1, },
    { 几率 = 150,名称 = "亲密丹",  数量 = 1, },
    { 几率 = 30,名称 = "月光宝盒",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
}


local _次数上限 = 100
function 任务:掉落包(玩家, 次数)
    if 玩家:取活动限制次数('贺岁福星') > _次数上限 then
        玩家:常规提示("#Y今日已经完成%s次，无法获得奖励", _次数上限)
        return
    end
    玩家:增加活动限制次数('贺岁福星')
    local 银子 = math.floor(200000)
    local 经验 = math.floor(1304521)
    local 法宝经验 = math.floor(140)
    玩家:添加任务经验(经验, "贺岁福星")
    玩家:添加银子(银子, "贺岁福星")



    local 总几率 = math.random(1000)
    local 几率=0
    for i, v in ipairs(_掉落) do
        几率=几率+v.几率
        if 总几率 <= 几率 then
            if v.召唤 then
                local zh = 生成召唤 { 名称 = v.名称 }
                if 玩家:添加召唤(zh) then
                    if v.广播 then
                        玩家:发送系统(v.广播, 玩家.名称, zh.nid, zh.名称)
                    end
                end
            else
                local r = 生成物品 { 名称 = v.名称, 数量 = v.数量, 参数 = v.参数, 禁止交易 = v.禁止交易 }
                if r then
                    玩家:添加物品({ r })
                    if v.广播 then
                        玩家:发送系统(v.广播, 玩家.名称, r.nid, r.名称)
                    end
                end
            end
            break
        end
    end
end

local 对话 = [[您的诚心感动了先祖，来许下新年的愿望吧。炎黄子孙，同祖同源。华夏儿女，同愿同向。九州大地,贞观盛世。后裔子孙，祭祖念恩。告慰始祖，贻我吉祥。佑我:
menu
1|家人,身体安康。
2|帮派,兴隆昌盛。
2|亲友,义气肝胆。
2|自己,万事如意。
2|大话,千载长存。
]]
function 任务:触发战斗(玩家)
    local r = 玩家:取任务("元宵_新春祭祖")
    if r then
        local hh = 玩家:进入战斗('scripts/task/节日活动/元宵_新春祭祖.lua')
        if hh then
            玩家:最后对话(对话, 9527)
        end
        return
    end
end

function 任务:战斗初始化(玩家)
  --  local r = 玩家:取任务('元宵_新春祭祖')
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 2283,
        名称 = "大祭司",
        等级 = 等级,
        气血 = 352587 + 转生 * 50000 + 等级 * 1000,
        魔法 = 170000,
        攻击 = 150 + 等级 * 30 + 转生 * 150,
        速度 = 200 + 等级 * 2 + 转生 * 10,
        抗性 = {
            物理吸收 = 15,
            抗震慑 = 10,
            抗风 = -20,
            抗火 = -20,
            抗水 = -20,
            抗雷 = -20,
            抗混乱 = 105,
            抗封印 = 105,
            抗昏睡 = 105,
            加强封印 = 15,
            加强昏睡 = 15,
        },
        技能 = {
            { 名称 = "谗言相加", 熟练度 = 15000 },
            { 名称 = "失心狂乱", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2150,
        名称 = "华夏礼仪",
        等级 = 等级,
        气血 = 352587 + 转生 * 50000 + 等级 * 1000,
        魔法 = 170000,
        攻击 = 150 + 等级 * 30 + 转生 * 150,
        速度 = 200 + 等级 * 2 + 转生 * 10,
        抗性 = {
            物理吸收 = 15,
            抗震慑 = 10,
            抗风 = -20,
            抗火 = -20,
            抗水 = -20,
            抗雷 = -20,
            抗混乱 = 105,
            抗封印 = 105,
            抗昏睡 = 105,
            加强封印 = 15,
            加强昏睡 = 15,
        },
        技能 = {
            { 名称 = "谗言相加", 熟练度 = 15000 },
            { 名称 = "失心狂乱", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2150,
        名称 = "华夏礼仪",
        等级 = 等级,
        气血 = 352587 + 转生 * 50000 + 等级 * 1000,
        魔法 = 170000,
        攻击 = 150 + 等级 * 30 + 转生 * 150,
        速度 = 200 + 等级 * 2 + 转生 * 10,
        抗性 = {
            物理吸收 = 15,
            抗震慑 = 10,
            抗风 = -20,
            抗火 = -20,
            抗水 = -20,
            抗雷 = -20,
            抗混乱 = 105,
            抗封印 = 105,
            抗昏睡 = 105,
            加强封印 = 15,
            加强昏睡 = 15,
        },
        技能 = {
            { 名称 = "谗言相加", 熟练度 = 15000 },
            { 名称 = "失心狂乱", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2087,
        名称 = "玄武护法",
        等级 = 等级,
        气血 = 352587 + 转生 * 50000 + 等级 * 1000,
        魔法 = 170000,
        攻击 = 150 + 等级 * 30 + 转生 * 150,
        速度 = 200 + 等级 * 2 + 转生 * 10,
        抗性 = {
            物理吸收 = 15,
            抗震慑 = 10,
            抗风 = -20,
            抗火 = -20,
            抗水 = -20,
            抗雷 = -20,
            抗混乱 = 105,
            抗封印 = 105,
            抗昏睡 = 105,
            加强封印 = 15,
            加强昏睡 = 15,
        },
        技能 = {
            { 名称 = "谗言相加", 熟练度 = 15000 },
            { 名称 = "失心狂乱", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2087,
        名称 = "白虎护法",
        等级 = 等级,
        气血 = 352587 + 转生 * 50000 + 等级 * 1000,
        魔法 = 170000,
        攻击 = 150 + 等级 * 30 + 转生 * 150,
        速度 = 200 + 等级 * 2 + 转生 * 10,
        抗性 = {
            物理吸收 = 15,
            抗震慑 = 10,
            抗风 = -20,
            抗火 = -20,
            抗水 = -20,
            抗雷 = -20,
            抗混乱 = 105,
            抗封印 = 105,
            抗昏睡 = 105,
            加强封印 = 15,
            加强昏睡 = 15,
        },
        技能 = {
            { 名称 = "谗言相加", 熟练度 = 15000 },
            { 名称 = "失心狂乱", 熟练度 = 15000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))

end

function 任务:战斗回合开始(dt)


end

function 任务:战斗结束(s)
    for k, v in self:遍历我方() do
        if v.是否玩家 then
            local r = v.对象.接口:取任务("元宵_新春祭祖")
            if r then
                r:完成(v.对象.接口, s)
            end
        end
    end
end

return 任务
