-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-01 12:16:40
-- @Last Modified time  : 2022-09-07 15:17:32

local 任务 = {
    名称 = '元宵_辞旧迎新',
    别名 = '辞旧迎新',
    类型 = '节日任务'

}

function 任务:任务初始化(玩家, ...)
    self.进度 = 1
end

function 任务:任务上线(玩家)

end

function 任务:任务更新(玩家, sec)
end

function 任务:任务取消(玩家)

end

function 任务:任务取详情(玩家)
    return string.format('#Y任务目的:#r#W兔年已到,虎年远去。可是这#G%s#W在过去的一年中对这里产生了浓厚的感情,不舍得离去,一他正在#R%s#W等他最舍不得的人,你带他去找找吧'
        , self.寻路, self.位置)
end

local _任务类型 = { "元宵_新春祭祖", "元宵_童心祝福", "元宵_团员年饭", "元宵_亲友拜年",
    "元宵_辞旧迎新" }
local _地图 = { 101349, 1110, 1194, 1203, 1140, 1478, 1070, 1091, 1217 }

local _提示 = '兔年已到,虎年远去。可是这小虎生肖使在过去的一年中对这里产生了浓厚的感情,不舍得离去#52,一他正在#R%s#W等他最舍不得的人,你带他去找找吧#47'

--长安城东，大唐境内，五指山，斧头帮，普陀山，大唐边境，长寿村，长寿村外
function 任务:添加任务(玩家)
    local map = 玩家:取随机地图(_地图)

    if not map then
        return
    end
    local X, Y = map:取随机坐标()
    if not X then
        return
    end

    if 玩家.是否组队 then
        local t = {}
        for _, v in 玩家:遍历队伍() do
            if v:判断等级是否低于(10) then --or not v:剧情称谓是否存在(8)
                table.insert(t, v.名称)
            end
        end
        if #t > 0 then
            玩家:常规提示('#Y' .. table.concat(t, '、 ') .. '#W低于10级,无法领取')
            return
        end
        for _, v in 玩家:遍历队伍() do
            for _, name in pairs(_任务类型) do
                if v:取任务(name) then
                    table.insert(t, v.名称)
                end
            end
        end
        if #t > 0 then
            玩家:常规提示('#Y' .. table.concat(t, '、 ') .. '已有此任务,无法重复领取')
            return
        end



        self.队伍 = {}
        for k, v in 玩家:遍历队伍() do
            table.insert(self.队伍, v.nid)
            v.其它.元宵次数 = v.其它.元宵次数 + 1
            if v.其它.元宵次数 > 6 then
                v.其它.元宵次数 = 1
            end
            v:添加任务(self)
        end
    else
        if 玩家:判断等级是否低于(10) then
            玩家:常规提示('#Y低于10级,无法领取')
            return
        end
        for _, name in pairs(_任务类型) do
            if 玩家:取任务(name) then
                玩家:常规提示('#Y已有此任务,无法重复领取')
                return
            end
        end
        self.队伍 = {}
        table.insert(self.队伍, 玩家.nid)
        玩家.其它.元宵次数 = 玩家.其它.元宵次数 + 1
        if 玩家.其它.元宵次数 > 6 then
            玩家.其它.元宵次数 = 1
        end
        玩家:添加任务(self)
    end
    self.怪名 = "小虎生肖使"
    self.位置 = string.format('%s#Y(%d,%d)', map.名称, X, Y)
    self.寻路 = string.format('#u#[%s|%s|%s|$%s#]#u', map.id, X, Y, self.怪名)
    self.时间 = os.time() + 30 * 60
    self.NPC =
    map:添加NPC {
        队伍 = self.队伍,
        人数 = #self.队伍,
        名称 = self.怪名,
        时间 = 1800,
        外形 = 4003,
        脚本 = 'scripts/task/节日活动/元宵_辞旧迎新.lua',
       -- 时间 = self.时间,
        任务类型 = "辞旧迎新",
        X = X,
        Y = Y,
        来源 = self
    }






    self.队长 = 玩家.名称
    self.MAP = map.id
    self.次数 = 玩家.其它.元宵次数
    self.x = X
    self.y = Y
    return string.format(_提示, self.位置)
end

function 任务:完成(玩家, 胜利)
    if 胜利 then
        self:掉落包(玩家)
    end
    local map = 玩家:取地图(self.MAP)
    if map then
        map:删除NPC(self.NPC)
    end
    self:删除()
end

local _掉落 = {
    { 几率 = 200, 名称 = '九彩云龙珠', 数量 = 1, 参数 = 130 },
    { 几率 = 200, 名称 = '内丹精华', 数量 = 1 },
    { 几率 = 200, 名称 = '血玲珑', 数量 = 1, 参数 = 125 },
    { 几率 = 300, 名称 = '千年寒铁', 数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 300, 名称 = '天外飞石', 数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 310,名称 = "帮派成就册",参数 = 1000,  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 320, 名称 = '盘古精铁', 数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    --{ 几率 = 55,名称 = "高级藏宝图",  数量 = 1, 广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
    { 几率 = 5,名称 = "修正卡",  数量 = 1,  },
    { 几率 = 50, 名称 = "更名卡", 数量 = 1, },
    { 几率 = 100,名称 = "刮刮乐", 数量 = 1, },
    
    --{ 几率 = 3,名称 = "神兵石",  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 10,名称 = "超级星梦石",  数量 = 1, },
    { 几率 = 3,名称 = "筋骨提气丸",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 10,名称 = "九转易筋丸",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 10,名称 = "伐骨洗髓丹",  数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 15,名称 = "高级金柳露",  数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 15,名称 = "混元丹",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 4,名称 = "超级金柳露",  数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 4,名称 = "龙之骨",  数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
   -- { 几率 = 15,名称 = "武帝袍", 参数 = 11,  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
   -- { 几率 = 15,名称 = "灵犀角", 参数 = 11,  数量 = 1,  广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
   -- { 几率 = 15,名称 = "云罗帐", 参数 = 11,  数量 = 1, 广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
  --  { 几率 = 15,名称 = "盘古石", 参数 = 11,  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 200,名称 = "武帝袍", 参数 = 9,  数量 = 1},
    { 几率 = 200,名称 = "灵犀角", 参数 = 9,  数量 = 1, },
    { 几率 = 200,名称 = "云罗帐", 参数 = 9,  数量 = 1, },
    { 几率 = 200,名称 = "盘古石", 参数 = 9,  数量 = 1, },
    { 几率 = 300,名称 = "神兽丹",  数量 = 1,  },
    { 几率 = 300,名称 = "凝精聚气丹",  数量 = 1, },
    { 几率 = 150,名称 = "人参果王",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 150,名称 = "蟠桃王",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 500,名称 = "千年寒铁",  数量 = 1, },
    { 几率 = 500,名称 = "天外飞石",  数量 = 1, },
    { 几率 = 400,名称 = "盘古精铁",  数量 = 1, },
    { 几率 = 400,名称 = "补天神石",  数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    --{ 几率 = 1,名称 = "神兵礼盒",  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    --{ 几率 = 1,名称 = "守护宝卷",  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    --{ 几率 = 1,名称 = "超级变色丹",  数量 = 1, 广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
   -- { 几率 = 1,名称 = "超级元气丹",  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 5,名称 = "轻盈果", 参数 = 500,  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 250,名称 = "天书残卷第一卷",  数量 = 1, },
    { 几率 = 250,名称 = "天书残卷第二卷",  数量 = 1, },
    { 几率 = 250,名称 = "天书残卷第三卷",  数量 = 1, },
    { 几率 = 250,名称 = "天书残卷第四卷",  数量 = 1, },
    { 几率 = 250,名称 = "天书残卷第五卷",  数量 = 1, },
    { 几率 = 250,名称 = "天书残卷第六卷",  数量 = 1, },
    { 几率 = 100,名称 = "见闻录",  数量 = 1, },
    { 几率 = 50,名称 = "六脉化神丸",  数量 = 1, },
    { 几率 = 150,名称 = "亲密丹",  数量 = 1, },
    { 几率 = 30,名称 = "月光宝盒",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
}


local _次数上限 = 100
function 任务:掉落包(玩家, 次数)
    if 玩家:取活动限制次数('贺岁福星') > _次数上限 then
        玩家:常规提示("#Y今日已经完成%s次，无法获得奖励", _次数上限)
        return
    end
    玩家:增加活动限制次数('贺岁福星')
    
    local 银子 = math.floor(50000)
    local 经验 = math.floor(984521)
    local 法宝经验 = math.floor(140)
    玩家:添加任务经验(经验, "贺岁福星")
    玩家:添加银子(银子, "贺岁福星")



    local 总几率 = math.random(1000)
    local 几率=0
    for i, v in ipairs(_掉落) do
        几率=几率+v.几率
        if 总几率 <= 几率 then
            if v.召唤 then
                local zh = 生成召唤 { 名称 = v.名称 }
                if 玩家:添加召唤(zh) then
                    if v.广播 then
                        玩家:发送系统(v.广播, 玩家.名称, zh.nid, zh.名称)
                    end
                end
            else
                local r = 生成物品 { 名称 = v.名称, 数量 = v.数量, 参数 = v.参数, 禁止交易 = v.禁止交易 }
                if r then
                    玩家:添加物品({ r })
                    if v.广播 then
                        玩家:发送系统(v.广播, 玩家.名称, r.nid, r.名称)
                    end
                end
            end
            break
        end
    end
end

local 对话 = [[你知道吗,我最舍不得的人他们都是盖世英雄#47。你能跟我去向他们道别吗?
menu
1|当然可以啊
2|你稍微等我下哦
]]
local 对话2 = [[再见#98新的一年祝你顺顺利利,开开心心,健健康康]]
function 任务:NPC对话(玩家, NPC)
    if NPC.任务类型 == "辞旧迎新" then
        local r = 玩家:取任务("元宵_辞旧迎新")
        if r and r.NPC == NPC.nid then
            return 对话
        end
        return "我认识你么？"
    end
end

function 任务:NPC菜单(玩家, i, NPC)
    if i == '1' then
        local r = 玩家:进入战斗('scripts/task/节日活动/元宵_辞旧迎新.lua', self)
        if r then

            return 对话2
        end
    end
end

function 任务:任务攻击事件(玩家, NPC)
    if NPC.任务类型 == "辞旧迎新" then
        local r = 玩家:取任务("元宵_辞旧迎新")
        if r and r.NPC == NPC.nid then
            local hh = 玩家:进入战斗('scripts/task/节日活动/元宵_辞旧迎新.lua', NPC)
            if hh then
                return 对话2
            end
            return
        end
        return "我认识你么？"
    end
end

local _怪物 = {
    { 名称 = "大祭司", 外形 = 2283, 气血 = 1200000, 魔法 = 1, 攻击 = 99991, 速度 = 1000, 战斗方向 = 3 },

}
function 任务:战斗初始化(玩家, NPC)
    local r = 玩家:取任务('元宵_辞旧迎新')
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    if r then
        local 怪物属性 = {
            外形 = NPC.外形,
            名称 = NPC.名称,
            等级 = 等级,
            战斗方向 = 3,
            气血 = 56544 + 转生 * 150000 + 等级 * 5000,
            魔法 = 26000,
            攻击 = 10 + 等级 * 2,
            速度 = 5 + 等级 * 1,
            抗性 = { 物理吸收 = 20, 抗雷 = 10, 抗火 = 10, 抗风 = 10, 抗震慑 = 23 },
            技能 = {
                { 名称 = '太乙生风', 熟练度 = 10000 }, { 名称 = '龙啸九天', 熟练度 = 10000 },
                { 名称 = '三味真火', 熟练度 = 10000 }, { 名称 = '断肠烈散', 熟练度 = 10000 },

            },
            施法几率 = 50,
            是否消失 = false,
            --内丹 = { '乘风破浪' }
        }


        self:加入敌方(1, 生成战斗怪物(怪物属性))
        -- for i, v in ipairs(_怪物) do
        --     if i == 1 then
        --         v.外形 = NPC.外形
        --         v.名称 = NPC.名称
        --     end
        --     self:加入敌方(i, 生成战斗怪物(v))
        -- end
    end
end

function 任务:进场喊话()
    local dd = self:取对象(11)
    if dd then
        dd:当前喊话("背对你们,是因为我最舍不得的人就是你们#52")
    end
end

function 任务:战斗回合开始(dt)


end

function 任务:战斗结束(s)
    for k, v in self:遍历我方() do
        if v.是否玩家 then
            local r = v.对象.接口:取任务("元宵_辞旧迎新")
            if r then
                r:完成(v.对象.接口, s)
            end
        end
    end
end

return 任务
