-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-01 12:16:40
-- @Last Modified time  : 2022-09-07 15:17:32


local 任务 = {
    名称 = '元宵_团员年饭',
    别名 = '团员年饭',
    类型 = '节日任务'
}
function 任务:任务初始化(玩家, ...)
    self.进度 = 1
end

function 任务:任务更新(玩家, sec)
end

function 任务:任务取详情(玩家)
    return '#Y任务目的:#r#W前往#Y长寿村(83,146)#W向#G#u#[1070|83|146|$年货小贩#]#u#W购买一些年货来让灶王爷给你烧顿美味的年夜饭吧！'
end

local _任务类型 = { "元宵_新春祭祖", "元宵_童心祝福", "元宵_团员年饭", "元宵_亲友拜年",
    "元宵_辞旧迎新" }
local _提示 = "过年了,我要告诉你个好消息——灶王爷亲自下凡来给大家煮年夜饭了#89，听说长寿村的年货小贩专门卖这些好吃的,不过找他买东西也是要凭胆识和策略的,快去试试吧吧#107"


function 任务:添加任务(玩家)
    if 玩家.是否组队 then
        local t = {}
        for _, v in 玩家:遍历队伍() do
            if v:判断等级是否低于(10) then --or not v:剧情称谓是否存在(8)
                table.insert(t, v.名称)
            end
        end
        if #t > 0 then
            玩家:常规提示('#Y' .. table.concat(t, '、 ') .. '#W低于10级,无法领取')
            return
        end
        for _, v in 玩家:遍历队伍() do
            for _, name in pairs(_任务类型) do
                if v:取任务(name) then
                    table.insert(t, v.名称)
                end
            end
        end
        if #t > 0 then
            玩家:常规提示('#Y' .. table.concat(t, '、 ') .. '已有此任务,无法重复领取')
            return
        end
        self.队伍 = {}
        for k, v in 玩家:遍历队伍() do
            table.insert(self.队伍, v.nid)
            v.其它.元宵次数 = v.其它.元宵次数 + 1
            if v.其它.元宵次数 > 6 then
                v.其它.元宵次数 = 1
            end
            v:添加任务(self)
        end
    else
        if 玩家:判断等级是否低于(10) then
            玩家:常规提示('#Y低于10级,无法领取')
            return
        end
        for _, name in pairs(_任务类型) do
            if 玩家:取任务(name) then
                玩家:常规提示('#Y已有此任务,无法重复领取')
                return
            end
        end
        self.队伍 = {}
        table.insert(self.队伍, 玩家.nid)
        玩家.其它.元宵次数 = 玩家.其它.元宵次数 + 1
        if 玩家.其它.元宵次数 > 6 then
            玩家.其它.元宵次数 = 1
        end
        玩家:添加任务(self)
    end

    self.时间 = os.time() + 30 * 60
    self.队长 = 玩家.名称
    -- self.MAP = map.id
    self.次数 = 玩家.其它.元宵次数
    self.x = X
    self.y = Y
    return string.format(_提示, self.位置)
end

function 任务:商店1(玩家)
    self.商品 = {

        { 类别 = "道具", 名称 = "鲫鱼", 价格 = 100000 },
        { 类别 = "道具", 名称 = "面粉", 价格 = 100000 },
        { 类别 = "道具", 名称 = "桃子", 价格 = 100000 },
        { 类别 = "道具", 名称 = "糯米", 价格 = 100000 },



    }


end

function 任务:刷新商店(玩家)
    if not self.商品 then
        self:商店1(玩家)
    end

    local fd = math.random(50, 160)
    for i, v in ipairs(self.商品) do
        self.商品[i].价格 = math.floor(100000 * fd * 0.01)
    end




end

function 任务:取商品(玩家)
    return self.商品
end

function 任务:完成(玩家)
    if 玩家.是否组队 then
        for _, v in 玩家:遍历队伍() do
            local r = v:取任务("元宵_团员年饭")
            if r then
                r:被动完成(v)
            end
        end
    end



    self:掉落包(玩家)
    self:删除()
end

function 任务:被动完成(玩家)
    self:掉落包(玩家)
    self:删除()

end

local _掉落 = {
    { 几率 = 200, 名称 = '九彩云龙珠', 数量 = 1, 参数 = 130 },
    { 几率 = 200, 名称 = '内丹精华', 数量 = 1 },
    { 几率 = 200, 名称 = '血玲珑', 数量 = 1, 参数 = 125 },
    { 几率 = 300, 名称 = '千年寒铁', 数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 300, 名称 = '天外飞石', 数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 310,名称 = "帮派成就册",参数 = 1000,  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 320, 名称 = '盘古精铁', 数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    --{ 几率 = 55,名称 = "高级藏宝图",  数量 = 1, 广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
    { 几率 = 5,名称 = "修正卡",  数量 = 1,  },
    { 几率 = 50, 名称 = "更名卡", 数量 = 1, },
    { 几率 = 100,名称 = "刮刮乐", 数量 = 1, },
    
    --{ 几率 = 3,名称 = "神兵石",  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 10,名称 = "超级星梦石",  数量 = 1, },
    { 几率 = 3,名称 = "筋骨提气丸",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 10,名称 = "九转易筋丸",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 10,名称 = "伐骨洗髓丹",  数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 15,名称 = "高级金柳露",  数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 15,名称 = "混元丹",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 4,名称 = "超级金柳露",  数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 4,名称 = "龙之骨",  数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
   -- { 几率 = 15,名称 = "武帝袍", 参数 = 11,  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
   -- { 几率 = 15,名称 = "灵犀角", 参数 = 11,  数量 = 1,  广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
   -- { 几率 = 15,名称 = "云罗帐", 参数 = 11,  数量 = 1, 广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
  --  { 几率 = 15,名称 = "盘古石", 参数 = 11,  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 200,名称 = "武帝袍", 参数 = 9,  数量 = 1},
    { 几率 = 200,名称 = "灵犀角", 参数 = 9,  数量 = 1, },
    { 几率 = 200,名称 = "云罗帐", 参数 = 9,  数量 = 1, },
    { 几率 = 200,名称 = "盘古石", 参数 = 9,  数量 = 1, },
    { 几率 = 300,名称 = "神兽丹",  数量 = 1,  },
    { 几率 = 300,名称 = "凝精聚气丹",  数量 = 1, },
    { 几率 = 150,名称 = "人参果王",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 150,名称 = "蟠桃王",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 500,名称 = "千年寒铁",  数量 = 1, },
    { 几率 = 500,名称 = "天外飞石",  数量 = 1, },
    { 几率 = 400,名称 = "盘古精铁",  数量 = 1, },
    { 几率 = 400,名称 = "补天神石",  数量 = 1, 广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    --{ 几率 = 1,名称 = "神兵礼盒",  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    --{ 几率 = 1,名称 = "守护宝卷",  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    --{ 几率 = 1,名称 = "超级变色丹",  数量 = 1, 广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
   -- { 几率 = 1,名称 = "超级元气丹",  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 5,名称 = "轻盈果", 参数 = 500,  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 250,名称 = "天书残卷第一卷",  数量 = 1, },
    { 几率 = 250,名称 = "天书残卷第二卷",  数量 = 1, },
    { 几率 = 250,名称 = "天书残卷第三卷",  数量 = 1, },
    { 几率 = 250,名称 = "天书残卷第四卷",  数量 = 1, },
    { 几率 = 250,名称 = "天书残卷第五卷",  数量 = 1, },
    { 几率 = 250,名称 = "天书残卷第六卷",  数量 = 1, },
    { 几率 = 100,名称 = "见闻录",  数量 = 1, },
    { 几率 = 50,名称 = "六脉化神丸",  数量 = 1, },
    { 几率 = 150,名称 = "亲密丹",  数量 = 1, },
    { 几率 = 30,名称 = "月光宝盒",  数量 = 1,广播 = '#C%s#c00FFFF贺岁福星任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
}


local _次数上限 = 100
function 任务:掉落包(玩家, 次数)
    if 玩家:取活动限制次数('贺岁福星') > _次数上限 then
        玩家:常规提示("#Y今日已经完成%s次，无法获得奖励", _次数上限)
        return
    end
    玩家:增加活动限制次数('贺岁福星')
    local 银子 = math.floor(5000)
    local 经验 = math.floor(984521)
    local 法宝经验 = math.floor(140)
    玩家:添加任务经验(经验, "贺岁福星")
    玩家:添加银子(银子, "贺岁福星")




    local 总几率 = math.random(1000)
    local 几率=0
    for i, v in ipairs(_掉落) do
        几率=几率+v.几率
        if 总几率 <= 几率 then
            if v.召唤 then
                local zh = 生成召唤 { 名称 = v.名称 }
                if 玩家:添加召唤(zh) then
                    if v.广播 then
                        玩家:发送系统(v.广播, 玩家.名称, zh.nid, zh.名称)
                    end
                end
            else
                local r = 生成物品 { 名称 = v.名称, 数量 = v.数量, 参数 = v.参数, 禁止交易 = v.禁止交易 }
                if r then
                    玩家:添加物品({ r })
                    if v.广播 then
                        玩家:发送系统(v.广播, 玩家.名称, r.nid, r.名称)
                    end
                end
            end
            break
        end
    end
end

return 任务
-- 商店1
-- 刷新商店
