local 任务 = {
    名称 = '春节_元气蛋',
    别名 = '万灵续脉',
    类型 = '节日任务'
}

function 任务:任务初始化(玩家, ...)
    self.进度 = 0
end

function 任务:任务更新(sec, 玩家)
end

local _详情 = "化生寺的空慈方丈受天神旨意显化人间，为三族血脉子嗣延续寻找机缘，希望寻得三界侠士帮忙孵化#R元气蛋#W延续血脉。传闻#R元气蛋#W可以自主吸收妖魔的元气，当吸纳到足够的元气后即可孵化。\n任务状态：#r元气：%s/140"
function 任务:任务取详情(玩家)
    return _详情:format(self.进度)
end

function 任务:任务取消(玩家)

end

local _小掉落 = {
    { 几率 = 10, 名称 = '盘古精铁', 数量 = 1 },
    { 几率 = 20, 名称 = '内丹精华', 数量 = 1 },
    { 几率 = 40, 名称 = '九彩云龙珠', 数量 = 1, 参数 = 130 },
    { 几率 = 30, 名称 = '血玲珑', 数量 = 1 },
    { 几率 = 30, 名称 = '千年寒铁', 数量 = 1 },
    { 几率 = 10, 名称 = '人参果', 数量 = 1, 禁止交易 = true },
    { 几率 = 30, 名称 = '神兽丹', 数量 = 1 },
    { 几率 = 40, 名称 = '凝精聚气丹', 数量 = 1 },
}


function 任务:掉落包1(玩家)
    玩家:添加任务经验(68541, "孵蛋")
    玩家:添加银子(1000, "孵蛋")


    local 总几率 = math.random(1000)
    local 几率 = 0
    for i, v in ipairs(_小掉落) do
        几率 = 几率 + v.几率
        if 总几率 <= 几率 then
            local r = 生成物品 { 名称 = v.名称, 数量 = v.数量, 参数 = v.参数, 禁止交易 = v.禁止交易 }
            if r then
                玩家:添加物品({ r })
                if v.广播 then
                    玩家:发送系统(v.广播, 玩家.名称, r.nid, r.名称)
                end
                break
            end
        end
    end
end

local _物品掉落 = {
    { 几率 = 450, 名称 = '元气丹', 数量 = 1,
        广播 = "#Y卿云烂兮，糺缦缦兮#42#Y日月光华，旦复旦兮。%s的元气蛋吸收妖魔灵气变成了一个#G#m(%s)[%s]#m#n#47" },
    { 几率 = 450, 名称 = '变色丹', 数量 = 1,
        广播 = "#Y卿云烂兮，糺缦缦兮#42#Y日月光华，旦复旦兮。%s的元气蛋吸收妖魔灵气变成了一个#G#m(%s)[%s]#m#n#47" },
    { 几率 = 2, 名称 = '超级变色丹', 数量 = 1,
        广播 = "#Y卿云烂兮，糺缦缦兮#42#Y日月光华，旦复旦兮。%s的元气蛋吸收妖魔灵气变成了一个#G#m(%s)[%s]#m#n#47" },
    { 几率 = 2, 名称 = '超级元气丹', 数量 = 1,
        广播 = "#Y卿云烂兮，糺缦缦兮#42#Y日月光华，旦复旦兮。%s的元气蛋吸收妖魔灵气变成了一个#G#m(%s)[%s]#m#n#47" },
    { 几率 = 20, 名称 = '神兵礼盒', 数量 = 1, 参数 = 1,
        广播 = "#Y卿云烂兮，糺缦缦兮#42#Y日月光华，旦复旦兮。%s的元气蛋吸收妖魔灵气变成了一个#G#m(%s)[%s]#m#n#47" },

    { 几率 = 1000, 名称 = '亲密丹', 数量 = 3, 参数 = 10000,
        广播 = "#Y卿云烂兮，糺缦缦兮#42#Y日月光华，旦复旦兮。%s的元气蛋吸收妖魔灵气变成了三个#G#m(%s)[%s]#m#n#47" },

}

-- local _神兽1 = { '超级蟾蜍', '龙太子', '超级蝙蝠', '紫霞仙子', '超级蜘蛛', '青霞仙子', '超级毒蛇',
--     '春三十娘', '牛魔王', '超级飞鱼', '白晶晶', '超级海龟', '泾河龙王', '至尊小宝' }


-- local _神兽2 = { '千年灵狐', '龙门水将', '护山大神', '千年灵狐', '龙门水将', '护山大神', '玉兔',
--     '蟹将军', '黄巾力士', '百花之灵', '渔见愁', '霹雳手', '狐不皈', ' 狐不皈', '避水金睛兽',
--     '火麒麟', '桃花娘子', '女贼之灵', '巡海夜叉', '金身罗汉', '净盘使者' }

-- local _神兽3 = { '浪淘沙', '五叶', '垂云叟', '颜如玉', '五叶', '垂云叟', '颜如玉', '五叶', '垂云叟',
--     '颜如玉', '五叶', '垂云叟', '颜如玉', '范式之魂' }

local _召唤掉落 = {
    { 几率 = 10, 名称 = '冥灵妃子', 数量 = 1,
        广播 = "#C【祥兔贺岁，福临万家】玩家#R%s#C正忙于给各路天官拜年，一扭头，竟然发现一只#G#m(%s)[%s]#m#n#C来到身边，声声低吼，既是认主，亦是拜年！" },
    { 几率 = 0, 名称 = '超级蝙蝠', 数量 = 1,
        广播 = "#C【祥兔贺岁，福临万家】玩家#R%s#C正忙于给各路天官拜年，一扭头，竟然发现一只#G#m(%s)[%s]#m#n#C来到身边，声声低吼，既是认主，亦是拜年！" },
    { 几率 = 0, 名称 = '五叶', 数量 = 1,
        广播 = "#C【祥兔贺岁，福临万家】玩家#R%s#C正忙于给各路天官拜年，一扭头，竟然发现一只#G#m(%s)[%s]#m#n#C来到身边，声声低吼，既是认主，亦是拜年！" },
    { 几率 = 0, 名称 = '五叶', 数量 = 1,
        广播 = "#C【祥兔贺岁，福临万家】玩家#R%s#C正忙于给各路天官拜年，一扭头，竟然发现一只#G#m(%s)[%s]#m#n#C来到身边，声声低吼，既是认主，亦是拜年！" },




}
local _元气蛋唤兽 = { "飞鱼", "蟾蜍", "毒蛇", "蝙蝠",
    "兔妖", "狮蝎", "羊头怪", "猪怪", "夜叉", "家丁", "小妖",
    "牛妖", "野狗", "武士", "流氓", "鱼怪", "花妖", "士兵", "衙役", "女贼", "狐狸精", "毒蜂", "女妖",
    "山贼", "小龙女",
    "骷髅怪", "鸡精", "千年老妖", "战神女娲", "鳄鱼", "狮子", "大象",
    "大鹏", "银狐", "老虎", "强盗", "黑熊", "树妖",
    "蛤蟆精", "虾兵", "蟹将", "打手", "龟丞相", "黑熊精", "水妖", "复活女娲", "无头鬼", "无身鬼",
    "吸血鬼", "野鬼",
    "冤魂", "孤魂", "幽灵", "修罗", "符咒女娲", "冰熊", "白虎", "两角怪", "三尾怪", "蜘蛛精",
    "冲冲虫", "鸟嘴兽",
    "精怪", "山妖", "蝴蝶仙子", "古代瑞兽", "鼠怪", "雷鸟人", "寒钢怪", "独眼巨人",
    "野蛮王", "死灵", "火神女娲",
    "地狱战神", "蛟龙", "凤凰", "神兵", "舍生女娲", "神灵", "桃树精", "桃花仙", "金刚仙",
    "食土兽",
    "水灵仙", "喷火牛", "赤焰妖", "蜘蛛", "海龟",
}

function 任务:掉落包2(玩家)


    local 总几率 = math.random(1000)
    local 几率 = 0
    for i, v in ipairs(_物品掉落) do
        几率 = 几率 + v.几率
        if 总几率 <= 几率 then
            local r = 生成物品 { 名称 = v.名称, 数量 = v.数量, 参数 = v.参数, 禁止交易 = v.禁止交易 }
            if r then
                if 玩家:添加物品_无提示({ r }) then
                    玩家:常规提示("恭喜你,你的“元气蛋”居然孵化成了只传说中#G%s",
                        (r.原名 or r.名称))
                    if v.广播 then
                        玩家:发送系统(v.广播, 玩家.名称, r.nid, (r.原名 or r.名称))
                    end
                    break
                end
            end
        end
    end
end

function 任务:添加元气(玩家)
    -- local r = 玩家:取物品是否存在("元气蛋")
    -- if r then
    --     r:减少(1)
    -- else

    -- end
    -- self:删除()
    -- if 1 == 1 then
    --     玩家:常规提示("你的活动物品已失效！")
    --   return
    -- end

    self.进度 = self.进度 + 1
    if self.进度 > 140 then
        self.进度 = 140
    end
    if math.fmod(self.进度 - 1, 10) == 10 then
        玩家:常规提示("你的“元气蛋” 吸纳了妖魔的元气， 似乎有所变化！")
    end
    local jl = false
    if self.进度 > 120 and math.random(100) <= math.floor((self.进度 - 120) * 5) then
        jl = true
    end
    if not jl then
        self:掉落包1(玩家)
    else
        local r = 玩家:取物品是否存在("元气蛋")
        if r then
            r:减少(1)
        end
        if math.random(100) < 60 then --物品奖励
            self:掉落包2(玩家)
            self:完成(玩家)
        else --召唤兽奖励
            local name = _元气蛋唤兽[math.random(#_元气蛋唤兽)]
            local x = math.random(2000)
            if x < 2 then
                name = _神兽3[math.random(#_神兽3)]
            elseif x < 4 then
                name = _神兽2[math.random(#_神兽2)]
            elseif x < 11 then
                name = _神兽1[math.random(#_神兽1)]
            end
            -- for i, v in ipairs(_召唤掉落) do
            --     if math.random(1000) <= v.几率 then
            --         name = v.名称
            --         break
            --     end
            -- end

            if name then
                local zh = 生成召唤 { 名称 = name }
                if 玩家:添加召唤(zh) then
                    玩家:常规提示("#Y恭喜你,你的“元气蛋”居然孵化成了只传说中#G%s",
                        (zh.原名 or zh.名称))
                    玩家:发送系统("#C【祥兔贺岁，福临万家】玩家#R%s#C正忙于给各路天官拜年，一扭头，竟然发现一只#G#m(%s)[%s]#m#n#C来到身边，声声低吼，既是认主，亦是拜年！"
                        , 玩家.名称, zh.nid, (zh.原名 or zh.名称))
                    self:完成(玩家)
                end
            end
        end
    end
end

function 任务:完成(玩家)




    self:删除()
end

function 任务:添加任务(玩家)
    if 玩家:添加物品({ 生成物品 { 名称 = '元气蛋' } }) then
        玩家:增加活动限制次数("孵蛋")
        玩家:添加任务(self)
        return true
    else
        return "请保留一个物品栏"
    end
end

return 任务
