-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-01 12:16:40
-- @Last Modified time  : 2022-09-07 15:17:32

local 任务 = {
    名称 = '清明_侍魂_恶鬼',
    别名 = '明火侍魂归',
    类型 = '节日任务'

}

function 任务:任务初始化(玩家, ...)
    self.进度 = 1
end

function 任务:任务上线(玩家)
    if self.时间 < os.time() then
        self:删除()
    end
end

function 任务:任务更新(sec)
    if self.时间 < sec then
        self:删除()
    end
end

function 任务:任务取消(玩家)

end

function 任务:任务取详情(玩家)
    return string.format("你招出的#G%s#W正在#R%s#W游荡", self.寻路, self.位置)
end

-- local _怪物外形 = {
--     { 2115, 2113 }, --善鬼
--     { 2052, 2053 }, --恶鬼
--     { 2049, 2051 }, --无名之魂

-- }
-- local _怪物名称 = {
--   --  { "李清照之魂", "屈原之魂", "刘伶之魂" }, --善鬼
--     { "恶鬼之魂" }, --恶鬼
--    -- { "无名之魂" }, --无名之魂

-- }
local _怪物外形 = { 2052, 2053 }
--长安城东，大唐境内，五指山，斧头帮，普陀山，大唐边境，长寿村，长寿村外
function 任务:添加任务(玩家)
    local map = 玩家:取当前地图()

    if not map then
        return
    end
    local X, Y = 玩家.X, 玩家.Y
    if not X then
        return
    end
    self.怪名 = "恶鬼之魂"
    self.外形 = _怪物外形[math.random(#_怪物外形)]
    self.位置 = string.format('%s#Y(%d,%d)', map.名称, X, Y)
    self.寻路 = string.format('#u#[%s|%s|%s|$%s#]#u', map.id, X, Y, self.怪名)
    self.时间 = os.time() + 30 * 60
    self.队伍 = {}
    for k, v in 玩家:遍历队伍() do
        table.insert(self.队伍, v.nid)
        v:添加任务(self)
    end
    self.NPC =
    map:添加NPC {
        队伍 = self.队伍,
        人数 = #self.队伍,
        名称 = self.怪名,
        外形 = self.外形,
        脚本 = 'scripts/task/节日活动/清明_侍魂_恶鬼.lua',
        时间 = 1800,
        任务类型 = "清明_侍魂_恶鬼",
        X = X,
        Y = Y,
        来源 = self
    }
    self.队长 = 玩家.名称
    self.MAP = map.id
    self.x = X
    self.y = Y
    return true
end

function 任务:完成(玩家)
    self:掉落包(玩家)
    self:删除()
end

local _掉落 = {
    { 几率 = 200, 名称 = '九彩云龙珠', 数量 = 1, 参数 = 130 },
    { 几率 = 200, 名称 = '内丹精华', 数量 = 1 },
    { 几率 = 200, 名称 = '血玲珑', 数量 = 1, 参数 = 125 },
    { 几率 = 300, 名称 = '千年寒铁', 数量 = 1, 广播 = '#C%s#c00FFFF在侍魂任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 300, 名称 = '天外飞石', 数量 = 1, 广播 = '#C%s#c00FFFF在侍魂任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 310, 名称 = "帮派成就册", 参数 = 1000, 数量 = 1,
        广播 = '#C%s#c00FFFF在侍魂任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 320, 名称 = '盘古精铁', 数量 = 1, 广播 = '#C%s#c00FFFF在侍魂任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    --{ 几率 = 55,名称 = "高级藏宝图",  数量 = 1, 广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
    { 几率 = 5, 名称 = "修正卡", 数量 = 1, },
    { 几率 = 50, 名称 = "更名卡", 数量 = 1, },
    { 几率 = 100, 名称 = "刮刮乐", 数量 = 1, },

    --{ 几率 = 3,名称 = "神兵石",  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 10, 名称 = "超级星梦石", 数量 = 1, },
    { 几率 = 3, 名称 = "筋骨提气丸", 数量 = 1, 广播 = '#C%s#c00FFFF在侍魂任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 10, 名称 = "九转易筋丸", 数量 = 1, 广播 = '#C%s#c00FFFF在侍魂任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 10, 名称 = "伐骨洗髓丹", 数量 = 1, 广播 = '#C%s#c00FFFF在侍魂任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 15, 名称 = "高级金柳露", 数量 = 1, 广播 = '#C%s#c00FFFF在侍魂任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 15, 名称 = "混元丹", 数量 = 1, 广播 = '#C%s#c00FFFF在侍魂任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 4, 名称 = "超级金柳露", 数量 = 1, 广播 = '#C%s#c00FFFF在侍魂任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 4, 名称 = "龙之骨", 数量 = 1, 广播 = '#C%s#c00FFFF在侍魂任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    -- { 几率 = 15,名称 = "武帝袍", 参数 = 11,  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
    -- { 几率 = 15,名称 = "灵犀角", 参数 = 11,  数量 = 1,  广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
    -- { 几率 = 15,名称 = "云罗帐", 参数 = 11,  数量 = 1, 广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
    --  { 几率 = 15,名称 = "盘古石", 参数 = 11,  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 200, 名称 = "武帝袍", 参数 = 9, 数量 = 1 },
    { 几率 = 200, 名称 = "灵犀角", 参数 = 9, 数量 = 1, },
    { 几率 = 200, 名称 = "云罗帐", 参数 = 9, 数量 = 1, },
    { 几率 = 200, 名称 = "盘古石", 参数 = 9, 数量 = 1, },
    { 几率 = 300, 名称 = "神兽丹", 数量 = 1, },
    { 几率 = 300, 名称 = "凝精聚气丹", 数量 = 1, },
    { 几率 = 150, 名称 = "人参果王", 数量 = 1, 广播 = '#C%s#c00FFFF在侍魂任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 150, 名称 = "蟠桃王", 数量 = 1, 广播 = '#C%s#c00FFFF在侍魂任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 500, 名称 = "千年寒铁", 数量 = 1, },
    { 几率 = 500, 名称 = "天外飞石", 数量 = 1, },
    { 几率 = 400, 名称 = "盘古精铁", 数量 = 1, },
    { 几率 = 400, 名称 = "补天神石", 数量 = 1, 广播 = '#C%s#c00FFFF在侍魂任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    --{ 几率 = 1,名称 = "神兵礼盒",  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    --{ 几率 = 1,名称 = "守护宝卷",  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    --{ 几率 = 1,名称 = "超级变色丹",  数量 = 1, 广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!'},
    -- { 几率 = 1,名称 = "超级元气丹",  数量 = 1,广播 = '#C%s#c00FFFF在天宫寻宝中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
    { 几率 = 5, 名称 = "轻盈果", 参数 = 500, 数量 = 1,
        广播 = '#C%s#c00FFFF在侍魂任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!', },
    { 几率 = 250, 名称 = "天书残卷第一卷", 数量 = 1, },
    { 几率 = 250, 名称 = "天书残卷第二卷", 数量 = 1, },
    { 几率 = 250, 名称 = "天书残卷第三卷", 数量 = 1, },
    { 几率 = 250, 名称 = "天书残卷第四卷", 数量 = 1, },
    { 几率 = 250, 名称 = "天书残卷第五卷", 数量 = 1, },
    { 几率 = 250, 名称 = "天书残卷第六卷", 数量 = 1, },
    { 几率 = 100, 名称 = "见闻录", 数量 = 1, },
    { 几率 = 50, 名称 = "六脉化神丸", 数量 = 1, },
    { 几率 = 150, 名称 = "亲密丹", 数量 = 1, },
    { 几率 = 30, 名称 = "月光宝盒", 数量 = 1, 广播 = '#C%s#c00FFFF在侍魂任务中表现出色，赐予#G#m(%s)[%s]#m#n#c00FFFF以示鼓励!' },
}

local _次数上限 = 100
function 任务:掉落包(玩家, 次数)
    if 玩家:取活动限制次数('侍魂归') > _次数上限 then
        玩家:常规提示("#Y今日已经完成%s次，无法获得奖励", _次数上限)
        return
    end
    玩家:增加活动限制次数('侍魂归')

    local 银子 = math.floor(50000)
    local 经验 = math.floor(1284521)
    local 法宝经验 = math.floor(140)
    玩家:添加任务经验(经验, "侍魂归")
    玩家:添加银子(银子, "侍魂归")
    if 玩家:取活动限制次数('侍魂归') % 2 ~= 0 then
        return
    end


    local 总几率 = math.random(1000)
    local 几率=0
    for i, v in ipairs(_掉落) do
        几率=几率+v.几率
        if 总几率 <= 几率 then
            local r = 生成物品 { 名称 = v.名称, 数量 = v.数量, 参数 = v.参数, 禁止交易 = v.禁止交易 }
            if r then
                玩家:添加物品({ r })
                if v.广播 then
                    玩家:发送系统(v.广播, 玩家.名称, r.nid, r.名称)
                end
                break
            end
        end
    end
end

local 对话 = [[好大的胆子,居然敢在阳间随意招魂，#4
menu
1|要你管
2|你稍微等我下哦
]]

function 任务:NPC对话(玩家, NPC)
    if NPC.任务类型 == "清明_侍魂_恶鬼" then
        local r = 玩家:取任务("清明_侍魂_恶鬼")
        if r and r.NPC == NPC.nid then
            return 对话
        end
        return "我认识你么？"
    end
end

function 任务:NPC菜单(玩家, i, NPC)
    if i == '1' then
        local r = 玩家:进入战斗('scripts/task/节日活动/清明_侍魂_恶鬼.lua', self)
        if r then
            self:删除()
            return
        end
    end
end

function 任务:任务攻击事件(玩家, NPC)
    if NPC.任务类型 == "清明_侍魂_恶鬼" then
        local r = 玩家:取任务("清明_侍魂_恶鬼")
        if r and r.NPC == NPC.nid then
            local hh = 玩家:进入战斗('scripts/task/节日活动/清明_侍魂_恶鬼.lua', NPC)
            if hh then
                NPC:删除()
                return
            end
        else
            return "我认识你么？"
        end
    end
end

local _怪物 = {
    { 名称 = "大祭司", 外形 = 2283, 气血 = 1, 魔法 = 1, 攻击 = 99991, 速度 = 1000, 战斗方向 = 3 },

}
function 任务:战斗初始化(玩家, NPC)
    local r = 玩家:取任务('清明_侍魂_恶鬼')
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    if r then
        怪物属性 = {
            外形 = NPC.外形,
            名称 = NPC.名称,
            等级 = 等级,
            气血 = 80000 + 转生 * 50000 + 等级 * 1000,
            魔法 = 36000,
            攻击 = 1000 + 转生 * 1000 + 等级 * 100,
            速度 = 100 + 转生 * 80 + 等级 * 10,
            抗性 = { 物理吸收 = 20, 抗雷 = -10, 抗火 = -10, 抗风 = -10, 抗震慑 = 13 },
            技能 = {
                { 名称 = '太乙生风', 熟练度 = 10000 }, { 名称 = '龙啸九天', 熟练度 = 10000 },
                { 名称 = '三味真火', 熟练度 = 10000 }, { 名称 = '断肠烈散', 熟练度 = 10000 },

            },
            施法几率 = 100,
            是否消失 = false,
            --内丹 = { '乘风破浪' }
        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))

        怪物属性 = {
            外形 = 2053,
            名称 = '马面',
            等级 = 等级,
            气血 = 80000 + 转生 * 50000 + 等级 * 1000,
            魔法 = 36000,
            攻击 = 1000 + 转生 * 1000 + 等级 * 100,
            速度 = 100 + 转生 * 80 + 等级 * 10,
            抗性 = { 物理吸收 = 20, 抗雷 = -10, 抗火 = -10, 抗风 = -10, 抗震慑 = 13 },
            技能 = {
                { 名称 = '太乙生风', 熟练度 = 10000 }, { 名称 = '龙啸九天', 熟练度 = 10000 },
                { 名称 = '三味真火', 熟练度 = 10000 },

            },
            施法几率 = 100,
            是否消失 = false,
            --内丹 = { '乘风破浪' }
        }

        self:加入敌方(2, 生成战斗怪物(怪物属性))

        怪物属性 = {
            外形 = 3058,
            名称 = '白无常',
            等级 = 等级,
            气血 = 80000 + 转生 * 50000 + 等级 * 1000,
            魔法 = 36000,
            攻击 = 1000 + 转生 * 1000 + 等级 * 100,
            速度 = 100 + 转生 * 80 + 等级 * 10,
            抗性 = { 物理吸收 = 20, 抗雷 = -10, 抗火 = -10, 抗风 = -10, 抗震慑 = 13 },
            技能 = {
                { 名称 = '太乙生风', 熟练度 = 10000 },
                { 名称 = '龙啸九天', 熟练度 = 10000 },
                { 名称 = '三味真火', 熟练度 = 10000 }
            },
            施法几率 = 100,
            是否消失 = false,
            --内丹 = { '乘风破浪' }
        }
        self:加入敌方(3, 生成战斗怪物(怪物属性))


        怪物属性 = {
            外形 = 3073,
            名称 = '黑无常',
            等级 = 等级,
            气血 = 80000 + 转生 * 50000 + 等级 * 1000,
            魔法 = 36000,
            攻击 = 1000 + 转生 * 1000 + 等级 * 100,
            速度 = 100 + 转生 * 80 + 等级 * 10,
            抗性 = { 物理吸收 = 20, 抗雷 = -10, 抗火 = -10, 抗风 = -10, 抗震慑 = 5 },
            技能 = {
                { 名称 = '太乙生风', 熟练度 = 10000 }, { 名称 = '龙啸九天', 熟练度 = 10000 },
                { 名称 = '三味真火', 熟练度 = 10000 },

            },
            施法几率 = 100,
            是否消失 = false,
            --内丹 = { '乘风破浪' }
        }
        self:加入敌方(4, 生成战斗怪物(怪物属性))
        怪物属性 = {
            外形 = 2055,
            名称 = '野鬼',
            等级 = 等级,
            气血 = 80000 + 转生 * 50000 + 等级 * 1000,
            魔法 = 36000,
            攻击 = 1000 + 转生 * 1000 + 等级 * 100,
            速度 = 100 + 转生 * 80 + 等级 * 10,
            抗性 = { 物理吸收 = 20, 抗雷 = -10, 抗火 = -10, 抗风 = -10, 抗震慑 = 5 },
            技能 = {
                { 名称 = '太乙生风', 熟练度 = 10000 }, { 名称 = '龙啸九天', 熟练度 = 10000 },
                { 名称 = '三味真火', 熟练度 = 10000 },

            },
            施法几率 = 100,
            是否消失 = false,
            --内丹 = { '乘风破浪' }
        }
        self:加入敌方(5, 生成战斗怪物(怪物属性))




    end












end

function 任务:进场喊话()

end

function 任务:战斗回合开始(dt)


end

function 任务:战斗结束(s)
    if s then
        for k, v in self:遍历我方() do
            if v.是否玩家 then
                local r = v.对象.接口:取任务("清明_侍魂_恶鬼")
                if r then
                    r:完成(v.对象.接口, s)
                end
            end
        end
    end

end

return 任务
