local 任务 = {
    名称 = '引导_称谓剧情',
    别名 = '称谓剧情引导',
    类型 = '引导任务',
    是否可取消 = false,
    检测 = {}
}

local _详情 = {
    [1] = '等级达到#G10级#W后可以领取第一个称谓任务，任务领取人#G魏征#W、#G杜老板#W、#G袁天罡#W、#G程夫人#W。',
    [2] = '等级达到#G10级#W后可以领取第二个称谓任务，任务领取人#G魏征#W、#G袁天罡#W、#G空慈方丈#W。',
    [3] = '等级达到#G10级#W后可以领取第三个称谓任务，任务领取人#G晶晶姑娘#W、#G二当家#W、#G三当家#W。',
    [4] = '等级达到#G35级#W后可以领取第四个称谓任务，任务领取人#G玉皇大帝#W、#G王母娘娘#W、#G幸存者#W、#G高老先生#W。',
    [5] = '等级达到#G40级#W后可以领取第五个称谓任务，任务领取人#Y魔王寨#W的#G雷鸟#W、#G牛妖#W。',
    [6] = '等级达到#G45级#W后可以领取第六个称谓任务，任务领取人#Y方寸山#W的#G道士#W、#G陈百万#W、#G游方术士#W。',
    [7] = '等级达到#G50级#W后可以领取第七个称谓任务，任务领取人#Y化生寺#W的#G玄空#W、#Y北俱芦洲#W的#G沙铁匠#W。',
    [8] = '等级达到#G55级#W后可以领取第八个称谓任务，任务领取人#Y龙窟七层#W的#G孙悟空#W。',
    [9] = '等级达到#G70级#W后可以领取第九个称谓任务，任务领取人#G玉皇大帝#W、#G至尊小宝#W、#G采星仙女#W。',
    [10] = '等级达到#G75级#W后可以领取第十个称谓任务，任务领取人#Y龙窟七层#W的#G孙悟空#W。',
    [11] = '等级达到#G1转90级#W后可以领取第十一个称谓任务，任务领取人#G李世民#W、#G夕阳武士#W、#G紫霞#W。',
    [12] = '等级达到#G1转95级#W后可以领取第十二个称谓任务，任务领取人#Y四圣庄#W的#G老夫人#W、#G刘伯钦#W、#Y大唐境内#W的#G殷温娇#W。',
    [13] = '等级达到#G2转105级#W后可以领取第十三个称谓任务，任务领取人#Y五庄观#W的#G明月#W、#Y普陀山#W的#G仙女姐姐#W。',
    [14] = '等级达到#G2转115级#W后可以领取第十四个称谓任务，任务领取人#Y五指山#W的#G五指山土地#W。',
}

local _称谓剧情列表 = {
    '一称',
    '二称',
    '三称',
    '四称',
    '五称',
    '六称',
    '七称',
    '八称',
    '九称',
    '十称',
    '十一称',
    '十二称',
    '十三称',
    '十四称',
}

local _称谓触发要求 = {
    [1] = { 转生 = 0, 等级 = 10 },
    [2] = { 转生 = 0, 等级 = 10 },
    [3] = { 转生 = 0, 等级 = 10 },
    [4] = { 转生 = 0, 等级 = 35 },
    [5] = { 转生 = 0, 等级 = 40 },
    [6] = { 转生 = 0, 等级 = 45 },
    [7] = { 转生 = 0, 等级 = 50 },
    [8] = { 转生 = 0, 等级 = 55 },
    [9] = { 转生 = 0, 等级 = 70 },
    [10] = { 转生 = 0, 等级 = 75 },
    [11] = { 转生 = 1, 等级 = 90 },
    [12] = { 转生 = 1, 等级 = 95 },
    [13] = { 转生 = 2, 等级 = 105 },
    [14] = { 转生 = 2, 等级 = 115 },
}

function 任务:判断是否满足下一称谓剧情(玩家)
    local 转生 = 玩家.转生
    local 等级 = 玩家.等级
    local 称谓剧情 = 玩家.称谓剧情 or 0
    local next称谓剧情 = 称谓剧情 + 1
    local next称谓触发要求 = _称谓触发要求[next称谓剧情]

    local 几称 = _称谓剧情列表[next称谓剧情]

    if not _详情[next称谓剧情] or not next称谓触发要求 then
        if not self.是否隐藏 then
            self.是否隐藏 = true
        end

        return false
    end

    if 转生 < next称谓触发要求.转生 then
        return false
    end

    if 等级 < next称谓触发要求.等级 then
        return false
    end

    if not self.检测 then
        self.检测 = {}
        return true
    end

    if not self.检测[几称] then
        return true
    end

    if self.检测[几称].添加 == 1 then
        return false
    end

    if self.是否隐藏 then
        self.是否隐藏 = false
    end
    return true
end

function 任务:添加称谓剧情任务(玩家)
    local 称谓剧情 = 玩家.称谓剧情 or 0
    local next称谓剧情 = 称谓剧情 + 1
    local 几称 = _称谓剧情列表[next称谓剧情]

    if next称谓剧情 == 1 then
        self.检测[几称].添加 = 1
        玩家:添加任务(生成任务 { 名称 = '称谓1_教训食婴鬼', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓1_教训飞贼', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓1_教训食婴鬼手下', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓1_失踪的小孩', 进度 = 0, 对话进度 = 0 })
    elseif next称谓剧情 == 2 then
        self.检测[几称].添加 = 1
        玩家:添加任务(生成任务 { 名称 = '称谓2_般若多罗密心经', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓2_定魂珠', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓2_水陆大会', 进度 = 0, 对话进度 = 0 })
    elseif next称谓剧情 == 3 then
        self.检测[几称].添加 = 1
        玩家:添加任务(生成任务 { 名称 = '称谓3_春三十娘', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓3_山贼之灵', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓3_羊脂仙露', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓3_夜光珠', 进度 = 0, 对话进度 = 0 })
    elseif next称谓剧情 == 4 then
        self.检测[几称].添加 = 1
        玩家:添加任务(生成任务 { 名称 = '称谓4_加入天兵', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓4_摄魂鬼', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓4_四琉璃碎片', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓4_滋扰高小姐的妖怪', 进度 = 0, 对话进度 = 0 })
    elseif next称谓剧情 == 5 then
        self.检测[几称].添加 = 1
        玩家:添加任务(生成任务 { 名称 = '称谓5_天宫名菜', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓5_天宫玉酒', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓5_找到紫霞', 进度 = 0, 对话进度 = 0 })
    elseif next称谓剧情 == 6 then
        self.检测[几称].添加 = 1
        玩家:添加任务(生成任务 { 名称 = '称谓6_孽缘', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓6_孽缘之海底妖尸', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓6_孽缘之思情', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓6_孽缘之太上老君', 进度 = 0, 对话进度 = 0 })
    elseif next称谓剧情 == 7 then
        self.检测[几称].添加 = 1
        玩家:添加任务(生成任务 { 名称 = '称谓7_玄天神鞭', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓7_拯救唐僧', 进度 = 0, 对话进度 = 0 })
    elseif next称谓剧情 == 8 then
        self.检测[几称].添加 = 1
        玩家:添加任务(生成任务 { 名称 = '称谓8_妙法莲华经', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓8_一万三千年之前', 进度 = 0, 对话进度 = 0 })
    elseif next称谓剧情 == 9 then
        self.检测[几称].添加 = 1
        玩家:添加任务(生成任务 { 名称 = '称谓9_斧头帮的白虎', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓9_抹杀孙悟空', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓9_蟠桃园的山妖', 进度 = 0, 对话进度 = 0 })
    elseif next称谓剧情 == 10 then
        self.检测[几称].添加 = 1
        玩家:添加任务(生成任务 { 名称 = '称谓10_九生九死', 进度 = 0, 对话进度 = 0 })
    elseif next称谓剧情 == 11 then
        self.检测[几称].添加 = 1
        玩家:添加任务(生成任务 { 名称 = '称谓11_佛家宝物', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓11_夕阳武士', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓11_紫霞的金铃', 进度 = 0, 对话进度 = 0 })
    elseif next称谓剧情 == 12 then
        self.检测[几称].添加 = 1
        玩家:添加任务(生成任务 { 名称 = '称谓12_度亡经', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓12_四圣戏禅心', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓12_玄奘身世', 进度 = 0, 对话进度 = 0 })
    elseif next称谓剧情 == 13 then
        self.检测[几称].添加 = 1
        玩家:添加任务(生成任务 { 名称 = '称谓13_取经路上', 进度 = 0, 对话进度 = 0 })
        玩家:添加任务(生成任务 { 名称 = '称谓13_偷吃人参果', 进度 = 0, 对话进度 = 0 })
    elseif next称谓剧情 == 14 then
        self.检测[几称].添加 = 1
        玩家:添加任务(生成任务 { 名称 = '称谓14_三打白骨精', 进度 = 0, 对话进度 = 0 })
    end
end

function 任务:称谓是否完成(几称)
    local 称谓 = _称谓剧情列表[几称]
    if self.检测[称谓].完成 == 1 then
        return true
    else
        return false
    end
end

function 任务:剧情称谓直接完成(玩家, 几称)
    if 几称 ~= 1 and not self:称谓是否完成(几称-1) then
        return false
    elseif 玩家:取任务('领取称谓') then
        return false
    end
    local 称谓 = _称谓剧情列表[几称]
    if self.检测[称谓].完成 ~= 1 then
        for k, v in pairs(self.检测[称谓]) do
            if k ~= '完成' and v == 0 then
                self.检测[称谓][k] = 1
            end
        end
    else
        return false
    end
    self.检测[称谓].完成 = 1
    玩家:添加任务(生成任务 { 名称 = '领取称谓', 进度 = 0, cw = 几称 })
    return true
end

function 任务:检测剧情称谓是否完成(玩家, 几称, key)
    local 称谓 = _称谓剧情列表[几称]

    self.检测[称谓][key] = 1

    for k, v in pairs(self.检测[称谓]) do
        if k ~= '完成' and v == 0 then
            return false
        end
    end
    self.检测[称谓].完成 = 1
    玩家:添加任务(生成任务 { 名称 = '领取称谓', 进度 = 0, cw = 几称 })
end

function 任务:任务初始化(玩家, ...)
    self.检测 = {
        ['一称'] = { 添加 = 0, 完成 = 0, 飞贼 = 0, 食婴鬼 = 0, 手下 = 0, 小孩 = 0 },
        ['二称'] = { 添加 = 0, 完成 = 0, 心经 = 0, 定魂珠 = 0, 水陆 = 0 },
        ['三称'] = { 添加 = 0, 完成 = 0, 春三十娘 = 0, 山贼 = 0, 仙露 = 0, 夜光珠 = 0 },
        ['四称'] = { 添加 = 0, 完成 = 0, 天兵 = 0, 琉璃 = 0, 八戒 = 0, 摄魂鬼 = 0 },
        ['五称'] = { 添加 = 0, 完成 = 0, 玉酒 = 0, 紫霞 = 0, 名菜 = 0 },
        ['六称'] = { 添加 = 0, 完成 = 0, 思情 = 0, 老君 = 0, 妖尸 = 0, 孽缘 = 0 },
        ['七称'] = { 添加 = 0, 完成 = 0, 神鞭 = 0, 唐僧 = 0 },
        ['八称'] = { 添加 = 0, 完成 = 0, 金箍 = 0, 妙法 = 0 },
        ['九称'] = { 添加 = 0, 完成 = 0, 悟空 = 0, 白虎 = 0, 山妖 = 0 },
        ['十称'] = { 添加 = 0, 完成 = 0, 九生九死 = 0 },
        ['十一称'] = { 添加 = 0, 完成 = 0, 武士 = 0, 紫霞 = 0, 宝物 = 0 },
        ['十二称'] = { 添加 = 0, 完成 = 0, 身世 = 0, 老妇 = 0, 度亡经 = 0 },
        ['十三称'] = { 添加 = 0, 完成 = 0, 偷吃 = 0, 路上 = 0 },
        ['十四称'] = { 添加 = 0, 完成 = 0, 白骨精 = 0 },
    }
end

function 任务:任务上线(玩家)
    if self:判断是否满足下一称谓剧情(玩家) then
        self:添加称谓剧情任务(玩家)
    end
end

function 任务:任务升级事件(玩家)
    if self:判断是否满足下一称谓剧情(玩家) then
        self:添加称谓剧情任务(玩家)
    end
end

function 任务:任务领取称谓事件(玩家)
    if self:判断是否满足下一称谓剧情(玩家) then
        self:添加称谓剧情任务(玩家)
    end
end

function 任务:任务取详情(玩家)
    if not _详情[玩家.称谓剧情 + 1] then
        return '你已经完成了全部称谓剧情任务。'
    end
    return _详情[玩家.称谓剧情 + 1]
end

function 任务:修复任务(cw)
    self.检测 = {
        ['一称'] = { 添加 = 0, 完成 = 0, 飞贼 = 0, 食婴鬼 = 0, 手下 = 0, 小孩 = 0 },
        ['二称'] = { 添加 = 0, 完成 = 0, 心经 = 0, 定魂珠 = 0, 水陆 = 0 },
        ['三称'] = { 添加 = 0, 完成 = 0, 春三十娘 = 0, 山贼 = 0, 仙露 = 0, 夜光珠 = 0 },
        ['四称'] = { 添加 = 0, 完成 = 0, 天兵 = 0, 琉璃 = 0, 八戒 = 0, 摄魂鬼 = 0 },
        ['五称'] = { 添加 = 0, 完成 = 0, 玉酒 = 0, 紫霞 = 0, 名菜 = 0 },
        ['六称'] = { 添加 = 0, 完成 = 0, 思情 = 0, 老君 = 0, 妖尸 = 0, 孽缘 = 0 },
        ['七称'] = { 添加 = 0, 完成 = 0, 神鞭 = 0, 唐僧 = 0 },
        ['八称'] = { 添加 = 0, 完成 = 0, 金箍 = 0, 妙法 = 0 },
        ['九称'] = { 添加 = 0, 完成 = 0, 悟空 = 0, 白虎 = 0, 山妖 = 0 },
        ['十称'] = { 添加 = 0, 完成 = 0, 九生九死 = 0 },
        ['十一称'] = { 添加 = 0, 完成 = 0, 武士 = 0, 紫霞 = 0, 宝物 = 0 },
        ['十二称'] = { 添加 = 0, 完成 = 0, 身世 = 0, 老妇 = 0, 度亡经 = 0 },
        ['十三称'] = { 添加 = 0, 完成 = 0, 偷吃 = 0, 路上 = 0 },
        ['十四称'] = { 添加 = 0, 完成 = 0, 白骨精 = 0 },
    }

    for i = 1, cw, 1 do
        local 几称 = _称谓剧情列表[i]
        for k, v in pairs(self.检测[几称]) do
            self.检测[几称][k] = 1
        end
    end
end

return 任务
