local 人物 = 窗口层:创建我的窗口('人物', 0, 0, 333, 437)
function 人物:初始化()
    self:置精灵(__res:getspr('gires/0x6BFAEA13.tcp'))
    self:置坐标(引擎.宽度 - 350, (引擎.高度 - 475) // 2)
    self.头像 = __res:getspr('photo/facelarge/%d.tga', 1)
    self.加点 = { 根骨 = 0, 灵性 = 0, 力量 = 0, 敏捷 = 0, 潜力 = 0 }
    self.四维数据 = { 根骨 = 0, 灵性 = 0, 力量 = 0, 敏捷 = 0 }
    --self.加点 = {根骨 = 0, 灵性 = 0, 力量 = 0, 敏捷 = 0, 潜力 = 0}
    self.四维 = { '根骨', '灵性', '力量', '敏捷' }
end

function 人物:显示(x, y)
    if self.头像 then
        self.头像:显示(x + 39 + 5, y + 52 - 13)
    end
end

function 人物:消息开始(v)
    if not 鼠标层.是否正常 then
        return true --拦截
    end
end

人物:创建关闭按钮()

--=======================================================================================
do
    for i, v in ipairs {
        { name = '等级', x = 66, y = 180, k = 58, g = 17 },
        { name = '声望', x = 215, y = 151, k = 95, g = 17 },
        { name = '战绩', x = 215, y = 179, k = 95, g = 17 },
        { name = '气血', x = 58, y = 216, k = 124, g = 17, txt = '气血值' },
        { name = '魔法', x = 58, y = 245, k = 124, g = 17, txt = '法力值' },
        { name = '攻击', x = 58, y = 274, k = 124, g = 17, txt = '攻击力' },
        { name = '速度', x = 58, y = 304, k = 124, g = 17, txt = '速度' },
        { name = '经验', x = 58, y = 334, k = 124, g = 17, txt = '经验值' },
        { name = '根骨', x = 249, y = 216, k = 60, g = 17, txt = '根骨影响你的气血值' },
        { name = '灵性', x = 249, y = 245, k = 60, g = 17, txt = '灵性影响你的法力值' },
        { name = '力量', x = 249, y = 274, k = 60, g = 17, txt = '力量影响你的攻击力' },
        { name = '敏捷', x = 249, y = 303, k = 60, g = 17, txt = '敏捷影响你的速度' },
        { name = '潜力', x = 289, y = 334, k = 42, g = 17 },
        { name = '角色', x = 57, y = 150, k = 60, g = 17 }
    } do
        local 文本 = 人物:创建文本(v.name .. '文本', v.x, v.y, v.k, v.g)
        文本:置文字(__res.F16B)
        if v.txt then
            文本:置提示('#Y' .. v.txt)
        end
        文本:置文本('123')
        if v.name == '角色' then
            文本:置文本('逍遥生')
        end
    end

    for i, v in ipairs {
        { name = '名称', x = 215, y = 37, k = 95, g = 17, txt = '' },
        { name = '称谓', x = 215, y = 67, k = 95, g = 17, txt = '' },
        { name = '种族', x = 215, y = 96, k = 95, g = 17, txt = '' },
        { name = '帮派', x = 215, y = 124, k = 95, g = 17, txt = '' }
    } do
        local 文本 = 人物:创建文本(v.name .. '文本', v.x, v.y, v.k, v.g)
        __res.F14:置大小(15)
        文本:置文字(__res.F14)
        文本:置文本('')
        __res.F14:置大小(14)
    end
end
--=======================================================================================
do
    for i = 1, 4 do
        local 增加属性 = 人物:创建加按钮('增加属性' .. i, 299, 225 - 9 + i * 29 - 29)
        function 增加属性:左键弹起()
            local 点数 = 1
            local 倍数加点 = 10

            if 人物.加点 and 人物.加点.潜力 > 0 then
                if 引擎:取功能键状态(SDL.KMOD_SHIFT) then
                    if 人物.加点.潜力 >= 10 then
                        点数 = 倍数加点
                    else
                        点数 = 人物.加点.潜力
                    end
                end

                人物.加点.潜力 = 人物.加点.潜力 - 点数
                人物.潜力文本:置文本(tostring(人物.加点.潜力))
                local xz = 人物.四维[i]
                人物.加点[xz] = 人物.加点[xz] + 点数
                人物[xz .. '文本']:置文本('#G' .. 人物.加点[xz] + 人物.四维数据[xz])
                人物['减少属性' .. i]:置禁止(false)
                if 人物.加点.潜力 <= 0 then
                    for n = 1, 4 do
                        人物['增加属性' .. n]:置禁止(true)
                    end
                end
            end
        end

        --===============================================================================================
        local 减少属性 = 人物:创建减按钮('减少属性' .. i, 287, 225 - 9 + i * 29 - 29)
        function 减少属性:左键弹起()
            if _数据 and _加点[i] > 0 then
                local k = ({ '根骨', '灵性', '力量', '敏捷' })[i]
                _加点[i] = _加点[i] - 1
                _数据.潜力 = _数据.潜力 + 1
                召唤.潜力文本:置文本(tostring(_数据.潜力))
                if _加点[i] > 0 then
                    召唤[k .. '文本']:置文本('#G' .. (_数据[k] + _加点[i]))
                else
                    召唤[k .. '文本']:置文本(tostring((_数据[k] + _加点[i])))
                    召唤['减少属性' .. i]:置禁止(true)
                end
                for i = 1, 4 do
                    召唤['增加属性' .. i]:置禁止(false)
                end
            end
        end
    end

    local x, y = 30 - 100, 365

    for i, v in ipairs { '七十二变', '技能查看', '抗   性', '更改称谓', '更改属性', '作  坊' } do
        x = x + 100
        if i == 4 then
            x, y = 30, 399
        end
        local 按钮 = 人物:创建中按钮(v, x, y, v, 85)
        function 按钮:左键弹起()
            if i == 1 then
                窗口层:打开七十二变()
            elseif i == 2 then
                窗口层:打开技能()
            elseif i == 3 then
                窗口层:打开人物抗性()
            elseif i == 4 then
                窗口层:打开人物称谓()
            elseif i == 5 then
                local 加点总和 = 0
                for k, v in pairs(人物.加点) do
                    if k ~= '潜力' then
                        加点总和 = 加点总和 + v
                    end
                end
                if 加点总和 > 0 then
                    local r = __rpc:角色_人物加点(人物.加点)
                    人物:刷新属性(r)
                end
            elseif i == 6 then
                窗口层:打开作坊窗口()
            end
        end
    end
    --人物.七十二变:置禁止(true)
end

function 人物:刷新称谓(t)
    人物.称谓文本:置文本(t)
end

function 人物:取外形信息(r)
    local 种族 = '人'
    local 角色 = '逍遥生'
    local 角色表 = {
        '逍遥生', '剑侠客', '猛壮士', '俏千金', '飞燕女', '英女侠',
        '巨魔王', '夺命妖', '虎头怪', '狐美人', '骨精灵', '小蛮妖',
        '神天兵', '龙战将', '智圣仙', '舞天姬', '精灵仙', '玄剑娥'
    }
    return 角色表[r]
end

local _种族 = { "人", "魔", "仙", "鬼" }

local _角色 = {
    [1] = '逍遥生',
    [2] = '剑侠客',
    [3] = '猛壮士',
    [4] = '俏千金',
    [5] = '飞燕女',
    [6] = '英女侠',
    --魔
    [7] = '巨魔王',
    [8] = '夺命妖',
    [9] = '虎头怪',
    [10] = '狐美人',
    [11] = '骨精灵',
    [12] = '小蛮妖',
    --仙
    [13] = '神天兵',
    [14] = '龙战将',
    [15] = '智圣仙',
    [16] = '舞天姬',
    [17] = '精灵仙',
    [18] = '玄剑娥',
    --鬼
    [60] = '猎魂引',
    [61] = '无崖子',
    [62] = '剑祭魂',
    [63] = '夜灵溪',
    [64] = '幽梦影',
    [65] = '墨衣行',
    ----1转
    [40] = '飞剑侠',
    [41] = '燕山雪',
    [42] = '逆天魔',
    [43] = '媚灵狐',
    [44] = '武尊神',
    [45] = '玄天姬',
    ---2转
    [50] = '纯阳子',
    [51] = '红拂女',
    [52] = '混天魔',
    [53] = '九尾狐',
    [54] = '紫薇神',
    [55] = '霓裳仙',
}
function 人物:刷新属性(r)
    if type(r) == 'table' then
        for k, v in pairs(self.加点) do
            self.加点[k] = 0
        end
        for k, v in pairs(self.四维数据) do
            self.四维数据[k] = r[k]
        end
        self.加点.潜力 = r.潜力
        for k, v in pairs(r) do
            if k == '声望' or k == '战绩' or k == '气血' or k == '魔法' then
                人物[k .. '文本']:置文本(v .. '/' .. r['最大' .. k])
            elseif k == '等级' then
                if r.飞升 == 1 then
                    人物.等级文本:置文本('飞' .. v)
                elseif r.转生 and r.转生 > 0 then
                    人物.等级文本:置文本(r.转生 .. '转' .. v)
                else
                    人物.等级文本:置文本(tostring(v))
                end
            elseif k == '称谓' then
                if v == nil then
                    v = ''
                end
                人物.称谓文本:置文本(v)
            elseif k == '帮派' then
                if v == nil then
                    v = ''
                end
                人物.帮派文本:置文本(v)
            elseif k ~= '最大声望' and k ~= '最大战绩' and k ~= '最大气血' and k ~= '最大魔法' and
                k ~= '种族' then
                if 人物[k .. '文本'] then
                    人物[k .. '文本']:置文本(tostring(v))
                end
            end
        end
        for i = 1, 4 do
            人物['增加属性' .. i]:置禁止(r.潜力 == 0)
            人物['减少属性' .. i]:置禁止(true)
        end
        self.头像 = __res:getspr('photo/facelarge/%d.tga', r.头像 or r.原形  or r.外形) --z
        人物.角色文本:置文本(_角色[r.头像] or "逍遥生")
        人物.种族文本:置文本(_种族[r.种族] or "人")
    end
end

function 窗口层:打开人物()
    人物:置可见(not 人物.是否可见)
    if not 人物.是否可见 then
        return
    end

    self:重新打开人物()
end

function 窗口层:重新打开人物()
    local r = __rpc:角色_打开人物窗口()
    人物:刷新属性(r)
end

return 人物
