return {
    {
        名字 = '热卖',
          --{ 类别 = '道具', 名称 = '小盲盒', 价格 = 698, 热卖 = true,
              --属性 = "#W有机会获得#G神兽自选卡、化形丹、五常饰品、五常天生技能、养育物品#W等珍稀道具" },
         --{ 类别 = '道具', 名称 = '抽奖券', 价格 = 2980, 热卖 = true,
             --属性 = "#W有更多的机会获得#G六神兵自选卡、神兽自选卡、化形丹、五常饰品、五常天生技能、养育物品#W等珍稀道具" },
        -- { 类别 = '道具', 名称 = '抽奖券', 热卖 = true, 价格 =998,属性 = "#W有更多的机会获得#G年、六神兵自选卡、神兽自选卡、化形丹、五常饰品、五常天生技能、养育物品#W等珍稀道具" },
        { 类别 = '道具', 名称 = '祝福劵', 热卖 = true, 价格 =8888},
		{ 类别 = '道具', 名称 = '血法特权', 热卖 = true,  价格 =3888},
		{ 类别 = '道具', 名称 = '飞行特权', 热卖 = true,  价格 =8888},
		--{ 类别 = '道具', 名称 = 'VIP3礼包', 热卖 = true, 禁止交易=true,属性 = "#Y角色11-14称谓瞬间完成", 价格 =2000},
		--{ 类别 = '道具', 名称 = '小资开荒礼包', 价格 = 5000, 热卖 = true },
		{ 类别 = '道具', 名称 = '三界召集令', 价格 = 5000, 热卖 = true },
        { 类别 = '道具', 名称 = '鸿运宝珠', 热卖 = true, 价格 = 1000 },
		{ 类别 = '道具', 名称 = '终极技能书', 热卖 = true, 价格 = 30000 },
		{ 类别 = '道具', 名称 = '万兽要诀', 热卖 = true, 价格 = 3000 },
        --{ 类别 = '道具', 名称 = '圣兽要诀', 热卖 = true, 价格 = 5000 },
		--{ 类别 = '道具', 名称 = '聚魄丹', 热卖 = true, 价格 = 100 },
        --{ 类别 = '道具', 名称 = '角色转移卡', 热卖 = true, 价格 = 3980 },
        --{ 类别 = '道具', 名称 = '银票', 参数 = 10000000, 属性 = "#Y增加银两 +10000000", 价格 = 100, },
        --{ 类别 = '道具', 名称 = '银票', 参数 = 20000000, 属性 = "#Y增加银两 +20000000", 价格 = 200, },
        { 类别 = '道具', 名称 = '银票', 参数 = 50000000, 属性 = "#Y增加银两 +50000000", 价格 = 500, },
        --{ 类别 = '道具', 名称 = '神兵礼盒', 参数 = 1, 属性 = "#Y打开后获得1级随机神兵", 价格 = 500, },
        { 类别 = '道具', 名称 = '神兵石', 价格 = 98, 热卖 = true },
        { 类别 = '道具', 名称 = '炼化大礼包', 价格 = 300, 属性 = "#Y血玲珑*100\r#Y内丹精华*100\r#Y九彩云龙珠*300 #G品质165",
            热卖 = true },       
        { 类别 = '道具', 名称 = '清盈果', 参数 = 1000, 属性 = "#Y恢复1000点体力", 价格 = 100,
            热卖 = true },
        { 类别 = '道具', 名称 = '筋骨提气丸', 价格 = 100, 热卖 = true },
        { 类别 = '道具', 名称 = '月光宝盒', 价格 = 100, 热卖 = true },
    },
    {
        名字 = '人物',
        { 类别 = '道具', 名称 = '更名卡', 价格 = 1200 },
        { 类别 = '道具', 名称 = '神兵礼盒', 参数 = 1, 属性 = "#Y打开后获得1级随机神兵", 价格 = 100 },
        { 类别 = '道具', 名称 = '六脉化神丸', 价格 = 20 },
        { 类别 = '道具', 名称 = '修正卡', 价格 = 3000 },
        { 类别 = '道具', 名称 = '玉枢返虚丸', 价格 = 50 },
		--{ 类别 = '道具', 名称 = '200环令', 价格 = 50 },
		--{ 类别 = '道具', 名称 = '五环令', 价格 = 50 },
        { 类别 = '道具', 名称 = '超级星梦石', 价格 = 98 },
        { 类别 = '道具', 名称 = '帮派成就册', 参数 = 10000, 属性 = "#Y帮派成就+10000", 价格 = 166 },
        --{ 类别 = '道具', 名称 = '清盈果', 参数 = 1000, 属性 = "#Y恢复1000点体力", 价格 = 300 },
        { 类别 = '道具', 名称 = '特赦令', 属性 = "#Y能用起这个东西的小伙伴还是很刁的，希望再次光临本商城。",
            价格 = 888 },
		{ 类别 = '道具', 名称 = '蟠桃王', 热卖 = true, 价格 = 10 },
	    -- { 类别 = '道具', 名称 = '一级神兵自选卡', 价格 = 150, 热卖 = true },	 
		-- { 类别 = '道具', 名称 = '二级神兵自选卡', 价格 = 500, 热卖 = true },
		-- { 类别 = '道具', 名称 = '三级神兵自选卡', 价格 = 1500, 热卖 = true },
		-- { 类别 = '道具', 名称 = '四级神兵自选卡', 价格 = 3000, 热卖 = true },
		-- { 类别 = '道具', 名称 = '五级神兵自选卡', 价格 = 6000, 热卖 = true },
	    -- { 类别 = '道具', 名称 = '六级神兵自选卡', 价格 = 35000, 热卖 = true },
		{ 类别 = '道具', 名称 = '一坐卡', 价格 = 188, 热卖 = true },
	    { 类别 = '道具', 名称 = '二坐卡', 价格 = 188, 热卖 = true },	 
		{ 类别 = '道具', 名称 = '三坐卡', 价格 = 188, 热卖 = true },
		{ 类别 = '道具', 名称 = '四坐卡', 价格 = 288, 热卖 = true },
		{ 类别 = '道具', 名称 = '五坐卡', 价格 = 288, 热卖 = true },
		{ 类别 = '道具', 名称 = '魔族六坐卡', 价格 = 1000, 热卖 = true },
	    { 类别 = '道具', 名称 = '人族六坐卡', 价格 = 1000, 热卖 = true },
		{ 类别 = '道具', 名称 = '仙族六坐卡', 价格 = 1000, 热卖 = true },	
		--{ 类别 = '道具', 名称 = '积分卡', 参数 = 100000, 属性 = "#Y增加积分 #G100000", 限时 = 999999, 限量 = 999999, 价格 = 0 },

    },
    {
        名字 = '召唤兽',
		-- { 类别 = '道具', 名称 = "封印卡", 参数 = "孟极",属性 = "#Y孟极 天生技能:暗影离魂",热卖 = true, 价格 = 30000 },
		-- { 类别 = '道具', 名称 = "封印卡", 参数 = "龙兔",属性 = "#Y龙兔 天生技能:天降脱兔",热卖 = true, 价格 = 30000 },
		--{ 类别 = '道具', 名称 = '神兽自选卡', 价格 = 20000 },
		--{ 类别 = '道具', 名称 = '终极技能书', 热卖 = true, 价格 = 30000 },
        --{ 类别 = '道具', 名称 = '圣兽要诀', 热卖 = true, 价格 = 5000 },
		{ 类别 = '道具', 名称 = '聚魄丹', 热卖 = true, 价格 = 100 },
        { 类别 = '道具', 名称 = '中级聚魄丹', 热卖 = true, 价格 = 300 },
        { 类别 = '道具', 名称 = '高级聚魄丹', 热卖 = true, 价格 = 500 },
		{ 类别 = '道具', 名称 = '化形丹', 热卖 = true, 价格 = 1000 },
		{ 类别 = '道具', 名称 = '超级元气丹', 热卖 = true, 价格 = 1000 },
		{ 类别 = '道具', 名称 = '超级变色丹', 热卖 = true, 价格 = 1000 },
        { 类别 = '道具', 名称 = '亲密丹', 参数 = 50000000, 属性 = "#Y增加亲密度 50000000", 价格 = 1000 },
        { 类别 = '道具', 名称 = '龙之骨', 价格 = 188 },
		{ 类别 = '道具', 名称 = '凝精聚气丹', 参数 = 1000000000, 属性 = "#Y内丹经验 #G1000000000",价格 = 188 },
        { 类别 = '道具', 名称 = '伐骨洗髓丹', 价格 = 188 },
        { 类别 = '道具', 名称 = '九转易筋丸', 价格 = 188 },
        { 类别 = '道具', 名称 = '混元丹', 价格 = 68 },
        { 类别 = '道具', 名称 = '高级金柳露', 价格 = 98 },
        { 类别 = '道具', 名称 = '超级金柳露', 价格 = 198 },
		{ 类别 = '道具', 名称 = '武帝袍', 价格 = 300, 参数 = 14},
        { 类别 = '道具', 名称 = '灵犀角', 价格 = 300 ,参数 = 14},
		{ 类别 = '道具', 名称 = '云罗帐', 价格 = 300 , 参数 = 14},
        { 类别 = '道具', 名称 = '盘古石', 价格 = 300, 参数 = 14},
		{ 类别 = '道具', 名称 = '雪蟾蜍', 价格 = 300, 参数 = 14},
		--{ 类别 = '道具', 名称 = '神兽自选卡', 价格 = 20000 },
        --{ 类别 = '道具', 名称 = '圣兽要诀', 价格 = 500 },
        --{ 类别 = '道具', 名称 = '聚魄丹', 价格 = 188 },
        --{ 类别 = '道具', 名称 = '终极技能修炼丹', 价格 = 50 },
        --{ 类别 = '道具', 名称 = '高级金柳露', 价格 = 98 },
        --{ 类别 = '道具', 名称 = '超级金柳露', 价格 = 198 },


    },
    {
        名字 = '材料',
        { 类别 = '道具', 名称 = '炼化大礼包', 价格 = 300 },
        { 类别 = '道具', 名称 = '九玄仙玉', 价格 = 68 },
        { 类别 = '道具', 名称 = '落魂砂', 价格 = 68 },
        { 类别 = '道具', 名称 = '神功笔录', 价格 = 68 },
        { 类别 = '道具', 名称 = '神兵石', 价格 = 98 },
        { 类别 = '道具', 名称 = '六魂之玉', 价格 = 588 },
        { 类别 = '道具', 名称 = '忘魂草', 价格 = 199 },


    },
    {
        名字 = '养育', --

        { 类别 = '道具', 名称 = "高级玉佩", 价格 = 20 },
        { 类别 = '道具', 名称 = "高级鬼谷子", 价格 = 20 },
        { 类别 = '道具', 名称 = "高级六韬三略", 价格 = 20 },
        { 类别 = '道具', 名称 = "高级百年茯苓", 价格 = 20 },
        { 类别 = '道具', 名称 = "高级戒指", 价格 = 20 },
        { 类别 = '道具', 名称 = "高级千字文", 价格 = 20 },
        { 类别 = '道具', 名称 = "高级百年雪莲", 价格 = 20 },
        { 类别 = '道具', 名称 = "高级内功心法", 价格 = 20 },
        { 类别 = '道具', 名称 = "高级百年何首乌", 价格 = 20 },
        { 类别 = '道具', 名称 = "高级三字经", 价格 = 20 },
        { 类别 = '道具', 名称 = "高级孙子兵法", 价格 = 20 },
        { 类别 = '道具', 名称 = "高级琴谱", 价格 = 20 },
        { 类别 = '道具', 名称 = "高级剑诀", 价格 = 20 },
        { 类别 = '道具', 名称 = "高级诗经", 价格 = 20 },
        { 类别 = '道具', 名称 = "琼浆玉液", 价格 = 100 },
        { 类别 = '道具', 名称 = "猕猴桃", 价格 = 98 },
        { 类别 = '道具', 名称 = "金丹", 价格 = 350 },
        { 类别 = '道具', 名称 = "无字天书", 价格 = 188 },
        { 类别 = '道具', 名称 = "仙童果", 价格 = 100 },
        { 类别 = '道具', 名称 = "毓秀石", 价格 = 60 },
        -- { 类别 = '道具', 名称 = "换骨丹", 价格 = 10 },













    },
    -- {
    --     名字 = '限时', --
    --     倒数 = 10,
    --     -- { 类别 = '道具', 名称 = '积分卡', 参数 = 100000, 属性 = "#Y增加积分 #G100000", 限时 = 999999, 限量 = 999999, 价格 = 0 }, --
    --     -- { 类别 = '道具', 名称 = '人参果王', 参数 = 800000, 属性 = "#Y增加经验 #G800000", 限时 = 999999, 限量 = 999999, 价格 = 0 },
    --     -- { 类别 = '道具', 名称 = '一级神兵自选卡', 限时 = 999999, 限量 = 999999, 价格 = 0 },
    --     -- { 类别 = '道具', 名称 = '六级神兵自选卡', 限时 = 999999, 限量 = 999999, 价格 = 0 },
    --     -- { 类别 = '道具', 名称 = '随机神兽宝盒', 限时 = 999999, 限量 = 999999, 价格 = 0 },
    --     -- { 类别 = '道具', 名称 = '人形神兽宝卷', 限时 = 999999, 限量 = 999999, 价格 = 0 },
    --     -- { 类别 = '道具', 名称 = '老版神兽宝卷', 限时 = 999999, 限量 = 999999, 价格 = 0 },
    --     -- { 类别 = '道具', 名称 = '五常神兽宝卷', 限时 = 999999, 限量 = 999999, 价格 = 0 },
    --     -- { 类别 = '道具', 名称 = '随机天书召唤兽', 限时 = 999999, 限量 = 999999, 价格 = 0 },
    --     -- { 类别 = '道具', 名称 = '守护宝卷', 限时 = 999999, 限量 = 999999, 价格 = 0 },
    --     -- { 类别 = '道具', 名称 = '超级神兽丹', 参数 = 800000, 属性 = "#Y召唤兽经验 #G800000", 限时 = 999999, 限量 = 999999, 价格 = 0 },
    --     -- { 类别 = '道具', 名称 = '卧龙丹', 限时 = 999999, 限量 = 999999, 价格 = 0 },
    --     -- --{ 类别 = '道具', 名称 = '金柳叶', 限时 = 999999, 限量 = 999999, 价格 = 0 },
    --     -- { 类别 = '道具', 名称 = '凝精聚气丹', 参数 = 100000, 属性 = "#Y内丹经验 #G100000", 限时 = 999999, 限量 = 999999, 价格 = 0 },

    -- },
    {
        名字 = '佩饰',
        { 类别 = '道具', 名称 = '翠玉扳指礼盒', 参数=7,价格 = 20 },
        { 类别 = '道具', 名称 = '祥云流带礼盒', 参数=7,价格 = 20 },
        { 类别 = '道具', 名称 = '半面妆礼盒', 参数=7,价格 = 20 },
        { 类别 = '道具', 名称 = '红萼斗篷礼盒', 参数=7,价格 = 20 },
        { 类别 = '道具', 名称 = '伽蓝碎雨礼盒', 参数=7,价格 = 20 },
        { 类别 = '道具', 名称 = '琅琊梦断礼盒', 参数=7,价格 = 20 },
        { 类别 = '道具', 名称 = '流火披风礼盒', 参数=7,价格 = 20 },
        { 类别 = '道具', 名称 = '护身符礼盒', 参数=7,价格 = 20 },
        { 类别 = '道具', 名称 = '佩饰礼盒', 参数=1,价格 = 20 },
        { 类别 = '道具', 名称 = '佩饰精华', 参数=1,价格 = 20 },
        { 类别 = '道具', 名称 = '久雨初晴', 参数=1,价格 = 20 },

    },


    { --一定排最后
        名字 = 'GM',
        -- { 类别 = '道具', 名称 = '随机天书召唤兽', 价格 = 0 },
        -- { 类别 = '道具', 名称 = '人参果王', 价格 = 10 },
        -- { 类别 = '道具', 名称 = 'VIP1礼包', 价格 = 0 },
        -- { 类别 = '道具', 名称 = 'VIP2礼包', 价格 = 0 },
        -- { 类别 = '道具', 名称 = 'VIP3礼包', 价格 = 0 },
        -- { 类别 = '道具', 名称 = 'VIP4礼包', 价格 = 0 },
        -- { 类别 = '道具', 名称 = 'VIP5礼包', 价格 = 0 },
        -- { 类别 = '道具', 名称 = 'VIP6礼包', 价格 = 0 },
        -- { 类别 = '道具', 名称 = 'VIP7礼包', 价格 = 0 },
        -- { 类别 = '道具', 名称 = '人形神兽宝卷', 价格 = 0 },
        -- { 类别 = '道具', 名称 = '老版神兽宝卷', 价格 = 0 },
        -- { 类别 = '道具', 名称 = '五常神兽宝卷', 价格 = 0 },
        -- { 类别 = '道具', 名称 = '凝精聚气丹', 价格 = 0 },
        -- { 类别 = '道具', 名称 = '积分卡', 参数 = 200, 属性 = "#Y200点积分", 价格 = 0 },
        -- { 类别 = '道具', 名称 = '积分卡', 参数 = 510, 属性 = "#Y510点积分", 价格 = 0 },
        -- { 类别 = '道具', 名称 = '积分卡', 参数 = 1100, 属性 = "#Y1100点积分", 价格 = 0 },
        -- { 类别 = '道具', 名称 = '积分卡', 参数 = 2200, 属性 = "#Y2200点积分", 价格 = 0 },
        -- { 类别 = '道具', 名称 = '积分卡', 参数 = 3300, 属性 = "#Y3300点积分", 价格 = 0 },
        -- { 类别 = '道具', 名称 = '积分卡', 参数 = 5500, 属性 = "#Y5500点积分", 价格 = 0 },
        -- { 类别 = '道具', 名称 = '神兽自选卡', 价格 = 0 },
        -- { 类别 = '道具', 名称 = '守护自选卡', 价格 = 0 },
        -- { 类别 = '道具', 名称 = '神兵礼盒', 参数 = 5, 序列 = 17, 装备名称 = "斩妖剑",
        --     属性 = "#Y获得1级随机神兵", 价格 = 1 },
        -- { 类别 = '道具', 名称 = '超级神兽丹', 价格 = 2, 热卖 = true },
        -- { 类别 = '道具', 名称 = '超级变色丹', 价格 = 2, 热卖 = true },
        -- { 类别 = '道具', 名称 = '血玲珑', 价格 = 0 },
        -- { 类别 = '道具', 名称 = '内丹精华', 价格 = 0 },
        --  { 类别 = '道具', 名称 = '元宵礼包', 价格 = 0 },
        -- { 类别 = '道具', 名称 = '汤小圆礼盒', 价格 = 0 },
        -- { 类别 = '道具', 名称 = '超级元气丹', 价格 = 10, 热卖 = true }


    },






}
