return {
  { 类别 = '道具', 名称 = '银票', 参数 = 10000000 , 属性 = "#Y增加银两一千万", 数量 = 1 ,要求 = {银子=10000,{类别 = '道具', 名称 = '神兵石', 数量 = 30},{ 类别 = '道具', 名称 = '炼化大礼包', 数量 = 5}}},
  --{ 类别 = '道具', 名称 = '神兵石', 数量 = 30,要求 = {银子=20000,{类别 = '道具', 名称 = '神兵石', 数量 = 30},{ 类别 = '道具', 名称 = '炼化大礼包', 数量 = 5}}},
  { 类别 = '道具', 名称 = '清盈果',参数 = 1000 , 属性 = "#Y恢复1000点体力", 数量 = 10 ,要求 = {银子=30000,{类别 = '道具', 名称 = '神兵石', 数量 = 30}}},
  { 类别 = '道具', 名称 = '炼化大礼包', 数量 = 1 ,要求 = {银子=40000,{类别 = '道具', 名称 = '神兵石', 数量 = 30},{ 类别 = '道具', 名称 = '炼化大礼包', 数量 = 5}}},
  { 类别 = '道具', 名称 = '神兵礼盒' , 数量 = 1 ,要求 = {银子=50000,{类别 = '道具', 名称 = '神兵石', 数量 = 30},{ 类别 = '道具', 名称 = '炼化大礼包', 数量 = 5}}},
  { 类别 = '道具', 名称 = '神兵礼盒' , 数量 = 1 ,要求 = {银子=50000,{类别 = '道具', 名称 = '神兵石', 数量 = 30},{ 类别 = '道具', 名称 = '炼化大礼包', 数量 = 5}}},
  { 类别 = '道具', 名称 = '神兵礼盒' , 数量 = 1 ,要求 = {银子=50000,{类别 = '道具', 名称 = '神兵石', 数量 = 30},{ 类别 = '道具', 名称 = '炼化大礼包', 数量 = 5}}},
}
