local 商店 = {}

local list = {
       { 类别 = "道具", 名称 = '清盈果',参数 = 1000,属性 = "#Y恢复1000点体力", 价格 = 1000 },
       { 类别 = "道具", 名称 = "神兵礼盒", 价格 = 1000 },
       { 类别 = "道具", 名称 = "高级藏宝图", 价格 = 1000 },
       { 类别 = "道具", 名称 = "刮刮乐", 价格 = 500 },
    -- { 类别 = "道具", 名称 = "蟠桃王", 价格 = 500 },
    -- { 类别 = "道具", 名称 = "血玲珑", 价格 = 100 },
    -- { 类别 = "道具", 名称 = "内丹精华", 价格 = 100 },
    -- { 类别 = "道具", 名称 = "千年寒铁", 价格 = 400 },
    -- { 类别 = "道具", 名称 = "天外飞石", 价格 = 450 },
    -- { 类别 = "道具", 名称 = "盘古精铁", 价格 = 500 },
    -- { 类别 = "道具", 名称 = "补天神石", 价格 = 550 },
    -- { 类别 = "道具", 名称 = "帮派成就册", 价格 = 500 },
    -- { 类别 = "道具", 名称 = "高级藏宝图", 价格 = 900 },
    -- { 类别 = "道具", 名称 = "超级星梦石", 价格 = 900 },
    -- { 类别 = "道具", 名称 = "武帝袍", 参数 = 11, 价格 = 3000 },
    -- { 类别 = "道具", 名称 = "灵犀角", 参数 = 11, 价格 = 3000 },
    -- { 类别 = "道具", 名称 = "云罗帐", 参数 = 11, 价格 = 3000 },
    -- { 类别 = "道具", 名称 = "盘古石", 参数 = 11, 价格 = 3000 },
    -- { 类别 = "道具", 名称 = "守护宝卷", 价格 = 10000 },
}
local _随便 = {
    -- { 名称 = "高级藏宝图", 数量 = 1, 几率 = 165, 广播 = true },
    -- { 名称 = "刮刮乐", 数量 = 1, 几率 = 170 },
    -- { 名称 = "帮派成就册", 数量 = 1, 几率 = 150 },
    -- { 名称 = "神兵石", 数量 = 1, 几率 = 15 },
    -- { 名称 = "超级星梦石", 数量 = 1, 几率 = 101 },
    -- { 名称 = "筋骨提气丸", 数量 = 1, 几率 = 30 },
    -- { 名称 = "九转易筋丸", 数量 = 1, 几率 = 120 },
    -- { 名称 = "伐骨洗髓丹", 数量 = 1, 几率 = 160 },
    -- { 名称 = "高级金柳露", 数量 = 1, 几率 = 150 },
    -- { 名称 = "混元丹", 数量 = 1, 几率 = 200 },
    -- { 名称 = "超级金柳露", 数量 = 1, 几率 = 50 },
    -- { 名称 = "龙之骨", 数量 = 1, 几率 = 100 },
    -- { 名称 = "武帝袍", 数量 = 1, 参数 = 11, 几率 = 100 },
    -- { 名称 = "灵犀角", 数量 = 1, 参数 = 11, 几率 = 100 },
    -- { 名称 = "云罗帐", 数量 = 1, 参数 = 11, 几率 = 100 },
    -- { 名称 = "盘古石", 数量 = 1, 参数 = 11, 几率 = 100 },
    -- { 名称 = "神兽丹", 数量 = 1, 几率 = 600 },
    -- { 名称 = "凝精聚气丹", 数量 = 1, 几率 = 600 },
    -- { 名称 = "人参果王", 数量 = 1, 几率 = 200 },
    -- { 名称 = "蟠桃王", 数量 = 1, 几率 = 200 },
    -- { 名称 = "千年寒铁", 数量 = 1, 几率 = 600 },
    -- { 名称 = "天外飞石", 数量 = 1, 几率 = 600 },
    -- { 名称 = "盘古精铁", 数量 = 1, 几率 = 500 },
    -- { 名称 = "补天神石", 数量 = 1, 几率 = 200 },
    -- { 名称 = "神兵礼盒", 数量 = 1, 几率 = 1 },
    -- { 名称 = "守护宝卷", 数量 = 1, 几率 = 5 },
    -- { 名称 = "超级变色丹", 数量 = 1, 几率 = 10 },
    -- { 名称 = "超级元气丹", 数量 = 1, 几率 = 10 },
    -- { 名称 = "轻盈果", 数量 = 1, 参数 = 500, 几率 = 60 },
    -- { 名称 = "天书残卷第一卷", 数量 = 1, 几率 = 350 },
    -- { 名称 = "天书残卷第二卷", 数量 = 1, 几率 = 340 },
    -- { 名称 = "天书残卷第三卷", 数量 = 1, 几率 = 330 },
    -- { 名称 = "天书残卷第四卷", 数量 = 1, 几率 = 320 },
    -- { 名称 = "天书残卷第五卷", 数量 = 1, 几率 = 3100 },
    -- { 名称 = "天书残卷第六卷", 数量 = 1, 几率 = 300 },
    -- { 名称 = "见闻录", 数量 = 1, 几率 = 200 },
    -- { 名称 = "六脉化神丸", 数量 = 1, 几率 = 180 },
    -- { 名称 = "亲密丹", 数量 = 1, 几率 = 200 },
    -- { 名称 = "月光宝盒", 数量 = 1, 几率 = 150 },


}
function 商店:取商品()
    return list
end

function 商店:取随便物品()
    local t
    while not t do
        for _, v in ipairs(_随便) do
            if math.random(1000) <= v.几率 then
                t = v
                break
            end
        end
    end
    return t
end

function 商店:购买(玩家, i, n)
    if not 验证数字(n) then
        return
    end
    local 总价 = n * list[i].价格
    if 玩家.其它.帮战积分 >= 总价 then
        local 物品表 = {}
        local 广播表 = {}
        if list[i].名称 == "随便" then
            local t
            local r
            for _ = 1, n, 1 do
                t = self:取随便物品()
                r = 生成物品({ 名称 = t.名称, 参数 = t.参数, 数量 = t.数量 })
                if r then
                    table.insert(物品表, r)
                    if t.广播 then
                        table.insert(广播表, { r.nid, r.名称 })
                    end
                end
            end
        else
            local t = 复制表(list[i])
            t.类别 = nil
            t.价格 = nil
            local 第一 = 生成物品(t)
            if 第一.是否叠加 then
                第一.数量 = n
                table.insert(物品表, 第一)
            else
                for _ = 1, n do
                    table.insert(物品表, 生成物品(t))
                end
            end
        end
        if list[i].名称 == "随便" then
            if 玩家:添加物品(物品表) then
                玩家:扣除指定积分(总价, "帮战积分")
                玩家:提示窗口('#Y你购买了%s个#G%s#Y,共花费%s点帮战积分。', n, "随便", 总价)
                for _, v in ipairs(广播表) do
                    玩家:发送系统("#C%s#c00FFFF在帮战活动中兑换随便奖励获得了#G#m(%s)[%s]#m#n",
                        玩家.名称, v[1], v[2])
                end
                return true
            else
                return '#Y空间不足'
            end
        else
            if 玩家:添加物品_无提示(物品表) then
                玩家:扣除指定积分(总价, "帮战积分")
                玩家:提示窗口('#Y你购买了%s个#G%s#Y,共花费%s点帮战积分。', n, list[i].名称, 总价)
                return true
            else
                return '#Y空间不足'
            end
        end

    else
        return '#Y你的帮战积分不足，不能购买！'
    end
end

return 商店
