local 商店 = {}

local list = {
    -- 第一页
    [1] = { 类别 = "道具", 名称 = "玄玉益气符", 价格 = 10000 },
    [2] = { 类别 = "道具", 名称 = "玄玉飞霜符", 价格 = 10000 },
    [3] = { 类别 = "道具", 名称 = "甲骨强身符", 价格 = 100000 },
    [4] = { 类别 = "道具", 名称 = "甲骨金刚符", 价格 = 100000 },
    [5] = { 类别 = "道具", 名称 = "白玉益气符", 价格 = 10000 },
    [6] = { 类别 = "道具", 名称 = "益气回蓝符", 价格 = 40000 },
    [7] = { 类别 = "道具", 名称 = "凝气回蓝符", 价格 = 50000 },
    [8] = { 类别 = "道具", 名称 = "蓄气回蓝符", 价格 = 60000 },
    [9] = { 类别 = "道具", 名称 = "神行符", 价格 = 1000000 },

    -- 第二页
    [25] = { 类别 = "道具", 名称 = "破冰之鹿皮符文", 价格 = 100000 },
    [26] = { 类别 = "道具", 名称 = "清明之鹿皮符文", 价格 = 100000 },
    [27] = { 类别 = "道具", 名称 = "苏醒之鹿皮符文", 价格 = 100000 },
    [28] = { 类别 = "道具", 名称 = "记忆之鹿皮符文", 价格 = 100000 },
    [29] = { 类别 = "道具", 名称 = "破冰之寒玉符文", 价格 = 300000 },
    [30] = { 类别 = "道具", 名称 = "清明之寒玉符文", 价格 = 300000 },
    [31] = { 类别 = "道具", 名称 = "苏醒之寒玉符文", 价格 = 300000 },
    [32] = { 类别 = "道具", 名称 = "记忆之寒玉符文", 价格 = 300000 },
    [33] = { 类别 = "道具", 名称 = "千色之符", 价格 = 300000 },
    [34] = { 类别 = "道具", 名称 = "虹光符文", 价格 = 500000 },

    -- 第三页
    [49] = { 类别 = "道具", 名称 = "封印之兔齿符文", 价格 = 100000 },
    [50] = { 类别 = "道具", 名称 = "失心之兔齿符文", 价格 = 100000 },
    [51] = { 类别 = "道具", 名称 = "入梦之兔齿符文", 价格 = 100000 },
    [52] = { 类别 = "道具", 名称 = "浸毒之兔齿符文", 价格 = 100000 },
    [53] = { 类别 = "道具", 名称 = "浸毒之竹叶符文", 价格 = 100000 },
    [54] = { 类别 = "道具", 名称 = "震慑之云母符文", 价格 = 300000 },
    [55] = { 类别 = "道具", 名称 = "盘丝之云母符文", 价格 = 300000 },
    [56] = { 类别 = "道具", 名称 = "强力之云母符文", 价格 = 300000 },
    [57] = { 类别 = "道具", 名称 = "刹那之云母符文", 价格 = 300000 },
    [58] = { 类别 = "道具", 名称 = "遗忘之夜明符文", 价格 = 300000 },
    [59] = { 类别 = "道具", 名称 = "鬼火之夜明符文", 价格 = 300000 },
    [60] = { 类别 = "道具", 名称 = "魅惑之夜明符文", 价格 = 300000 },
    [61] = { 类别 = "道具", 名称 = "三尸之夜明符文", 价格 = 300000 },
    [62] = { 类别 = "道具", 名称 = "三尸麝皮符", 价格 = 300000 },
    [63] = { 类别 = "道具", 名称 = "天谴符文", 价格 = 300000 },
    [64] = { 类别 = "道具", 名称 = "遗忘珊瑚符", 价格 = 300000 },
    [65] = { 类别 = "道具", 名称 = "五行化金符文", 价格 = 500000 },
    [66] = { 类别 = "道具", 名称 = "五行破木符文", 价格 = 500000 },
    [67] = { 类别 = "道具", 名称 = "五行碎土符文", 价格 = 500000 },
    [68] = { 类别 = "道具", 名称 = "五行腐水符文", 价格 = 500000 },
    [69] = { 类别 = "道具", 名称 = "五行驭火符文", 价格 = 500000 },

    -- 第四页
    [73] = { 类别 = "道具", 名称 = "封印之琅琊符文", 价格 = 100000 },
    [74] = { 类别 = "道具", 名称 = "失心之琅琊符文", 价格 = 100000 },
    [75] = { 类别 = "道具", 名称 = "入梦之琅琊符文", 价格 = 100000 },
    [76] = { 类别 = "道具", 名称 = "浸毒之琅琊符文", 价格 = 100000 },
    [77] = { 类别 = "道具", 名称 = "浸毒之珊瑚符文", 价格 = 100000 },
    [78] = { 类别 = "道具", 名称 = "震慑之水晶符文", 价格 = 300000 },
    [79] = { 类别 = "道具", 名称 = "盘丝之水晶符文", 价格 = 300000 },
    [80] = { 类别 = "道具", 名称 = "强力之水晶符文", 价格 = 300000 },
    [81] = { 类别 = "道具", 名称 = "刹那之水晶符文", 价格 = 300000 },
    [82] = { 类别 = "道具", 名称 = "遗忘之绫绡符文", 价格 = 300000 },
    [83] = { 类别 = "道具", 名称 = "鬼火之绫绡符文", 价格 = 300000 },
    [84] = { 类别 = "道具", 名称 = "魅惑之绫绡符文", 价格 = 300000 },
    [85] = { 类别 = "道具", 名称 = "三尸之绫绡符文", 价格 = 300000 },
    [86] = { 类别 = "道具", 名称 = "狂风符纸", 价格 = 300000 },
    [87] = { 类别 = "道具", 名称 = "怒雷符纸", 价格 = 300000 },
    [88] = { 类别 = "道具", 名称 = "奔流符纸", 价格 = 300000 },
    [89] = { 类别 = "道具", 名称 = "天火符纸", 价格 = 300000 },
    [90] = { 类别 = "道具", 名称 = "分裂攻击符", 价格 = 300000 },
    [91] = { 类别 = "道具", 名称 = "高级分裂攻击符", 价格 = 500000 },
    [92] = { 类别 = "道具", 名称 = "珊瑚怨气符文", 价格 = 300000 },
}

function 商店:取商品()
    return list
end

function 商店:购买(玩家, i, n)
    if not 验证数字(n) then
        return
    end
    local 总价 = n * list[i].价格
    if 玩家.银子 >= 总价 then
        local t = 复制表(list[i])
        t.类别 = nil
        t.价格 = nil
        local 物品表 = {}
        local 物品 = 生成符文(t)
        if 物品.是否叠加 then
            物品.数量 = n
            table.insert(物品表, 物品)
        end
        if 玩家:添加物品_无提示(物品表) then
            玩家:扣除银子(总价)
            玩家:提示窗口('#Y你购买了%s个#G%s#Y,共花费%s银两。', n, t.名称, 总价)
            return true
        else
            return '#Y空间不足'
        end
    else
        return '#Y你的银两不足，不能购买！'
    end
end

return 商店
