local 商店 = {}

local list = {
    { 类别 = "道具", 名称 = "般若多罗密心经", 价格 = 1 },
    { 类别 = "道具", 名称 = "定魂珠", 价格 = 1 },
    { 类别 = "道具", 名称 = "夜光珠", 价格 = 1 },
    { 类别 = '道具', 名称 = '琉璃盏碎片', 价格 = 1 },
    { 类别 = '道具', 名称 = '天宫的名菜', 价格 = 1 },
    { 类别 = '道具', 名称 = '天宫的玉酒', 价格 = 1 },
    { 类别 = '道具', 名称 = '紫青宝剑', 价格 = 1 },
    { 类别 = '道具', 名称 = '剃刀', 价格 = 1 },
    { 类别 = '道具', 名称 = '玄天铁鞭', 价格 = 1 },
    { 类别 = "道具", 名称 = "绿烟如梦", 价格 = 1 },
    { 类别 = "道具", 名称 = "龙鳞", desc = '据说这是天一神将的宝贝', 价格 = 1 },
    { 类别 = "道具", 名称 = "仙露", 价格 = 1 },
    { 类别 = '道具', 名称 = '妙法莲华经', 价格 = 1 },
    { 类别 = "道具", 名称 = "金箍棒", 价格 = 1 },
    { 类别 = '道具', 名称 = '金箍', 价格 = 1 },
    { 类别 = '道具', 名称 = '照妖镜', 价格 = 1 },
    { 类别 = '道具', 名称 = '锦斓袈裟', 价格 = 1 },
    { 类别 = '道具', 名称 = '九环锡杖', 价格 = 1 },
    { 类别 = '道具', 名称 = '移魂换魄简', 价格 = 1 },
    { 类别 = '道具', 名称 = '附魂珠', 价格 = 1 },
    { 类别 = '道具', 名称 = '引魂灯', 价格 = 1 },
    { 类别 = '道具', 名称 = '紫霞仙子的金铃', 价格 = 1 },
    { 类别 = '道具', 名称 = '度亡经', 价格 = 1 },
    { 类别 = '道具', 名称 = '佛谕', 价格 = 1 },
    { 类别 = '道具', 名称 = '雷鸟的书信', 价格 = 1 },
    { 类别 = "道具", 名称 = "九叶琼芝草", 价格 = 1 },
    { 类别 = "道具", 名称 = "手镯", 价格 = 1 },
    { 类别 = "道具", 名称 = "金铭石", 价格 = 1 },
    { 类别 = '道具', 名称 = '血书', 价格 = 1 },
    { 类别 = "道具", 名称 = "诏书", 价格 = 1 },
    { 类别 = "道具", 名称 = "九齿钉耙", 价格 = 1 },
    { 类别 = '道具', 名称 = '瞌睡虫', 价格 = 1 },
    { 类别 = '道具', 名称 = '净瓶', 价格 = 1 },
    { 类别 = '道具', 名称 = '金击子', 价格 = 1 },
    { 类别 = '道具', 名称 = '丹盘', 价格 = 1 },
    { 类别 = '道具', 名称 = '白骨仙的头钗', 价格 = 1 },
    { 类别 = '道具', 名称 = '乾坤八卦镜', 价格 = 1 },
    { 类别 = '道具', 名称 = '嫦娥的饰物', 价格 = 1 },
    { 类别 = '道具', 名称 = '清心玉明镜', 价格 = 1 },
    { 类别 = '道具', 名称 = '八戒的情书', 价格 = 1 },
 -- { 类别 = '道具', 名称 = '', 价格 = 1 },
}

function 商店:取商品()
    return list
end

function 商店:购买(玩家, i, n)
    if not 验证数字(n) then
        return
    end
    local 总价 = n * list[i].价格
    local r = 玩家:选择窗口('请选择扣除货币#Y注:师贡购买道具无法交易！\nmenu\n1|师贡\n\n2|银子')
    if not r then
        return
    end
    if r == "1" then
        return self:师贡购买(玩家, i, n)
    elseif r == "2" then
        return self:银子购买(玩家, i, n)
    end
end

function 商店:师贡购买(玩家, i, n)
    local 总价 = n * list[i].价格

    local t = 复制表(list[i])
    t.类别 = nil
    t.价格 = nil
    t.任务物品 = true
    t.禁止交易 = true
    local 物品表 = {}
    local 第一 = 生成物品(t)
    if 第一.是否叠加 then
        第一.数量 = n
        table.insert(物品表, 第一)
    else
        for _ = 1, n do
            table.insert(物品表, 生成物品(t))
        end
    end
    if not 玩家:物品检查添加(物品表) then
        return '#Y空间不足'
    end
    if 玩家:扣除师贡(总价) then
        玩家:添加物品_无提示(物品表)
        玩家:提示窗口('#Y你购买了%s个#G%s', n, t.名称)
    end
end

function 商店:银子购买(玩家, i, n)
    local 总价 = n * list[i].价格
    if 玩家.银子 >= 总价 then
        local t = 复制表(list[i])
        t.类别 = nil
        t.价格 = nil
        t.禁止交易 = true
        local 物品表 = {}
        local 第一 = 生成物品(t)
        if 第一.是否叠加 then
            第一.数量 = n
            table.insert(物品表, 第一)
        else
            for _ = 1, n do
                table.insert(物品表, 生成物品(t))
            end
        end
        if 玩家:添加物品_无提示(物品表) then
            玩家:扣除银子(总价)
            玩家:提示窗口('#Y你购买了%s个#G%s#Y,共花费%s银两。', n, t.名称, 总价)
            return true
        else
            return '#Y空间不足'
        end
    else
        return '#Y你的银两不足，不能购买！'
    end
end

return 商店
