local 商店 = {}

local list = {
    -- { 类别 = "道具", 名称 = "召唤兽内丹", 技能 = "浩然正气", 价格 = 100000 },
    -- { 类别 = "道具", 名称 = "召唤兽内丹", 技能 = "借力打力", 价格 = 100000 },
    -- { 类别 = "道具", 名称 = "召唤兽内丹", 技能 = "隔山打牛", 价格 = 100000 },
    -- { 类别 = "道具", 名称 = "召唤兽内丹", 技能 = "暗渡陈仓", 价格 = 100000 },
    -- { 类别 = "道具", 名称 = "召唤兽内丹", 技能 = "凌波微步", 价格 = 100000 },
    -- { 类别 = "道具", 名称 = "召唤兽内丹", 技能 = "梅花三弄", 价格 = 100000 },
    -- { 类别 = "道具", 名称 = "召唤兽内丹", 技能 = "红颜白发", 价格 = 100000 },
    -- { 类别 = "道具", 名称 = "召唤兽内丹", 技能 = "开天辟地", 价格 = 100000 },
    -- { 类别 = "道具", 名称 = "召唤兽内丹", 技能 = "万佛朝宗", 价格 = 100000 },
    -- { 类别 = "道具", 名称 = "召唤兽内丹", 技能 = "天魔解体", 价格 = 100000 },
    -- { 类别 = "道具", 名称 = "召唤兽内丹", 技能 = "分光化影", 价格 = 100000 },
    -- { 类别 = "道具", 名称 = "召唤兽内丹", 技能 = "小楼夜哭", 价格 = 100000 },
    -- { 类别 = "道具", 名称 = "召唤兽内丹", 技能 = "青面獠牙", 价格 = 100000 },
    -- { 类别 = "道具", 名称 = "召唤兽内丹", 技能 = "霹雳流星", 价格 = 100000 },
    -- { 类别 = "道具", 名称 = "召唤兽内丹", 技能 = "大海无量", 价格 = 100000 },
    -- { 类别 = "道具", 名称 = "召唤兽内丹", 技能 = "祝融取火", 价格 = 100000 },
    -- { 类别 = "道具", 名称 = "召唤兽内丹", 技能 = "乘风破浪", 价格 = 100000 },
    -- { 类别 = "道具", 名称 = "灵兽要诀", 价格 = 5000000 },


    { 类别 = "道具", 名称 = "霄汉鼎", 属性 = "#Y抗风+3", 参数 = 3, 价格 = 50000 },
    { 类别 = "道具", 名称 = "沧海珠", 属性 = "#Y抗水+3", 参数 = 3, 价格 = 50000 },
    { 类别 = "道具", 名称 = "蓝田玉", 属性 = "#Y抗雷+3", 参数 = 3, 价格 = 50000 },
    { 类别 = "道具", 名称 = "烈焰砂", 属性 = "#Y抗火+3", 参数 = 3, 价格 = 50000 },
    { 类别 = "道具", 名称 = "灵犀角", 属性 = "#Y抗混乱+3", 参数 = 3, 价格 = 50000 },
    { 类别 = "道具", 名称 = "五溪散", 属性 = "#Y抗昏睡+3", 参数 = 3, 价格 = 50000 },
    { 类别 = "道具", 名称 = "雪蟾蜍", 属性 = "#Y抗中毒+3", 参数 = 3, 价格 = 50000 },
    { 类别 = "道具", 名称 = "云罗帐", 属性 = "#Y抗封印+3", 参数 = 3, 价格 = 50000 },
    { 类别 = "道具", 名称 = "武帝袍", 属性 = "#Y物理吸收+3", 参数 = 3, 价格 = 50000 },
    { 类别 = "道具", 名称 = "盘古石", 属性 = "#Y抗仙法+0.5", 参数 = 3, 价格 = 50000 },
    { 类别 = "普通装备", 名称 = "布鞋", 价格 = 500 },
    { 类别 = "普通装备", 名称 = "佛珠", 价格 = 500 },
    { 类别 = "道具", 名称 = "金柳露", 价格 = 500000 },
    { 类别 = "普通装备", 名称 = "夜明珠", 价格 = 200000 },
    { 类别 = "道具", 名称 = "卧龙丹", 价格 = 200000 },
    { 类别 = "道具", 名称 = "龙凤石", 价格 = 500000 },





}






local _描述 = {
    浩然正气 = "#Y浩然正气:#G召唤兽物理攻击，有几率附加造成按对方自身法力百分比的伤害。",
    暗渡陈仓 = "#Y暗渡陈仓:#G此技能在物理攻击的时候能够忽视对手一定的躲闪和反击进行攻击。",
    借力打力 = "#Y借力打力:#G此技能在受到物理攻击的一回合内有一定的几率产生反击效果。",
    凌波微步 = "#Y凌波微步:#G此此技能提高召唤兽一定的躲闪率。",
    隔山打牛 = "#Y隔山打牛:#G物理攻击的时候有一定几率对攻击对象周围的某个目标造成伤害。",
    分光化影 = "#Y分光化影:#G此技能通过牺牲自己的HP给对手造成MP伤害。",
    天魔解体 = "#Y天魔解体:#G此技能通过牺牲自己的HP给对手造成HP伤害。",
    小楼夜哭 = "#Y小楼夜哭:#G此技能通过牺牲自己的MP给对手造成MP伤害。",
    青面獠牙 = "#Y青面獠牙:#G此技能通过牺牲自己的MP给对手造成HP伤害。",
    乘风破浪 = "#Y乘风破浪:#G此技能在物理攻击的时候有一定的几率产生风系法术伤害。",
    霹雳流星 = "#Y霹雳流星:#G此技能在物理攻击的时候有一定的几率产生雷系法术伤害。",
    大海无量 = "#Y大海无量:#G此技能在物理攻击的时候有一定的几率产生水系法术伤害。",
    祝融取火 = "#Y祝融取火:#G此技能在物理攻击的时候有一定的几率产生火系法术伤害。",
    红颜白发 = "#Y红颜白发:#G此技能在使用仙法攻击的时候有一定几率出现狂暴，使伤害增加。",
    梅花三弄 = "#Y梅花三弄:#G此技能在使用仙法攻击的时候有一定几率出现法术连击。",
    开天辟地 = "#Y开天辟地:#G此技能在使用仙法攻击的时候有一定几率忽视对方的法术抗性。",
    万佛朝宗 = "#Y万佛朝宗:#G此技能有一定几率将伤害反震。",

}

local function 取描述(self)
    return string.format("#Y%s#r#Y技能等级：#G%s#Y转#G%s#Y级",
        _描述[self.技能],
        self.转生 or 0,
        self.等级 or 1
    )
end

for i, v in ipairs(list) do
    if v.技能 then
        v.属性 = 取描述(v)
    end
end

function 商店:取商品()
    return list
end

function 商店:购买(玩家, i, n)
    if not 验证数字(n) then
        return
    end
    local 总价 = n * list[i].价格
    local r = 玩家:选择窗口('请选择扣除货币#Y注:师贡购买道具无法交易！\nmenu\n1|师贡\n\n2|银子')
    if not r then
        return
    end
    if r == "1" then
        return self:师贡购买(玩家, i, n)
    elseif r == "2" then
        return self:银子购买(玩家, i, n)
    end
end

function 商店:师贡购买(玩家, i, n)
    local 总价 = n * list[i].价格

    local t = 复制表(list[i])
    t.类别 = nil
    t.价格 = nil
    t.禁止交易 = true
    local 物品表 = {}
    local 第一 = 生成物品(t)
    if 第一.是否叠加 then
        第一.数量 = n
        table.insert(物品表, 第一)
    else
        for _ = 1, n do
            table.insert(物品表, 生成物品(t))
        end
    end
    if not 玩家:物品检查添加(物品表) then
        return '#Y空间不足'
    end
    if 玩家:扣除师贡(总价) then
        玩家:添加物品_无提示(物品表)
        玩家:提示窗口('#Y你购买了%s个#G%s', n, t.名称)
    end
end

function 商店:银子购买(玩家, i, n)
    local 总价 = n * list[i].价格
    if 玩家.银子 >= 总价 then
        local t = 复制表(list[i])
        t.类别 = nil
        t.价格 = nil
        t.属性 = nil
        t.热卖 = nil
        local 物品表 = {}
        local 第一 = 生成物品(t)
        if 第一.是否叠加 then
            第一.数量 = n
            table.insert(物品表, 第一)
        else
            for _ = 1, n do
                table.insert(物品表, 生成物品(t))
            end
        end
        if 玩家:添加物品_无提示(物品表) then
            玩家:扣除银子(总价)
            玩家:提示窗口('#Y你购买了%s个#G%s#Y,共花费%s银两。', n, t.名称, 总价)
            return true
        else
            return '#Y空间不足'
        end

    else
        return '#Y你的银两不足，不能购买！'
    end
end

return 商店
