local 商店 = {}

local list = {
    { 类别 = '道具', 名称 = '组队飞行符', 价格 = 500000 },
    { 类别 = '道具', 名称 = '月光宝盒',属性 = "#Y可使用300次 ", 价格 = 20000000 },
    { 类别 = '道具', 名称 = '高级孔明灯', 价格 = 5000000 },
    { 类别 = "道具", 名称 = '龙凤石', 价格 = 100000 },
    { 类别 = "道具", 名称 = '混元丹', 价格 = 100000 },
    { 类别 = "道具", 名称 = '卧龙丹', 价格 = 100000 },
    { 类别 = "道具", 名称 = '忘忧草', 价格 = 100000 },
    { 类别 = "道具", 名称 = '忘魂草', 价格 = 100000 },
    { 类别 = "道具", 名称 = '伐骨洗髓丹', 价格 = 500000 },
    { 类别 = "道具", 名称 = '超级金柳露', 价格 = 1000000 },
    { 类别 = "道具", 名称 = '超级星梦石', 价格 = 10000000 },
    { 类别 = "道具", 名称 = '修正卡', 价格 = 10000000 },
    { 类别 = "道具", 名称 = '抗雷符', 价格 = 100000000 },
 -- { 类别 = '道具', 名称 = '特赦令', 价格 = 50000000 },
	


}

function 商店:取商品()
    return list
end

function 商店:购买(玩家, i, n)
    if not 验证数字(n) then
        return
    end
    local 总价 = n * list[i].价格
    if 玩家.银子 >= 总价 then
        local t = 复制表(list[i])
        t.类别 = nil
        t.价格 = nil
        local 物品表 = {}
        local 第一 = 生成物品(t)
        if 第一.是否叠加 then
            第一.数量 = n
            table.insert(物品表, 第一)
        else
            for _ = 1, n do
                table.insert(物品表, 生成物品(t))
            end
        end
        if 玩家:添加物品_无提示(物品表) then
            玩家:扣除银子(总价)
            玩家:提示窗口('#Y你购买了%s个#G%s#Y,共花费%s银两。', n, t.名称, 总价)
            return true
        else
            return '#Y空间不足'
        end
    else
        return '#Y你的银两不足，不能购买！'
    end
end

return 商店
