local 商店 = {}


local list = {
    { 类别 = "道具", 名称 = "高级玉佩", 价格 = 1000000, 高级 = 1, 孩子是否可用 = true, 是否引导道具 = true },
    { 类别 = "道具", 名称 = "高级鬼谷子", 价格 = 1000000, 高级 = 1, 孩子是否可用 = true, 是否引导道具 = true },
    { 类别 = "道具", 名称 = "高级六韬三略", 价格 = 1000000, 高级 = 1, 孩子是否可用 = true, 是否引导道具 = true },
    { 类别 = "道具", 名称 = "高级百年茯苓", 价格 = 1000000, 高级 = 1, 孩子是否可用 = true, 是否引导道具 = true },
    { 类别 = "道具", 名称 = "高级戒指", 价格 = 1000000, 高级 = 1, 孩子是否可用 = true, 是否引导道具 = true },
    { 类别 = "道具", 名称 = "高级千字文", 价格 = 1000000, 高级 = 1, 孩子是否可用 = true, 是否引导道具 = true },
    { 类别 = "道具", 名称 = "高级百年雪莲", 价格 = 1000000, 高级 = 1, 孩子是否可用 = true, 是否引导道具 = true },
    { 类别 = "道具", 名称 = "高级内功心法", 价格 = 1000000, 高级 = 1, 孩子是否可用 = true, 是否引导道具 = true },
    { 类别 = "道具", 名称 = "高级百年何首乌", 价格 = 1000000, 高级 = 1, 孩子是否可用 = true, 是否引导道具 = true },
    { 类别 = "道具", 名称 = "高级三字经", 价格 = 1000000, 高级 = 1, 孩子是否可用 = true, 是否引导道具 = true },
    { 类别 = "道具", 名称 = "高级孙子兵法", 价格 = 1000000, 高级 = 1 },
    { 类别 = "道具", 名称 = "高级琴谱", 价格 = 1000000, 高级 = 1 },
    { 类别 = "道具", 名称 = "高级剑诀", 价格 = 1000000, 高级 = 1 },
    { 类别 = "道具", 名称 = "高级诗经", 价格 = 1000000, 高级 = 1 },
  --  { 类别 = "道具", 名称 = "仙童果", 价格 = 3000000 },
  --  { 类别 = "道具", 名称 = "无字天书", 价格 = 3000000 },
    { 类别 = '道具', 名称 = '琼浆玉液', 价格 = 2000000 },
    { 类别 = '道具', 名称 = '猕猴桃', 价格 = 1000000 },
    { 类别 = '道具', 名称 = '金丹', 价格 = 5000000 },
   -- { 类别 = "材料", 名称 = "九彩云龙珠", 价格 = 72000, 价值 = 130, 属性 = '价值:130' },
   -- { 类别 = "材料", 名称 = "内丹精华", 价格 = 55000 },
   -- { 类别 = "材料", 名称 = "血玲珑", 价格 = 50000, 价值 = 125, 属性 = '价值:125' },
}

function 商店:取商品()
    return list
end

function 商店:购买(玩家, i, n) --杜老板在哪
    if not 验证数字(n) then
        return
    end
    local 总价 = n * list[i].价格
    if 玩家.银子 >= 总价 then
        local t = 复制表(list[i])
        t.类别 = nil
        t.价格 = nil
        local 物品表 = {}
        local 物品 = 生成孩子引导道具(t)
        if 物品.是否叠加 then
            物品.数量 = n
            table.insert(物品表, 物品)
        else
            for _ = 1, n do
                table.insert(物品表, 生成孩子引导道具(t))
            end
        end
        if 玩家:添加物品_无提示(物品表) then
            玩家:扣除银子(总价)
            玩家:提示窗口('#Y你购买了%s个#G%s#Y,共花费%s银两。', n, t.名称, 总价)
            return true
        else
            return '#Y空间不足'
        end
    else
        return '#Y你的银两不足，不能购买！'
    end
end

return 商店
