local 任务 = {
    名称 = '九天巽风',
    别名 = '九天巽风',
    类型 = '人物飞升',
    是否可取消 = false
}

function 任务:任务初始化()
    if not self.进度 then
        self.进度 = 1
    end
    if not self.对话进度 then
        self.对话进度 = 0
    end
end

local _描述 = {



}


function 任务:任务取详情()

    return '欲辟三灾利害，须问道法道源头。说到这巽风之灾，世间莫过于#G#u#[1147|20|16|$镇元大仙#]#u#W更懂得了。'
end

local _台词 = {
    { 台词 = "镇元大仙好", 头像 = 0, 结束 = false },
    { 台词 = "你~说~什~么？", 头像 = 3062, 结束 = false },
    { 台词 = "我~说~你~好~啊~", 头像 = 0, 结束 = false },
    { 台词 = "风太大我~听~不~清~", 头像 = 3062, 结束 = false },
    { 台词 = "今天怎么这么大风啊？", 头像 = 0, 结束 = false },
    { 台词 = "老朽近日风雷之术又有新突破。演示一番而已。", 头像 = 3062, 结束 = false },
    { 台词 = "我欲飞升，这风是否比得上那巽风厉害？", 头像 = 0, 结束 = false },
    { 台词 = "此风便是九天巽风，乃老朽取那鲲鹏振翅之风炼化而成", 头像 = 3062, 结束 = false },
    { 台词 = "太好了大仙！我要风！", 头像 = 0, 结束 = false },
    { 台词 = "你要疯你赶紧吃药！", 头像 = 3062, 结束 = false },
    { 台词 = "我就要这个巽风啊！我要飞升！", 头像 = 0, 结束 = false },
    { 台词 = "这风可不是随便玩玩的，刮的你骨肉消融。少侠可要认真对待。", 头像 = 3062,
        结束 = true },
}

function 任务:取对话(玩家, NPC)
    local r = _台词[self.对话进度]
    local 台词, 头像, 结束 = r.台词, r.头像, r.结束
    if 头像 == 0 then
        头像 = 玩家.外形
    end
    return 台词, 头像, 结束
end

function 任务:任务NPC对话(玩家, NPC)
    if self.进度 == 1 then
        if NPC.名称 == "镇元大仙" then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家, NPC)
            if NPC.结束 == true then
                self.进度 = 2
            end
        end
    elseif self.进度 == 2 then
        if NPC.名称 == "镇元大仙" then
            NPC.台词 = "少侠想好了么？\nmenu\n21|准备好了！大仙你死命的吹吧！\n99|久仰久仰"
        end
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if self.进度 == 2 then
        if NPC.名称 == "镇元大仙" then
            if i == "21" then
                local r = 玩家:进入战斗('scripts/task/飞升/九天巽风.lua')
            end
        end
    end
end

function 任务:完成(玩家)
    if self.进度 == 2 then
        玩家:最后对话("吹的我脸都歪了", 玩家.外形)
        玩家.其它.九天巽风 = 1
        if 玩家.其它.忘川水 == 1 and 玩家.其它.南明离火 == 1 then
            local r = 玩家:取任务("正果正身")
            if r then
                r:完成试炼(玩家)
            end
        end
        self:删除()
    end
end
local _怪物 = {
    { 名称 = "九天风神", 外形 = 2109, 等级 = 180, 气血 = 36000000, 魔法 = 81111, 攻击 = 26845, 速度 = 2000,
        施法几率 = 100,
        抗性 = {
            物理吸收 = 50,
            抗震慑 = 45,
            抗混乱 = 130,
            抗封印 = 130,
            抗昏睡 = 130,
            抗水 = -89,
            抗雷 = -89,
            抗火 = -89,
            抗风 = -89,
            忽视抗封 = 25,
            忽视抗睡 = 25,
            忽视抗混 = 35,
            加强昏睡 = 40,
            加强混乱 = 50,
            加强封印 = 40,


        },

        技能 = {
            { 名称 = "作壁上观", 熟练度 = 25000 },
            { 名称 = "失心狂乱", 熟练度 = 25000 },
            { 名称 = "借刀杀人", 熟练度 = 25000 },
            { 名称 = "失心狂乱", 熟练度 = 25000 },
            { 名称 = "借刀杀人", 熟练度 = 25000 },
        },
    },
    { 名称 = "九天风神", 外形 = 2109, 等级 = 180, 气血 = 50000000, 魔法 = 80000, 攻击 = 56540, 速度 = 2800,
        施法几率 = 50,
        抗性 = {
            物理吸收 = 50,
            抗震慑 = 45,
            抗混乱 = 130,
            抗封印 = 135,
            抗昏睡 = 130,
            抗水 = -89,
            抗雷 = -89,
            抗火 = -89,
            抗风 = -89,
            加强毒 = 50,
            忽视抗毒 = 30,
            加强毒伤害结果 = 500,
            连击率 = 80,
            致命几率 = 80,
            连击次数 = 5,
            忽视防御几率 = 100,
            忽视防御程度 = 100,

        },
        技能 = {
            { 名称 = "含情脉脉", 熟练度 = 20000 },
            { 名称 = "阎罗追命", 熟练度 = 25000 },
            { 名称 = "销魂蚀骨", 熟练度 = 25000 },
            -- { 名称 = "天罗地网", 熟练度 = 25000 },
        },
    },
    { 名称 = "风童", 外形 = 2068, 等级 = 180, 气血 = 48000000, 魔法 = 80000, 攻击 = 6845, 速度 = 1850,
        施法几率 = 100,
        抗性 = {
            物理吸收 = 25,
            抗震慑 = 25,
            抗混乱 = 130,
            抗封印 = 125,
            抗昏睡 = 120,
            抗水 = -89,
            抗雷 = -89,
            抗火 = -89,
            抗风 = -89,
            加强火 = 50,
            忽视抗火 = 30,
            火系狂暴几率 = 30,
            加强水 = 50,
            忽视抗水 = 30,
            水系狂暴几率 = 30,
            加强雷 = 50,
            忽视抗雷 = 30,
            雷系狂暴几率 = 30,
        },
        技能 = {
            { 名称 = "九阴纯火", 熟练度 = 25000 },
            { 名称 = "烈火骄阳", 熟练度 = 25000 },
            { 名称 = "蛟龙出海", 熟练度 = 25000 },
            { 名称 = "九龙冰封", 熟练度 = 25000 },
            { 名称 = "电闪雷鸣", 熟练度 = 25000 },
            { 名称 = "天诛地灭", 熟练度 = 25000 },
        },




    },
    { 名称 = "风童", 外形 = 2068, 等级 = 180, 气血 = 72000000, 魔法 = 80000,
        攻击 = 76845, 速度 = 1900, 施法几率 = 90,
        抗性 = {
            物理吸收 = 50,
            防御值 = 15000,
            抗震慑 = 25,
            抗混乱 = 135,
            抗封印 = 120,
            抗昏睡 = 135,
            抗水 = -157,
            抗雷 = -157,
            抗火 = -157,
            抗风 = -157,

            忽视抗封 = 53,
            忽视抗睡 = 53,
            忽视抗混 = 53,
            加强昏睡 = 53,
            加强混乱 = 53,
            加强封印 = 53,
            加强毒 = 150,
            忽视抗毒 = 150,
            加强毒伤害结果 = 10000,
        },
        技能 = {
            { 名称 = "百日眠", 熟练度 = 25000 },
            { 名称 = "迷魂醉", 熟练度 = 25000 },
            { 名称 = "四面楚歌", 熟练度 = 25000 },
            { 名称 = "作壁上观", 熟练度 = 25000 },
            { 名称 = "万毒攻心", 熟练度 = 25000 },
            { 名称 = "断肠烈散", 熟练度 = 25000 },
        },











    },
    { 名称 = "风童", 外形 = 2068, 等级 = 180, 气血 = 72000000, 魔法 = 80000,
        攻击 = 6845, 速度 = -800, 施法几率 = 100,
        抗性 = {
            物理吸收 = 25,
            抗震慑 = 25,
            抗混乱 = 130,
            抗封印 = 125,
            抗昏睡 = 135,
            抗水 = -89,
            抗雷 = -89,
            抗火 = -89,
            抗风 = -89,

            忽视抗封 = 10,
            忽视抗睡 = 10,
            忽视抗混 = 10,
            加强昏睡 = 20,
            加强混乱 = 20,
            加强封印 = 20,
            加强毒 = 50,
            忽视抗毒 = 30,
            加强毒伤害结果 = 10500,

        },
        技能 = {

            { 名称 = "万毒攻心", 熟练度 = 25000 },
            { 名称 = "断肠烈散", 熟练度 = 25000 },
        },

    },
    { 名称 = "风童", 外形 = 2068, 等级 = 140, 气血 = 72000000, 魔法 = 80000,
        攻击 = 6845, 速度 = 1700, 施法几率 = 100,
        抗性 = {
            物理吸收 = 30,
            抗震慑 = 25,
            抗混乱 = 135,
            抗封印 = 125,
            抗昏睡 = 130,
            抗风 = 50,
            抗水 = -127,
            抗雷 = -127,
            抗火 = -127,
            反震几率 = 40,
            反震程度 = 51,
            加强雷 = 50,
            忽视抗雷 = 30,
            雷系狂暴几率 = 30,
            加强水 = 50,
            忽视抗水 = 30,
            水系狂暴几率 = 30,
            加强火 = 50,
            忽视抗火 = 30,
            火系狂暴几率 = 30,
        },
        技能 = {
            { 名称 = "袖里乾坤", 熟练度 = 20000 },
            { 名称 = "风雷涌动", 熟练度 = 20000 },
            { 名称 = "蛟龙出海", 熟练度 = 20000 },
            { 名称 = "九龙冰封", 熟练度 = 20000 },
            { 名称 = "电闪雷鸣", 熟练度 = 20000 },
            { 名称 = "天诛地灭", 熟练度 = 20000 },
        },











    },


}

--=========================战斗======================================
function 任务:战斗初始化(玩家, NPC)
    for i = 1, 6 do
        local r = 生成战斗怪物(_怪物[i])
        self:加入敌方(i, r)
    end
end

function 任务:战斗回合开始(dt)


end

function 任务:战斗结束(s)
    if s then
        local zg = self:取对象(1)
        if zg then
            for _, v in self:遍历我方() do
                if v.是否玩家 then
                    local r = v.对象.接口:取任务("九天巽风")
                    if r then
                        r:完成(v.对象.接口)
                    end
                end
            end
        end
    end
end

return 任务
