local 任务 = {
    名称 = '南明离火',
    别名 = '南明离火',
    类型 = '人物飞升',
    是否可取消 = false
}

function 任务:任务初始化()
    if not self.进度 then
        self.进度 = 1
    end
    if not self.对话进度 then
        self.对话进度 = 1
    end
end

function 任务:任务取详情()
    return "#W欲辟三灾利害，须问道法道源头。说到这离火之灾，或许常年烧炉子的 #G#u#[1113|12|11|$太上老君#]#u#W可以帮你"
end

local _台词 = {
    { 台词 = "见过太上老君", 头像 = 0, 结束 = false },
    { 台词 = "小友今日怎么这么有礼貌？是不是又有事情求我啊？", 头像 = 6535, 结束 = false },
    { 台词 = "哈哈，老君慧眼！小子确是有事相求", 头像 = 0, 结束 = false },
    { 台词 = "丑话说在前头,想从我这里骗丹药吃，可是没有！", 头像 = 6535, 结束 = false },
    { 台词 = "太上老君哪里的话...我这不是想问飞升之道，特来与老君问那离火之灾的事情。",
        头像 = 0, 结束 = false },
    { 台词 = "这说来不难。这炉子里的南明离火，非天火非凡火。却着实不好寻觅。你若不曾试炼过，待它自行从你涌泉烧起，直透泥丸。就五脏成灰咯~",
        头像 = 6535, 结束 = false },
    { 台词 = "说的这么恐怖，我又不是吓大的...", 头像 = 0, 结束 = false },
    { 台词 = "呵呵......", 头像 = 6535, 结束 = false },
    { 台词 = "你呵呵什么！！！你鄙视我你直说！", 头像 = 0, 结束 = false },
    { 台词 = "想要透过这试炼，却是要进我炉灶，与离火熬炼七七四十九个时辰，少侠可有胆量？",
        头像 = 6535, 结束 = false },
    { 台词 = "额......老君你要是馋烤肉了我可以买二斤送你嘛，没事搞什么巴比Q！", 头像 = 0,
        结束 = false },
    { 台词 = "呵呵....", 头像 = 6535, 结束 = false },
    { 台词 = "嘿！我还真不能被你看不起！来就来！我不怕！", 头像 = 0, 结束 = false },
    { 台词 = "少侠准备好了么?", 头像 = 6535, 结束 = false },
    { 台词 = "来吧！我这就进炉了！", 头像 = 0, 结束 = false },
    { 台词 = "少侠想多加孜然还是多加辣椒？", 头像 = 6535, 结束 = false },
    { 台词 = "！！！", 头像 = 0, 结束 = false },
    { 台词 = "玩笑玩笑......少侠但去无妨。需要起火便知会一声。", 头像 = 6535, 结束 = true },
}


function 任务:取对话(玩家, NPC)
    local r = _台词[self.对话进度]
    local 台词, 头像, 结束 = r.台词, r.头像, r.结束

    if 头像 == 0 then
        头像 = 玩家.外形
    end

    return 台词, 头像, 结束
end

function 任务:任务NPC对话(玩家, NPC)
    if NPC.名称 == "太上老君" then
        if self.进度 == 1 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家, NPC) --19
            if NPC.结束 == true then
                self.进度 = 2
            end
        elseif self.进度 == 2 then
            NPC.台词 = "少侠，情况如何？\nmenu\n21|老君！点火吧！\n99|久仰久仰。  "
        end
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if self.进度 == 2 then
        if i == "21" then
            local r = 玩家:进入战斗('scripts/task/飞升/南明离火.lua')
        end
    end
end

function 任务:完成(玩家)
    if self.进度 == 2 then
        玩家:最后对话("终于赢了...感觉自己已经八成熟了", 玩家.外形)
        玩家.其它.南明离火 = 1
        if 玩家.其它.忘川水 == 1 and 玩家.其它.九天巽风 == 1 then
            local r = 玩家:取任务("正果正身")
            if r then
                r:完成试炼(玩家)
            end
        end
        self:删除()
    end
end
local _怪物 = {
    { 名称 = "离火精魄", 外形 = 2377, 等级 = 180, 气血 = 36000000, 魔法 = 81111, 攻击 = 26845, 速度 = 2000,
        施法几率 = 100,
        抗性 = {
            物理吸收 = 50,
            抗震慑 = 45,
            抗混乱 = 130,
            抗封印 = 130,
            抗昏睡 = 130,
            抗水 = -89,
            抗雷 = -89,
            抗火 = -89,
            抗风 = -89,
            忽视抗封 = 25,
            忽视抗睡 = 25,
            忽视抗混 = 35,
            加强昏睡 = 40,
            加强混乱 = 50,
            加强封印 = 40,


        },

        技能 = {
            { 名称 = "作壁上观", 熟练度 = 25000 },
            { 名称 = "失心狂乱", 熟练度 = 25000 },
            { 名称 = "借刀杀人", 熟练度 = 25000 },
            { 名称 = "失心狂乱", 熟练度 = 25000 },
            { 名称 = "借刀杀人", 熟练度 = 25000 },
        },
    },
    { 名称 = "离火精魄", 外形 = 2377, 等级 = 180, 气血 = 50000000, 魔法 = 80000, 攻击 = 56540, 速度 = 2800,
        施法几率 = 50,
        抗性 = {
            物理吸收 = 50,
            抗震慑 = 45,
            抗混乱 = 130,
            抗封印 = 135,
            抗昏睡 = 130,
            抗水 = -89,
            抗雷 = -89,
            抗火 = -89,
            抗风 = -89,
            加强毒 = 50,
            忽视抗毒 = 30,
            加强毒伤害结果 = 500,
            连击率 = 80,
            致命几率 = 80,
            连击次数 = 5,
            忽视防御几率 = 100,
            忽视防御程度 = 100,

        },
        技能 = {
            { 名称 = "含情脉脉", 熟练度 = 20000 },
            { 名称 = "阎罗追命", 熟练度 = 25000 },
            { 名称 = "销魂蚀骨", 熟练度 = 25000 },
            -- { 名称 = "天罗地网", 熟练度 = 25000 },
        },
    },
    { 名称 = "炎灵", 外形 = 2104, 等级 = 180, 气血 = 48000000, 魔法 = 80000, 攻击 = 6845, 速度 = 1850,
        施法几率 = 100,
        抗性 = {
            物理吸收 = 25,
            抗震慑 = 25,
            抗混乱 = 130,
            抗封印 = 125,
            抗昏睡 = 120,
            抗水 = -89,
            抗雷 = -89,
            抗火 = -89,
            抗风 = -89,
            加强火 = 50,
            忽视抗火 = 30,
            火系狂暴几率 = 30,
            加强水 = 50,
            忽视抗水 = 30,
            水系狂暴几率 = 30,
            加强雷 = 50,
            忽视抗雷 = 30,
            雷系狂暴几率 = 30,
        },
        技能 = {
            { 名称 = "九阴纯火", 熟练度 = 25000 },
            { 名称 = "烈火骄阳", 熟练度 = 25000 },
            { 名称 = "蛟龙出海", 熟练度 = 25000 },
            { 名称 = "九龙冰封", 熟练度 = 25000 },
            { 名称 = "电闪雷鸣", 熟练度 = 25000 },
            { 名称 = "天诛地灭", 熟练度 = 25000 },
        },




    },
    { 名称 = "炎灵", 外形 = 2104, 等级 = 180, 气血 = 72000000, 魔法 = 80000,
        攻击 = 76845, 速度 = 1900, 施法几率 = 90,
        抗性 = {
            物理吸收 = 50,
            防御值 = 15000,
            抗震慑 = 25,
            抗混乱 = 135,
            抗封印 = 120,
            抗昏睡 = 135,
            抗水 = -157,
            抗雷 = -157,
            抗火 = -157,
            抗风 = -157,

            忽视抗封 = 53,
            忽视抗睡 = 53,
            忽视抗混 = 53,
            加强昏睡 = 53,
            加强混乱 = 53,
            加强封印 = 53,
            加强毒 = 150,
            忽视抗毒 = 150,
            加强毒伤害结果 = 10000,
        },
        技能 = {
            { 名称 = "百日眠", 熟练度 = 25000 },
            { 名称 = "迷魂醉", 熟练度 = 25000 },
            { 名称 = "四面楚歌", 熟练度 = 25000 },
            { 名称 = "作壁上观", 熟练度 = 25000 },
            { 名称 = "万毒攻心", 熟练度 = 25000 },
            { 名称 = "断肠烈散", 熟练度 = 25000 },
        },











    },
    { 名称 = "炎灵", 外形 = 2104, 等级 = 180, 气血 = 72000000, 魔法 = 80000,
        攻击 = 6845, 速度 = -800, 施法几率 = 100,
        抗性 = {
            物理吸收 = 25,
            抗震慑 = 25,
            抗混乱 = 130,
            抗封印 = 125,
            抗昏睡 = 135,
            抗水 = -89,
            抗雷 = -89,
            抗火 = -89,
            抗风 = -89,

            忽视抗封 = 10,
            忽视抗睡 = 10,
            忽视抗混 = 10,
            加强昏睡 = 20,
            加强混乱 = 20,
            加强封印 = 20,
            加强毒 = 50,
            忽视抗毒 = 30,
            加强毒伤害结果 = 10500,

        },
        技能 = {

            { 名称 = "万毒攻心", 熟练度 = 25000 },
            { 名称 = "断肠烈散", 熟练度 = 25000 },
        },

    },
    { 名称 = "火孩儿", 外形 = 2070, 等级 = 140, 气血 = 72000000, 魔法 = 80000,
        攻击 = 6845, 速度 = 1700, 施法几率 = 100,
        抗性 = {
            物理吸收 = 30,
            抗震慑 = 25,
            抗混乱 = 135,
            抗封印 = 125,
            抗昏睡 = 130,
            抗风 = 50,
            抗水 = -127,
            抗雷 = -127,
            抗火 = -127,
            反震几率 = 40,
            反震程度 = 51,
            加强雷 = 50,
            忽视抗雷 = 30,
            雷系狂暴几率 = 30,
            加强水 = 50,
            忽视抗水 = 30,
            水系狂暴几率 = 30,
            加强火 = 50,
            忽视抗火 = 30,
            火系狂暴几率 = 30,
        },
        技能 = {
            { 名称 = "袖里乾坤", 熟练度 = 20000 },
            { 名称 = "风雷涌动", 熟练度 = 20000 },
            { 名称 = "蛟龙出海", 熟练度 = 20000 },
            { 名称 = "九龙冰封", 熟练度 = 20000 },
            { 名称 = "电闪雷鸣", 熟练度 = 20000 },
            { 名称 = "天诛地灭", 熟练度 = 20000 },
        },











    },
    { 名称 = "火孩儿", 外形 = 2070, 等级 = 140, 气血 = 72000000, 魔法 = 80000,
        攻击 = 6845, 速度 = 1700, 施法几率 = 100,
        抗性 = {
            物理吸收 = 30,
            抗震慑 = 25,
            抗混乱 = 135,
            抗封印 = 125,
            抗昏睡 = 130,
            抗风 = 50,
            抗水 = -127,
            抗雷 = -127,
            抗火 = -127,
            反震几率 = 40,
            反震程度 = 51,
            加强雷 = 50,
            忽视抗雷 = 30,
            雷系狂暴几率 = 30,
            加强水 = 50,
            忽视抗水 = 30,
            水系狂暴几率 = 30,
            加强火 = 50,
            忽视抗火 = 30,
            火系狂暴几率 = 30,
        },
        技能 = {
            { 名称 = "袖里乾坤", 熟练度 = 20000 },
            { 名称 = "风雷涌动", 熟练度 = 20000 },
            { 名称 = "蛟龙出海", 熟练度 = 20000 },
            { 名称 = "九龙冰封", 熟练度 = 20000 },
            { 名称 = "电闪雷鸣", 熟练度 = 20000 },
            { 名称 = "天诛地灭", 熟练度 = 20000 },
        },











    },
    { 名称 = "火孩儿", 外形 = 2070, 等级 = 140, 气血 = 72000000, 魔法 = 80000,
    攻击 = 6845, 速度 = 1700, 施法几率 = 100,
    抗性 = {
        物理吸收 = 30,
        抗震慑 = 25,
        抗混乱 = 135,
        抗封印 = 125,
        抗昏睡 = 130,
        抗风 = 50,
        抗水 = -127,
        抗雷 = -127,
        抗火 = -127,
        反震几率 = 40,
        反震程度 = 51,
        加强雷 = 50,
        忽视抗雷 = 30,
        雷系狂暴几率 = 30,
        加强水 = 50,
        忽视抗水 = 30,
        水系狂暴几率 = 30,
        加强火 = 50,
        忽视抗火 = 30,
        火系狂暴几率 = 30,
    },
    技能 = {
        { 名称 = "袖里乾坤", 熟练度 = 20000 },
        { 名称 = "风雷涌动", 熟练度 = 20000 },
        { 名称 = "蛟龙出海", 熟练度 = 20000 },
        { 名称 = "九龙冰封", 熟练度 = 20000 },
        { 名称 = "电闪雷鸣", 熟练度 = 20000 },
        { 名称 = "天诛地灭", 熟练度 = 20000 },
    },











    },

}

--=========================战斗======================================
function 任务:战斗初始化(玩家, NPC)
    for i = 1, 8 do
        local r = 生成战斗怪物(_怪物[i])
        self:加入敌方(i, r)
    end
end

function 任务:战斗回合开始(dt)


end

function 任务:战斗结束(s)
    if s then
        local zg = self:取对象(1)
        if zg then
            for _, v in self:遍历我方() do
                if v.是否玩家 then
                    local r = v.对象.接口:取任务("南明离火")
                    if r then
                        r:完成(v.对象.接口)
                    end
                end
            end
        end
    end
end

return 任务
