local 任务 = {
    名称 = '忘川水',
    别名 = '忘川水',
    类型 = '人物飞升',
    是否可取消 = false
}

function 任务:任务初始化()
    if not self.进度 then
        self.进度 = 1
    end
    if not self.对话进度 then
        self.对话进度 = 0
    end
end

local _描述 = {
    ' 欲辟三灾利害，须问道法道源头。流沙河也渡过，通天河也游过。却不知这水之试炼该何处寻。#G#u#[1141|30|21|$观音姐姐#]#u#W每日拿个小瓶蛮厉害的，或许可以帮到你。',
    '#W欲辟三灾利害，须问道法道源头。说到这忘川水，或许#G#u#[1122|38|51|$孟婆#]#u#W可以帮你',
    '#W欲辟三灾利害，须问道法道源头。说到这忘川水，或许#G#u#[1122|38|51|$孟婆#]#u#W可以帮你',
}


function 任务:任务取详情()
    return _描述[self.进度]
end

local _台词 = {
    { 台词 = "姐姐好久不见，皮肤又白嫩了！莫非用了大宝?", 头像 = 0, 结束 = false },
    { 台词 = "莫学那悟空油嘴滑舌！全没个修道的体锻！", 头像 = 3059, 结束 = false },
    { 台词 = "观音姐姐，实不相瞒，我此次前来是为了讨口水喝。", 头像 = 0, 结束 = false },
    { 台词 = "啊？有日子不见你怎生变得如此放荡！", 头像 = 3059, 结束 = false },
    { 台词 = "我？淫荡？我没有啊....", 头像 = 0, 结束 = false },
    { 台词 = "才说出的话，便不认了么？", 头像 = 3059, 结束 = false },
    { 台词 = "我说讨口水喝.....咳！不是要姐姐的口水！是要一喝一口水！", 头像 = 0, 结束 = false },
    { 台词 = "呃，却是我错怪你了。", 头像 = 3059, 结束 = false },
    { 台词 = "姐姐你这想法也太不卫生了......我是为了飞升而来。", 头像 = 0, 结束 = false },
    { 台词 = "哦！我明白了，不过少侠却求错人了，那三灾利害之水，却是忘川水。", 头像 = 3059,
        结束 = false },
    { 台词 = "忘川水？", 头像 = 0, 结束 = true }, --11


    { 台词 = "少侠唱的哪里的乡村野调？", 头像 = 3040, 结束 = false },
    { 台词 = "哈哈，没事，瞎哼哼的。", 头像 = 0, 结束 = false },
    { 台词 = "少侠如今已经超出三界外不在五行中，来找我这老婆子做什么", 头像 = 3040,
        结束 = false },
    { 台词 = "我欲飞升，特向婆婆讨孟婆汤喝。", 头像 = 0, 结束 = false },
    { 台词 = "我这汤可只是转世轮回用的，怕是不顶用。", 头像 = 3040, 结束 = false },
    { 台词 = "那为何观音菩萨让我来寻你？", 头像 = 0, 结束 = false },
    { 台词 = "我这孟婆汤里的确含有忘川水，不过勾兑的量很少，你若欲飞升，直接向忘川河里一跳便是。",
        头像 = 3040, 结束 = false },
    { 台词 = "婆婆你看着我的眼睛认真听我说:我~想~飞~升！不~是~作~死！", 头像 = 0, 结束 = false },
    { 台词 = "飞升不就是作死么？都一样！", 头像 = 3040, 结束 = false },
    { 台词 = "好吧.......都是需要胆量啊", 头像 = 0, 结束 = false },
    { 台词 = "你跳河之前洗干净点儿，弄脏了河水老婆子这汤就不好卖了。", 头像 = 3040,
        结束 = true },
}

function 任务:取对话(玩家, NPC)
    local r = _台词[self.对话进度]
    local 台词, 头像, 结束 = r.台词, r.头像, r.结束

    if 头像 == 0 then
        头像 = 玩家.外形
    end

    return 台词, 头像, 结束
end

function 任务:任务NPC对话(玩家, NPC)
    if self.进度 == 1 then
        if NPC.名称 == "观音姐姐" then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家, NPC) --19
            if NPC.结束 == true then
                self.进度 = 2
            end
        end
    elseif self.进度 == 2 then
        if NPC.名称 == "孟婆" then
            if self.对话进度 == 11 then
                NPC.台词 = "悲哉六识，沉沦八苦，不有大圣，谁拯慧桥。\nmenu\n21|啊哈！给我一杯忘川水\n99|相逢亦别离 "
            else
                self.对话进度 = self.对话进度 + 1
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家, NPC)
                if NPC.结束 == true then
                    self.进度 = 3
                end
            end
        end
    elseif self.进度 == 3 then
        if NPC.名称 == "孟婆" then
            NPC.台词 = "你看这忘川，两岸开满了彼岸花哟。\nmenu\n22|二话不说三百六十度转体三周半跳进去\n99|相逢亦别离 "
        end

    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if self.进度 == 2 then
        if NPC.名称 == "孟婆" then
            if i == "21" then
                self.对话进度 = 12
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家, NPC)
            end
        end
    elseif self.进度 == 3 then
        if NPC.名称 == "孟婆" then
            if i == "22" then
                local r = 玩家:进入战斗('scripts/task/飞升/忘川水.lua')
            end
        end
    end
end

function 任务:完成(玩家)
    if self.进度 == 3 then
        --  玩家:最后对话("终于赢了...感觉自己已经八成熟了", 玩家.外形)
        玩家.其它.忘川水 = 1
        if 玩家.其它.南明离火 == 1 and 玩家.其它.九天巽风 == 1 then
            local r = 玩家:取任务("正果正身")
            if r then
                r:完成试炼(玩家)
            end
        end
        self:删除()
    end
end

local _怪物 = {
    { 名称 = "忘川水精", 外形 = 2378, 等级 = 180, 气血 = 36000000, 魔法 = 81111, 攻击 = 26845, 速度 = 2000,
        施法几率 = 100,
        抗性 = {
            物理吸收 = 50,
            抗震慑 = 45,
            抗混乱 = 130,
            抗封印 = 130,
            抗昏睡 = 130,
            抗水 = -89,
            抗雷 = -89,
            抗火 = -89,
            抗风 = -89,
            忽视抗封 = 25,
            忽视抗睡 = 25,
            忽视抗混 = 35,
            加强昏睡 = 40,
            加强混乱 = 50,
            加强封印 = 40,


        },

        技能 = {
            { 名称 = "作壁上观", 熟练度 = 25000 },
            { 名称 = "失心狂乱", 熟练度 = 25000 },
            { 名称 = "借刀杀人", 熟练度 = 25000 },
            { 名称 = "失心狂乱", 熟练度 = 25000 },
            { 名称 = "借刀杀人", 熟练度 = 25000 },
        },
    },
    { 名称 = "忘川水精", 外形 = 2378, 等级 = 180, 气血 = 50000000, 魔法 = 80000, 攻击 = 56540, 速度 = 2800,
        施法几率 = 50,
        抗性 = {
            物理吸收 = 50,
            抗震慑 = 45,
            抗混乱 = 130,
            抗封印 = 135,
            抗昏睡 = 130,
            抗水 = -89,
            抗雷 = -89,
            抗火 = -89,
            抗风 = -89,
            加强毒 = 50,
            忽视抗毒 = 30,
            加强毒伤害结果 = 500,
            连击率 = 80,
            致命几率 = 80,
            连击次数 = 5,
            忽视防御几率 = 100,
            忽视防御程度 = 100,

        },
        技能 = {
            { 名称 = "含情脉脉", 熟练度 = 20000 },
            { 名称 = "阎罗追命", 熟练度 = 25000 },
            { 名称 = "销魂蚀骨", 熟练度 = 25000 },
            -- { 名称 = "天罗地网", 熟练度 = 25000 },
        },
    },
    { 名称 = "忘川水精", 外形 = 2378, 等级 = 180, 气血 = 48000000, 魔法 = 80000, 攻击 = 6845, 速度 = 1850,
        施法几率 = 100,
        抗性 = {
            物理吸收 = 25,
            抗震慑 = 25,
            抗混乱 = 130,
            抗封印 = 125,
            抗昏睡 = 120,
            抗水 = -89,
            抗雷 = -89,
            抗火 = -89,
            抗风 = -89,
            加强火 = 50,
            忽视抗火 = 30,
            火系狂暴几率 = 30,
            加强水 = 50,
            忽视抗水 = 30,
            水系狂暴几率 = 30,
            加强雷 = 50,
            忽视抗雷 = 30,
            雷系狂暴几率 = 30,
        },
        技能 = {
            { 名称 = "九阴纯火", 熟练度 = 25000 },
            { 名称 = "烈火骄阳", 熟练度 = 25000 },
            { 名称 = "蛟龙出海", 熟练度 = 25000 },
            { 名称 = "九龙冰封", 熟练度 = 25000 },
            { 名称 = "电闪雷鸣", 熟练度 = 25000 },
            { 名称 = "天诛地灭", 熟练度 = 25000 },
        },




    },
    { 名称 = "忘川魂", 外形 = 2070, 染色 = 0x05050505, 等级 = 180, 气血 = 72000000, 魔法 = 80000,
        攻击 = 76845, 速度 = 1900, 施法几率 = 90,
        抗性 = {
            物理吸收 = 50,
            防御值 = 15000,
            抗震慑 = 25,
            抗混乱 = 135,
            抗封印 = 120,
            抗昏睡 = 135,
            抗水 = -157,
            抗雷 = -157,
            抗火 = -157,
            抗风 = -157,

            忽视抗封 = 53,
            忽视抗睡 = 53,
            忽视抗混 = 53,
            加强昏睡 = 53,
            加强混乱 = 53,
            加强封印 = 53,
            加强毒 = 150,
            忽视抗毒 = 150,
            加强毒伤害结果 = 10000,
        },
        技能 = {
            { 名称 = "百日眠", 熟练度 = 25000 },
            { 名称 = "迷魂醉", 熟练度 = 25000 },
            { 名称 = "四面楚歌", 熟练度 = 25000 },
            { 名称 = "作壁上观", 熟练度 = 25000 },
            { 名称 = "万毒攻心", 熟练度 = 25000 },
            { 名称 = "断肠烈散", 熟练度 = 25000 },
        },











    },
    { 名称 = "忘川魂", 外形 = 2070, 染色 = 0x05050505, 等级 = 180, 气血 = 72000000, 魔法 = 80000,
        攻击 = 6845, 速度 = -800, 施法几率 = 100,
        抗性 = {
            物理吸收 = 25,
            抗震慑 = 25,
            抗混乱 = 130,
            抗封印 = 125,
            抗昏睡 = 135,
            抗水 = -89,
            抗雷 = -89,
            抗火 = -89,
            抗风 = -89,

            忽视抗封 = 10,
            忽视抗睡 = 10,
            忽视抗混 = 10,
            加强昏睡 = 20,
            加强混乱 = 20,
            加强封印 = 20,
            加强毒 = 50,
            忽视抗毒 = 30,
            加强毒伤害结果 = 10500,

        },
        技能 = {

            { 名称 = "万毒攻心", 熟练度 = 25000 },
            { 名称 = "断肠烈散", 熟练度 = 25000 },
        },

    },
    { 名称 = "忘川魂", 外形 = 2070, 染色 = 0x05050505, 等级 = 140, 气血 = 72000000, 魔法 = 80000,
        攻击 = 6845, 速度 = 1700, 施法几率 = 100,
        抗性 = {
            物理吸收 = 30,
            抗震慑 = 25,
            抗混乱 = 135,
            抗封印 = 125,
            抗昏睡 = 130,
            抗风 = 50,
            抗水 = -127,
            抗雷 = -127,
            抗火 = -127,
            反震几率 = 40,
            反震程度 = 51,
            加强雷 = 50,
            忽视抗雷 = 30,
            雷系狂暴几率 = 30,
            加强水 = 50,
            忽视抗水 = 30,
            水系狂暴几率 = 30,
            加强火 = 50,
            忽视抗火 = 30,
            火系狂暴几率 = 30,
        },
        技能 = {
            { 名称 = "袖里乾坤", 熟练度 = 20000 },
            { 名称 = "风雷涌动", 熟练度 = 20000 },
            { 名称 = "蛟龙出海", 熟练度 = 20000 },
            { 名称 = "九龙冰封", 熟练度 = 20000 },
            { 名称 = "电闪雷鸣", 熟练度 = 20000 },
            { 名称 = "天诛地灭", 熟练度 = 20000 },
        },











    },

}
--=========================战斗======================================
function 任务:战斗初始化(玩家, NPC)
    for i = 1, 6 do
        local r = 生成战斗怪物(_怪物[i])
        self:加入敌方(i, r)
    end
end

function 任务:战斗回合开始(dt)


end

function 任务:战斗结束(s)
    if s then
        local zg = self:取对象(1)
        if zg then
            for _, v in self:遍历我方() do
                if v.是否玩家 then
                    local r = v.对象.接口:取任务("忘川水")
                    if r then
                        r:完成(v.对象.接口)
                    end
                end
            end
        end
    end
end

return 任务
