
local 战斗 = {
    是否惩罚 = false --死亡
}


function 战斗:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 2108,
        名称 = "天牢天神",
        等级 = 等级,
        气血 = 500000+等级*1000+转生*20000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 10000+等级*10+转生*100,
        速度 = 500+等级*1+转生*100,
        抗性 = {
            物理吸收 = 5,
            抗震慑 = 5,
            抗混乱 = 90,
            抗封印 = 90,
            抗昏睡 = 90,
            加强混乱 = 15,
            忽视抗混 = 5,
             抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 20000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2110,
        名称 = "地牢地神",
        等级 = 等级,
        气血 = 500000+等级*1000+转生*20000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 10000+等级*10+转生*100,
        速度 = 500+等级*1+转生*100,
        抗性 = {
            物理吸收 = 5,
            抗震慑 = 5,
            抗混乱 = 90,
            抗封印 = 90,
            抗昏睡 = 90,
            加强毒 = 5,
            加强毒伤害 = 500,
            忽视抗毒 = 10,
             抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "万毒攻心", 熟练度 = 20000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }

    self:加入敌方(2, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2051,
        名称 = "地灵",
        等级 = 等级,
        气血 = 500000+等级*1000+转生*20000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 10000+等级*10+转生*100,
        速度 = 500+等级*1+转生*100,
        抗性 = {
            物理吸收 = 5,
            抗震慑 = 5,
            抗混乱 = 90,
            抗封印 = 90,
            抗昏睡 = 90,
            加强雷 = 15,
            
            忽视抗雷 = 10,
             抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "天诛地灭", 熟练度 = 20000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))
    self:加入敌方(5, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2289,
        名称 = "天灵",
        等级 = 等级,
        气血 = 500000+等级*1000+转生*20000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 10000+等级*10+转生*100,
        速度 = 500+等级*1+转生*100,
        抗性 = {
            物理吸收 = 5,
            抗震慑 = 5,
            抗混乱 = 90,
            抗封印 = 90,
            抗昏睡 = 90,
            加强水 = 15,
            
            忽视抗水= 10,
             抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "九龙冰封", 熟练度 = 20000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }

    self:加入敌方(4, 生成战斗怪物(怪物属性))
    self:加入敌方(6, 生成战斗怪物(怪物属性))





end

function 战斗:进场喊话()
    local dd = self:取对象(101)
    if dd then
        dd:当前喊话("同名小怪需要一起杀死。")
    end
     dd = self:取对象(12)
    if dd then
        dd:当前喊话("20回合会狂暴")
    end
end

function 战斗:战斗回合开始(v)

--对象12 前20回合不出手 20以后仙法秒
--同名怪要同一回合死 不是的话相互拉满血
-- 1 2位不是  小怪死完 主怪逃跑 结束


end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

function 战斗:战斗结束(v)

end

return 战斗
