
local 战斗 = {
    是否惩罚 = false --死亡
}


function 战斗:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 2129,
        名称 = "大辩才天",
        等级 = 等级,
        气血 = 800000+等级*1000+转生*20000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 10000+等级*10+转生*100,
        速度 = 550+等级*2+转生*100,
        抗性 = {
            物理吸收 = 5,
            抗震慑 = 5,
            抗混乱 = 100,
            抗封印 = 100,
            抗昏睡 = 100,
            加强毒 = 15,
            加强毒伤害 = 1500,
            忽视抗毒 = 15,
             抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "万毒攻心", 熟练度 = 20000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }

    self:加入敌方(1, 生成战斗怪物(怪物属性))


    怪物属性 = {
        外形 = 48,
        名称 = "蓝衣童子",
        等级 = 等级,
        气血 = 10 + 等级 * 1 + 转生 * 1,
        魔法 = 10000 + 等级 * 1 + 转生 * 1,
        攻击 = 1 + 等级 * 1 + 转生 * 1,
        速度 = 1 + 等级 * 1 + 转生 * 1,
        抗性 = {
            物理吸收 = 5000,
            抗震慑 = 0,
            抗混乱 = 100,
            抗封印 = 100,
            抗昏睡 = 100,
            抗水 = 530, 抗雷 = 530, 抗火 = 530, 抗风 = 530,
        },
        技能 = {
        },
        施法几率 = 0,
        是否消失 = false,
    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))
    self:加入敌方(4, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 49,
        名称 = "红衣童子",
        等级 = 等级,
        气血 = 10 + 等级 * 1 + 转生 * 1,
        魔法 = 10000 + 等级 * 1 + 转生 * 1,
        攻击 = 1 + 等级 * 1 + 转生 * 1,
        速度 = 1 + 等级 * 1 + 转生 * 1,
        抗性 = {
            物理吸收 = 5000,
            抗震慑 = 0,
            抗混乱 = 100,
            抗封印 = 100,
            抗昏睡 = 100,
            抗水 = 530, 抗雷 = 530, 抗火 = 530, 抗风 = 530,
        },
        技能 = {
        },
        施法几率 = 0,
        是否消失 = false,
    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))
    self:加入敌方(5, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 2283,
        名称 = "罗汉",
        等级 = 等级,
        气血 = 700000+等级*1000+转生*20000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 10000+等级*10+转生*100,
        速度 = 550+等级*2+转生*100,
        抗性 = {
            物理吸收 = 5,
            抗震慑 = 5,
            抗混乱 = 100,
            抗封印 = 100,
            抗昏睡 = 100,
            加强雷 = 25,
            加强毒伤害 = 1500,
            忽视抗雷 = 25,
             抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "天诛地灭", 熟练度 = 20000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(6, 生成战斗怪物(怪物属性))
    self:加入敌方(8, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2098,
        名称 = "金刚",
        等级 = 等级,
        气血 = 700000+等级*1000+转生*20000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 10000+等级*10+转生*100,
        速度 = 550+等级*2+转生*100,
        抗性 = {
            物理吸收 = 5,
            抗震慑 = 5,
            抗混乱 = 100,
            抗封印 = 100,
            抗昏睡 = 100,
            加强混乱 = 15,
            加强毒伤害 = 1500,
            忽视抗混 = 10,
             抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "失心狂乱", 熟练度 = 20000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(7, 生成战斗怪物(怪物属性))
    self:加入敌方(9, 生成战斗怪物(怪物属性))
end

function 战斗:进场喊话()
    -- local dd = self:取对象(101)
    -- if dd then
    --     dd:当前喊话("同名小怪需要一起杀死。")
    -- end

end

function 战斗:战斗回合开始(v)

    --第一回主怪敏最快  出手100%遗忘10个目标 特殊遗忘 不能使用道具 150回合
    --红衣 物理攻击他自己回血 百分比70   蓝衣  物理攻击他自己回蓝 百分比70



end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

function 战斗:战斗结束(v)

end

return 战斗
