
local 战斗 = {
    是否惩罚 = false --死亡
}


function 战斗:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 2274,
        名称 = "胭脂大将",
        等级 = 等级,
        气血 = 100000+等级*1000+转生*20000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 10000+等级*10+转生*100,
        速度 = 100+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
            抗震慑 = 5,
            抗混乱 = 70,
            抗封印 = 70,
            抗昏睡 = 70,
            连击率 = 70,
            连击次数 = 5,
            加强混乱 = 5,
            忽视抗混 = 5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 15000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 40,
        名称 = "以彼制彼",
        等级 = 等级,
        气血 = 100000+等级*1000+转生*20000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 10000+等级*10+转生*100,
        速度 = 100+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
            抗震慑 = 5,
            抗混乱 = 70,
            抗封印 = 70,
            抗昏睡 = 70,
            加强混乱 = 5,
            忽视抗混 = 5,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 15000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }

    self:加入敌方(2, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 43,
        名称 = "以彼制彼",
        等级 = 等级,
        气血 = 100000+等级*1000+转生*20000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 10000+等级*10+转生*100,
        速度 = 100+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
            抗震慑 = 5,
            抗混乱 = 70,
            抗封印 = 70,
            抗昏睡 = 70,
            加强火 = 20,
            忽视抗火 = 10,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "九阴纯火", 熟练度 = 15000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }

    self:加入敌方(3, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 17,
        名称 = "以彼制彼",
        等级 = 等级,
        气血 = 100000+等级*1000+转生*20000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 10000+等级*10+转生*100,
        速度 = 100+等级*1+转生*50,
        抗性 = {
            物理吸收 = 5,
            抗震慑 = 5,
            抗混乱 = 70,
            抗封印 = 70,
            抗昏睡 = 70,
            抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "阎罗追命", 熟练度 = 15000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }

    self:加入敌方(5, 生成战斗怪物(怪物属性))


end

function 战斗:进场喊话()
    -- local dd = self:取对象(101)
    -- if dd then
    --     dd:当前喊话("阎魔罗王,作地狱主,兄治男事,妹理女事")
    -- end
end

function 战斗:战斗回合开始(v)
    --魔方我放出手 除了法术 其它置物理攻击指令
    --对应我方种族出手顺序-1
    --多次出手



end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

function 战斗:战斗结束(v)

end

return 战斗
