
local 战斗 = {
    是否惩罚 = false --死亡
}

local _技能组 = {
    {
        { 名称 = "百日眠", 熟练度 = 20000 },
        { 名称 = "失心狂乱", 熟练度 = 20000 },
    },

    {
        { 名称 = "九阴纯火", 熟练度 = 20000 },
        { 名称 = "天诛地灭", 熟练度 = 20000 },
    },

    {
        { 名称 = "袖里乾坤", 熟练度 = 20000 },
        { 名称 = "阎罗追命", 熟练度 = 20000 },
    },
    {
        { 名称 = "含情脉脉", 熟练度 = 20000 },
        { 名称 = "乾坤借速", 熟练度 = 20000 },
    },
    {
        { 名称 = "万毒攻心", 熟练度 = 20000 },
        { 名称 = "魔神附身", 熟练度 = 20000 },
    },
}
function 战斗:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 2128,
        名称 = "魔利支天善相",
        等级 = 等级,
        气血 = 600000+等级*1000+转生*20000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 10000+等级*10+转生*100,
        速度 = 550+等级*2+转生*100,
        抗性 = {
            物理吸收 = 5,
            抗震慑 = 5,
            抗混乱 = 100,
            抗封印 = 100,
            抗昏睡 = 100,
            加强混乱 = 15,
            忽视抗混 = 5,
            加强昏睡 = 15,
            忽视抗睡 = 5,
            加强风 = 15,
            忽视抗风 = 15,
            加强雷 = 15,
            忽视抗雷 = 15,
            加强火 = 15,
            忽视抗火 = 15,
            加强毒 = 5,
            加强毒伤害 = 500,
            忽视抗毒 = 10,
             抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {
        },
        施法几率 = 100,
        是否消失 = false,
    }
    for i = 1, 5, 1 do
        怪物属性.技能 = {}
        怪物属性.技能 = _技能组[i]
        self:加入敌方(i, 生成战斗怪物(怪物属性))
    end

    怪物属性 = {
        外形 = 2072,
        名称 = "魔利支天恶相",
        等级 = 等级,
        气血 = 600000+等级*1000+转生*20000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 10000+等级*10+转生*100,
        速度 = 550+等级*2+转生*100,
        抗性 = {
            物理吸收 = 5,
            抗震慑 = 5,
            抗混乱 = 100,
            抗封印 = 100,
            抗昏睡 = 100,
            
            加强火 = 15,
            忽视抗火 = 15,
             抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "九阴纯火", 熟练度 = 20000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }

    self:加入敌方(6, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2002,
        名称 = "魔利支天恶相",
        等级 = 等级,
        染色 = 0x02020202,
        气血 = 600000+等级*1000+转生*20000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 10000+等级*10+转生*100,
        速度 = 550+等级*2+转生*100,
        抗性 = {
            物理吸收 = 5,
            抗震慑 = 5,
            抗混乱 = 100,
            抗封印 = 100,
            抗昏睡 = 100,
            
            加强雷 = 15,
            忽视抗雷 = 15,
             抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "天诛地灭", 熟练度 = 20000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(7, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2110,
        名称 = "魔利支天恶相",
        等级 = 等级,
        气血 = 600000+等级*1000+转生*20000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 10000+等级*10+转生*100,
        速度 = 550+等级*2+转生*100,
        抗性 = {
            物理吸收 = 5,
            抗震慑 = 5,
            抗混乱 = 100,
            抗封印 = 100,
            抗昏睡 = 100,
            加强毒 = 5,
            加强毒伤害 = 500,
            忽视抗毒 = 10,
             抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "万毒攻心", 熟练度 = 20000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(8, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2110,
        名称 = "魔利支天恶相",
        等级 = 等级,
        气血 = 600000+等级*1000+转生*20000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 10000+等级*10+转生*100,
        速度 = 550+等级*2+转生*100,
        抗性 = {
            物理吸收 = 5,
            抗震慑 = 5,
            抗混乱 = 100,
            抗封印 = 100,
            抗昏睡 = 100,
            加强毒 = 5,
            加强毒伤害 = 500,
            忽视抗毒 = 10,
             抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "阎罗追命", 熟练度 = 20000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }

    self:加入敌方(9, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2176,
        名称 = "魔利支天恶相",
        等级 = 等级,
        气血 = 600000+等级*1000+转生*20000,
        魔法 = 20000+等级*200+转生*10000,
        攻击 = 10000+等级*10+转生*100,
        速度 = 550+等级*2+转生*100,
        抗性 = {
            物理吸收 = 5,
            抗震慑 = 5,
            抗混乱 = 100,
            抗封印 = 100,
            抗昏睡 = 100,
            加强混乱 = 15,
            加强毒伤害 = 500,
            忽视抗混 = 10,
             抗水 = -30, 抗雷 = -30, 抗火 = -30, 抗风 = -30,
        },
        技能 = {{ 名称 = "失心狂乱", 熟练度 = 20000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(10, 生成战斗怪物(怪物属性))





end

function 战斗:进场喊话()
    -- local dd = self:取对象(101)
    -- if dd then
    --     dd:当前喊话("同名小怪需要一起杀死。")
    -- end

end

function 战斗:战斗回合开始(v)

    --前面5个怪进场隐身一直隐身
    --对应天龙女死了 对应召唤位破隐



end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

function 战斗:战斗结束(v)

end

return 战斗
