local list = {
    -------------------------------------------------四圣庄-------------------------------------------------
    { mid = 101295, 分类 = '普通', 外形 = 3050, 方向 = 0, 名称 = '大小姐', x = 26, y = 196, 脚本 = 'scripts/npc/大唐边境/四圣庄/大小姐.lua' },
    { mid = 101295, 分类 = '普通', 外形 = 3166, 方向 = 0, 名称 = '刘伯钦', x = 194, y = 104, 脚本 = 'scripts/npc/大唐边境/四圣庄/刘伯钦.lua' },
    { mid = 101295, 分类 = '普通', 外形 = 3024, 方向 = 0, 名称 = '渡河船夫', x = 218, y = 34, 脚本 = 'scripts/npc/大唐边境/四圣庄/渡河船夫.lua' },
    { mid = 101295, 分类 = '普通', 外形 = 2045, 方向 = 0, 名称 = '山贼', x = 44, y = 13, 脚本 = 'scripts/npc/大唐边境/四圣庄/山贼.lua' },
    { mid = 101295, 分类 = '普通', 外形 = 2004, 方向 = 0, 名称 = '精灵小妖', x = 185, y = 198, 脚本 = 'scripts/npc/大唐边境/四圣庄/精灵小妖.lua' },
    { mid = 101295, 分类 = '普通', 外形 = 3088, 方向 = 0, 名称 = '罗小蚨', x = 65, y = 74, 脚本 = 'scripts/npc/大唐边境/四圣庄/罗小蚨.lua' },
    -------------------------------------------------大客厅-------------------------------------------------
    { mid = 101296, 分类 = '普通', 外形 = 3069, 方向 = 0, 名称 = '老夫人', x = 26, y = 12, 脚本 = 'scripts/npc/大唐边境/四圣庄/老夫人.lua' },
    -------------------------------------------------书房-------------------------------------------------
    { mid = 101297, 分类 = '普通', 外形 = 3050, 方向 = 0, 名称 = '三小姐', x = 17, y = 15, 脚本 = 'scripts/npc/大唐边境/四圣庄/三小姐.lua' },
    -------------------------------------------------厢房-------------------------------------------------
    { mid = 101298, 分类 = '普通', 外形 = 3050, 方向 = 1, 名称 = '二小姐', x = 23, y = 18, 脚本 = 'scripts/npc/大唐边境/四圣庄/厢房/二小姐.lua' },
    -------------------------------------------------白骨山-------------------------------------------------
    { mid = 101300, 分类 = '普通', 外形 = 3070, 方向 = 1, 名称 = '白骨山土地', x = 92, y = 89, 脚本 = 'scripts/npc/大唐边境/白骨山/白骨山土地.lua' },
    { mid = 101300, 分类 = '普通', 外形 = 0043, 方向 = 1, 名称 = '罗刹女', x = 19, y = 13, 脚本 = 'scripts/npc/大唐边境/白骨山/罗刹女.lua' },
    { mid = 101300, 分类 = '普通', 外形 = 3071, 方向 = 1, 名称 = '女子', x = 212, y = 76, 脚本 = 'scripts/npc/大唐边境/白骨山/女子.lua' },
    { mid = 101300, 分类 = '传送', 外形 = 2025, 方向 = 1, 名称 = '引路小妖', 称谓 = '我是传送人', x = 13, y = 143, 脚本 = 'scripts/npc/大唐边境/白骨山/引路小妖.lua' },
    { mid = 101300, 分类 = '普通', 外形 = 3030, 方向 = 1, 名称 = '老头', x = 145, y = 57, 脚本 = 'scripts/npc/大唐边境/白骨山/老头.lua' },
    { mid = 101300, 分类 = '普通', 外形 = 3069, 方向 = 1, 名称 = '老妇人', x = 74, y = 59, 脚本 = 'scripts/npc/大唐边境/白骨山/老妇人.lua' },
    -------------------------------------------------白骨洞-------------------------------------------------
    { mid = 101301, 分类 = '任务', 外形 = 0069, 方向 = 0, 名称 = '白骨洞掌门', x = 8, y = 9, 脚本 = 'scripts/npc/掌门/白骨洞掌门.lua' },
    { mid = 101301, 分类 = '普通', 外形 = 2080, 方向 = 1, 名称 = '白骨精', x = 20, y = 12, 脚本 = 'scripts/npc/师门传送.lua' },
    -------------------------------------------------灵兽村-------------------------------------------------
    { mid = 101349, 分类 = '传送', 外形 = 2040, 方向 = 4, 名称 = '冰熊守卫', x = 14, y = 11, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/冰熊守卫.lua' },
    { mid = 101349, 分类 = '普通', 外形 = 3062, 方向 = 2, 名称 = '灵兽村守护神', x = 135, y = 65, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/灵兽村守护神.lua' },
    { mid = 101349, 分类 = '传送', 外形 = 2051, 方向 = 3, 名称 = '古道亡灵', x = 251, y = 31, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/古道亡灵.lua' },
    { mid = 101349, 分类 = '普通', 外形 = 3043, 方向 = 2, 名称 = '育兽仙', x = 128, y = 68, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/育兽仙.lua' },
    { mid = 101349, 分类 = '普通', 外形 = 2023, 方向 = 0, 名称 = '灵兽村使者', x = 110, y = 93, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/灵兽村使者.lua' },
    { mid = 101349, 分类 = '普通', 外形 = 3001, 方向 = 3, 名称 = '超级巫医', x = 129, y = 84, 脚本 = 'scripts/npc/超级巫医.lua' },
    -------------------------------------------------村民房-------------------------------------------------
    { mid = 101359, 分类 = '普通', 外形 = 2003, 方向 = 0, 名称 = '高飞', x = 11, y = 8, 脚本 = 'scripts/npc/默认.lua' },
    -------------------------------------------------冰屋-------------------------------------------------
    { mid = 101368, 分类 = '普通', 外形 = 2038, 方向 = 0, 名称 = '小白虎', x = 24, y = 12, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/小白虎.lua' },
    { mid = 101368, 分类 = '普通', 外形 = 2288, 方向 = 0, 名称 = '嬷嬷', x = 10, y = 8, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/嬷嬷.lua' },
    -------------------------------------------------村长屋-------------------------------------------------
    { mid = 101369, 分类 = '普通', 外形 = 7170, 方向 = 1, 名称 = '麒麟村长', x = 24, y = 9, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/麒麟村长.lua' },
    -------------------------------------------------白虎居二楼-------------------------------------------------
    { mid = 101371, 分类 = '普通', 外形 = 2038, 方向 = 0, 名称 = '白虎长老', x = 19, y = 8, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/白虎长老.lua' },
    -------------------------------------------------玄武居-------------------------------------------------
    { mid = 101372, 分类 = '普通', 外形 = 0027, 方向 = 1, 名称 = '大虎', x = 20, y = 19, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/玄武居/大虎.lua' },
    { mid = 101372, 分类 = '普通', 外形 = 2036, 方向 = 1, 名称 = '玄武长老', x = 26, y = 16, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/玄武居/玄武长老.lua' },
    { mid = 101372, 分类 = '普通', 外形 = 0027, 方向 = 1, 名称 = '三虎', x = 24, y = 12, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/玄武居/三虎.lua' },
    { mid = 101372, 分类 = '普通', 外形 = 0027, 方向 = 1, 名称 = '四虎', x = 31, y = 12, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/玄武居/四虎.lua' },
    { mid = 101372, 分类 = '普通', 外形 = 0027, 方向 = 1, 名称 = '二虎', x = 19, y = 15, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/玄武居/二虎.lua' },
    { mid = 101372, 分类 = '普通', 外形 = 0027, 方向 = 1, 名称 = '五虎', x = 38, y = 13, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/玄武居/五虎.lua' },
    -------------------------------------------------青龙居-------------------------------------------------
    { mid = 101374, 分类 = '普通', 外形 = 2070, 方向 = 0, 名称 = '青龙长老', x = 21, y = 9, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/青龙长老.lua' },
    -------------------------------------------------朱雀居-------------------------------------------------
    { mid = 101376, 分类 = '普通', 外形 = 3051, 方向 = 1, 名称 = '灵兽长者', x = 31, y = 13, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/灵兽长者.lua' },
    -------------------------------------------------朱雀居二楼-------------------------------------------------
    { mid = 101377, 分类 = '普通', 外形 = 2071, 方向 = 1, 名称 = '朱雀长老', x = 13, y = 10, 脚本 = 'scripts/npc/北俱芦洲/灵兽村/灵兽朱雀.lua' },
    -------------------------------------------------修罗古城-------------------------------------------------
    { mid = 101381, 分类 = '普通', 外形 = 2004, 方向 = 1, 名称 = '幻境使者', x = 42, y = 226, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/幻境使者.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 2127, 方向 = 1, 名称 = '骨冢使者', x = 48, y = 234, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/骨冢使者.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 3118, 方向 = 1, 名称 = '余老头', x = 174, y = 248, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/余老头.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 2109, 方向 = 1, 名称 = '密藏守卫', x = 39, y = 233, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/密藏守卫.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 2081, 方向 = 1, 名称 = '试炼使者', x = 53, y = 227, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/试炼使者.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 3032, 方向 = 1, 名称 = '川悦', 称谓 = '跨服切磋传送人', x = 307, y = 159, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/川悦.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 2128, 方向 = 1, 名称 = '镜海使者', 称谓 = '混沌之冢传送人', x = 89, y = 18, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/镜海使者.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 3016, 方向 = 1, 名称 = '唐么师', x = 108, y = 57, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/唐么师.lua' },
    { mid = 101381, 分类 = '任务', 外形 = 2044, 方向 = 1, 名称 = '栅栏守卫', x = 26, y = 35, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/栅栏守卫上.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 3085, 方向 = 1, 名称 = '上官游', 称谓 = '有功必赏', x = 218, y = 46, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/上官游.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 3119, 方向 = 1, 名称 = '崔二饼', x = 179, y = 111, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/崔二饼.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 3117, 方向 = 1, 名称 = '胡铁嘴', x = 194, y = 152, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/胡铁嘴.lua' },
    { mid = 101381, 分类 = '任务', 外形 = 2044, 方向 = 1, 名称 = '城门守卫(内)', x = 84, y = 132, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/城门守卫内.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 3032, 方向 = 1, 名称 = '擂台使者', x = 341, y = 209, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/擂台使者.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 3032, 方向 = 1, 名称 = '擂台使者', x = 282, y = 208, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/擂台使者.lua' },
    { mid = 101381, 分类 = '任务', 外形 = 2044, 方向 = 3, 名称 = '城门守卫(外)', x = 89, y = 121, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/城门守卫外.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 3032, 方向 = 1, 名称 = '擂台使者', x = 318, y = 218, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/擂台使者.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 3063, 方向 = 1, 名称 = '天庭天将', 称谓 = '秘境寻踪传送人', x = 229, y = 42, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/天庭天将.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 3032, 方向 = 1, 名称 = '擂台使者', x = 342, y = 229, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/擂台使者.lua' },
    { mid = 101381, 分类 = '传送', 外形 = 3080, 方向 = 1, 名称 = '张归', 称谓 = '长安传送人', x = 282, y = 171, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/张归.lua' },
    { mid = 101381, 分类 = '任务', 外形 = 2044, 方向 = 1, 名称 = '栅栏守卫(内)', x = 107, y = 80, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/栅栏守卫内.lua' },
    { mid = 101381, 分类 = '任务', 外形 = 2044, 方向 = 3, 名称 = '栅栏守卫', x = 38, y = 30, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/栅栏守卫上.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 3032, 方向 = 1, 名称 = '擂台使者', x = 275, y = 156, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/擂台使者.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 3032, 方向 = 1, 名称 = '擂台使者', x = 339, y = 150, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/擂台使者.lua' },
    { mid = 101381, 分类 = '任务', 外形 = 2044, 方向 = 2, 名称 = '栅栏守卫(外)', x = 114, y = 78, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/栅栏守卫外.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 3032, 方向 = 1, 名称 = '擂台使者', x = 346, y = 179, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/擂台使者.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 3032, 方向 = 1, 名称 = '擂台使者', x = 283, y = 194, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/擂台使者.lua' },
    { mid = 101381, 分类 = '普通', 外形 = 3080, 方向 = 1, 名称 = '李武', 称谓 = '修罗古城切磋公证人', x = 309, y = 174, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/李武.lua' },
    { mid = 101381, 分类 = '商业', 外形 = 3086, 方向 = 1, 名称 = '当铺老板', x = 283, y = 177, 脚本 = 'scripts/npc/北俱芦洲/修罗古城/当铺老板.lua' },
    -------------------------------------------------未知-------------------------------------------------
    { mid = 101382, 分类 = '普通', 外形 = 2176, 方向 = 1, 名称 = '冥界妖王', x = 69, y = 39, 脚本 = 'scripts/npc/北俱芦洲/修罗古殿/冥界妖王.lua' },
    -------------------------------------------------阴都殿-------------------------------------------------
    { mid = 101394, 分类 = '任务', 外形 = 0066, 方向 = 3, 名称 = '阴都掌门', x = 30, y = 10, 脚本 = 'scripts/npc/掌门/阴都掌门.lua' },
    { mid = 101394, 分类 = '普通', 外形 = 2177, 方向 = 2, 名称 = '王方平', x = 37, y = 18, 脚本 = 'scripts/npc/师门传送.lua' },
    -------------------------------------------------兰若寺-------------------------------------------------
    { mid = 101395, 分类 = '任务', 外形 = 0070, 方向 = 0, 名称 = '兰若寺掌门', x = 166, y = 97, 脚本 = 'scripts/npc/掌门/兰若寺掌门.lua' },
    { mid = 101395, 分类 = '普通', 外形 = 2179, 方向 = 2, 名称 = '聂小倩', x = 175, y = 95, 脚本 = 'scripts/npc/师门传送.lua' },
    -------------------------------------------------魔王中殿-------------------------------------------------
    { mid = 101441, 分类 = '普通', 外形 = 3018, 方向 = 0, 名称 = '杜', x = 217, y = 32, 脚本 = 'scripts/npc/大唐边境/魔王中殿/杜.lua' },
    { mid = 101441, 分类 = '普通', 外形 = 3018, 方向 = 1, 名称 = '伤', x = 235, y = 73, 脚本 = 'scripts/npc/大唐边境/魔王中殿/伤.lua' },
    { mid = 101441, 分类 = '普通', 外形 = 3018, 方向 = 1, 名称 = '生', x = 214, y = 113, 脚本 = 'scripts/npc/大唐边境/魔王中殿/生.lua' },
    { mid = 101441, 分类 = '普通', 外形 = 3018, 方向 = 1, 名称 = '休', x = 118, y = 133, 脚本 = 'scripts/npc/大唐边境/魔王中殿/休.lua' },
    { mid = 101441, 分类 = '普通', 外形 = 3018, 方向 = 1, 名称 = '死', x = 19, y = 29, 脚本 = 'scripts/npc/大唐边境/魔王中殿/死.lua' },
    { mid = 101441, 分类 = '普通', 外形 = 3018, 方向 = 0, 名称 = '景', x = 124, y = 14, 脚本 = 'scripts/npc/大唐边境/魔王中殿/景.lua' },
    { mid = 101441, 分类 = '普通', 外形 = 3001, 方向 = 1, 名称 = '超级巫医', x = 118, y = 73, 脚本 = 'scripts/npc/超级巫医.lua' },
    { mid = 101441, 分类 = '普通', 外形 = 3018, 方向 = 0, 名称 = '开', x = 28, y = 117, 脚本 = 'scripts/npc/大唐边境/魔王中殿/开.lua' },
    { mid = 101441, 分类 = '普通', 外形 = 3018, 方向 = 0, 名称 = '惊', x = 15, y = 70, 脚本 = 'scripts/npc/大唐边境/魔王中殿/惊.lua' },
    -------------------------------------------------广寒宫-------------------------------------------------
    { mid = 101474, 分类 = '普通', 外形 = 6520, 方向 = 0, 名称 = '嫦娥', x = 26, y = 52, 脚本 = 'scripts/npc/天宫/广寒宫/嫦娥.lua' },
    -------------------------------------------------大唐境内-------------------------------------------------
    { mid = 101477, 分类 = '普通', 外形 = 2018, 方向 = 1, 名称 = '食婴鬼', x = 216, y = 84, 脚本 = 'scripts/npc/大唐境内/食婴鬼.lua' },
    -------------------------------------------------死牢-------------------------------------------------
    { mid = 001175, 分类 = '普通', 外形 = 0038, 方向 = 1, 名称 = '死牢守卫', x = 111, y = 13, 脚本 = 'scripts/npc/大唐境内/死牢/衙役.lua' },
    -------------------------------------------------宝象国-------------------------------------------------
    { mid = 101529, 分类 = '任务', 外形 = 6552, 方向 = 0, 名称 = '降魔侍卫', x = 86, y = 89, 脚本 = 'scripts/npc/宝象国/降魔侍卫.lua' },
    { mid = 101529, 分类 = '任务', 外形 = 6552, 方向 = 1, 名称 = '宝象国皇宫侍卫', 称谓 = '右金吾卫', x = 42, y = 147, 脚本 = 'scripts/npc/宝象国/宝象国皇宫侍卫.lua' },
    { mid = 101529, 分类 = '普通', 外形 = 6552, 方向 = 1, 名称 = '宝象国皇宫侍卫', 称谓 = '右金吾卫', x = 27, y = 140, 脚本 = 'scripts/npc/宝象国/宝象国皇宫侍卫.lua' },
    { mid = 101529, 分类 = '普通', 外形 = 7170, 方向 = 1, 名称 = '尹洞天', 称谓 = '副本传送人', x = 51, y = 147, 脚本 = 'scripts/npc/宝象国/尹洞天.lua' },
    { mid = 101529, 分类 = '普通', 外形 = 3089, 方向 = 2, 名称 = '王银宝', 称谓 = '东山商行', x = 122, y = 117, 脚本 = 'scripts/npc/宝象国/王银宝.lua' },
    { mid = 101529, 分类 = '普通', 外形 = 6552, 方向 = 0, 名称 = '宝象国一品侍卫', x = 96, y = 96, 脚本 = 'scripts/npc/宝象国/一品侍卫.lua' },
    { mid = 101529, 分类 = '普通', 外形 = 6552, 方向 = 1, 名称 = '宝象国皇宫侍卫', 称谓 = '左金吾卫', x = 17, y = 147, 脚本 = 'scripts/npc/宝象国/宝象国皇宫侍卫.lua' },
    { mid = 101529, 分类 = '普通', 外形 = 3119, 方向 = 2, 名称 = '夏哈普', 称谓 = '药店老板', x = 143, y = 105, 脚本 = 'scripts/npc/宝象国/夏哈普.lua' },
    { mid = 101529, 分类 = '普通', 外形 = 2495, 方向 = 2, 名称 = '沙拉买提', 称谓 = '超级巫医', x = 97, y = 127, 脚本 = 'scripts/npc/超级巫医.lua' },
    { mid = 101529, 分类 = '传送', 外形 = 6566, 方向 = 2, 名称 = '库尔班', 称谓 = '驿站车夫', x = 77, y = 142, 脚本 = 'scripts/npc/宝象国/库尔班.lua' },
    { mid = 101529, 分类 = '传送', 外形 = 6566, 方向 = 1, 名称 = '艾莎', 称谓 = '驿站车夫', x = 213, y = 21, 脚本 = 'scripts/npc/宝象国/艾莎.lua' },
    { mid = 101529, 分类 = '普通', 外形 = 6552, 方向 = 0, 名称 = '宝象国皇宫侍卫', 称谓 = '右金吾卫', x = 32, y = 155, 脚本 = 'scripts/npc/宝象国/宝象国皇宫侍卫.lua' },
    { mid = 101529, 分类 = '传送', 外形 = 6566, 方向 = 2, 名称 = '买买提', 称谓 = '驿站车夫', x = 252, y = 149, 脚本 = 'scripts/npc/宝象国/买买提.lua' },
    { mid = 101529, 分类 = '商业', 外形 = 3089, 方向 = 2, 名称 = '亚克西', 称谓 = '杂货商', x = 217, y = 63, 脚本 = 'scripts/npc/宝象国/亚克西.lua' },
    { mid = 101529, 分类 = '商业', 外形 = 3119, 方向 = 1, 名称 = '伊利亚斯', 称谓 = '召唤兽技能商', x = 245, y = 69, 脚本 = 'scripts/npc/宝象国/伊利亚斯.lua' },
    { mid = 101529, 分类 = '普通', 外形 = 3119, 方向 = 2, 名称 = '艾买提', 称谓 = '镇远镖局', x = 210, y = 138, 脚本 = 'scripts/npc/宝象国/艾买提.lua' },
    { mid = 101529, 分类 = '商业', 外形 = 3117, 方向 = 1, 名称 = '符振海', x = 230, y = 61, 脚本 = 'scripts/npc/宝象国/符振海.lua' },
    { mid = 101529, 分类 = '普通', 外形 = 2177, 方向 = 1, 名称 = '天机', 称谓 = '观星而窥天机', x = 191, y = 23, 脚本 = 'scripts/npc/宝象国/天机.lua' },
    { mid = 101529, 分类 = '商业', 外形 = 3089, 方向 = 1, 名称 = '艾买就买提', 称谓 = '神秘商人', x = 218, y = 143, 脚本 = 'scripts/npc/宝象国/艾买就买提.lua' },
    { mid = 101529, 分类 = '商业', 外形 = 6538, 方向 = 1, 名称 = '阿拉木汗', 称谓 = '杂货商', x = 199, y = 173, 脚本 = 'scripts/npc/宝象国/阿拉木汗.lua' },
    { mid = 101529, 分类 = '商业', 外形 = 6536, 方向 = 1, 名称 = '热娜', 称谓 = '服装店老板', x = 314, y = 103, 脚本 = 'scripts/npc/宝象国/热娜.lua' },
    { mid = 101529, 分类 = '普通', 外形 = 3063, 方向 = 1, 名称 = '天将', 称谓 = '种族比武NPC', x = 262, y = 135, 脚本 = 'scripts/npc/宝象国/天将.lua' },
    { mid = 101529, 分类 = '普通', 外形 = 2443, 方向 = 1, 名称 = '伊卡', 称谓 = '召唤兽大师', x = 262, y = 73, 脚本 = 'scripts/npc/宝象国/伊卡.lua' },
    { mid = 101529, 分类 = '商业', 外形 = 3119, 方向 = 1, 名称 = '谢木谢尔', 称谓 = '武器店老板', x = 165, y = 151, 脚本 = 'scripts/npc/宝象国/谢木谢尔.lua' },
    { mid = 101529, 分类 = '商业', 外形 = 3076, 方向 = 1, 名称 = '卡日阿吉', 称谓 = '变身卡售卖商', x = 270, y = 80, 脚本 = 'scripts/npc/宝象国/卡日阿吉.lua' },
    { mid = 101532, 分类 = '普通', 外形 = 3085, 方向 = 1, 名称 = '光禄寺官员', x = 40, y = 28, 脚本 = 'scripts/npc/宝象国/宝象国光禄寺/光禄寺官员.lua' },
    { mid = 101533, 分类 = '商业', 外形 = 6538, 方向 = 1, 名称 = '汗古丽', 称谓 = '客栈老板', x = 14, y = 19, 脚本 = 'scripts/npc/宝象国/宝象国客栈/汗古丽.lua' },
    { mid = 101534, 分类 = '商业', 外形 = 3117, 方向 = 2, 名称 = '阿台奇阿洪', 称谓 = '钱庄老板', x = 27, y = 14, 脚本 = 'scripts/npc/宝象国/宝象国钱庄/阿台奇阿洪.lua' },
    { mid = 101535, 分类 = '商业', 外形 = 2495, 方向 = 1, 名称 = '阿迪力', 称谓 = '当铺老板', x = 33, y = 17, 脚本 = 'scripts/npc/宝象国/宝象国当铺/阿迪力.lua' },
    { mid = 101536, 分类 = '普通', 外形 = 3079, 方向 = 1, 名称 = '宝象国国王', x = 31, y = 54, 脚本 = 'scripts/npc/宝象国/宝象国王宫/宝象国国王.lua' },
    -------------------------------------------------平顶山-------------------------------------------------
    { mid = 101537, 分类 = '普通', 外形 = 3032, 方向 = 2, 名称 = '乌鸡国御林军', 称谓 = '全军最帅', x = 301, y = 156, 脚本 = 'scripts/npc/宝象国/平顶山/乌鸡国御林军.lua' },
    { mid = 101537, 分类 = '普通', 外形 = 2022, 方向 = 1, 名称 = '站岗小妖', 称谓 = '没池塘不幸福', x = 162, y = 38, 脚本 = 'scripts/npc/宝象国/平顶山/站岗小妖.lua' },
    { mid = 101537, 分类 = '传送', 外形 = 3079, 方向 = 2, 名称 = '楚祖澈', 称谓 = '车夫', x = 19, y = 100, 脚本 = 'scripts/npc/宝象国/平顶山/楚祖澈.lua' },
    { mid = 101537, 分类 = '普通', 外形 = 2048, 方向 = 2, 名称 = '乌鸡国守卫', 称谓 = '匹夫有责', x = 209, y = 119, 脚本 = 'scripts/npc/宝象国/平顶山/乌鸡国守卫.lua' },
    { mid = 101537, 分类 = '普通', 外形 = 6568, 方向 = 2, 名称 = '乌鸡国国王', x = 285, y = 167, 脚本 = 'scripts/npc/宝象国/平顶山/乌鸡国国王.lua' },
    { mid = 101537, 分类 = '普通', 外形 = 6569, 方向 = 2, 名称 = '乌鸡国太子', 称谓 = '龙战戈壁传送人', x = 219, y = 151, 脚本 = 'scripts/npc/宝象国/平顶山/乌鸡国太子.lua' },
    { mid = 101537, 分类 = '传送', 外形 = 3079, 方向 = 2, 名称 = '楚远门', 称谓 = '车夫', x = 251, y = 90, 脚本 = 'scripts/npc/宝象国/平顶山/楚远门.lua' },
    { mid = 101537, 分类 = '普通', 外形 = 6538, 方向 = 2, 名称 = '乌鸡国王后', x = 310, y = 171, 脚本 = 'scripts/npc/宝象国/平顶山/乌鸡国王后.lua' },
    { mid = 101537, 分类 = '普通', 外形 = 3032, 方向 = 3, 名称 = '乌鸡国御林军', 称谓 = '新手上岗', x = 273, y = 153, 脚本 = 'scripts/npc/宝象国/平顶山/乌鸡国御林军.lua' },
    { mid = 101537, 分类 = '普通', 外形 = 3032, 方向 = 2, 名称 = '乌鸡国御林军', 称谓 = '一丝不苟', x = 269, y = 173, 脚本 = 'scripts/npc/宝象国/平顶山/乌鸡国御林军.lua' },
    { mid = 101537, 分类 = '普通', 外形 = 3032, 方向 = 1, 名称 = '乌鸡国御林军', 称谓 = '得过且过', x = 265, y = 156, 脚本 = 'scripts/npc/宝象国/平顶山/乌鸡国御林军.lua' },
    -------------------------------------------------波月洞-------------------------------------------------
    { mid = 101539, 分类 = '普通', 外形 = 2127, 方向 = 1, 名称 = '黄袍怪', 称谓 = '波月洞王', x = 27, y = 76, 脚本 = 'scripts/npc/宝象国/平顶山/波月洞/黄袍怪.lua' },
    -------------------------------------------------莲花洞-------------------------------------------------
    { mid = 101540, 分类 = '普通', 外形 = 2496, 方向 = 1, 名称 = '金角大王', x = 19, y = 23, 脚本 = 'scripts/npc/宝象国/平顶山/莲花洞/金角大王.lua' },
    { mid = 101540, 分类 = '普通', 外形 = 2497, 方向 = 1, 名称 = '银角大王', x = 72, y = 53, 脚本 = 'scripts/npc/宝象国/平顶山/莲花洞/银角大王.lua' },
    -------------------------------------------------火云戈壁-------------------------------------------------
    { mid = 101538, 分类 = '普通', 外形 = 3002, 方向 = 1, 名称 = '陈澈', 称谓 = '陈家村村老', x = 255, y = 64, 脚本 = 'scripts/npc/宝象国/火云戈壁/小湖仙.lua' },
    { mid = 101538, 分类 = '普通', 外形 = 3045, 方向 = 1, 名称 = '陈关西', 称谓 = '私塾先生', x = 249, y = 98, 脚本 = 'scripts/npc/宝象国/火云戈壁/小湖仙.lua' },
    { mid = 101538, 分类 = '普通', 外形 = 3070, 方向 = 1, 名称 = '土地公', 称谓 = '孤竹城传送', x = 143, y = 133, 脚本 = 'scripts/npc/宝象国/火云戈壁/土地公.lua' },
    { mid = 101538, 分类 = '普通', 外形 = 3002, 方向 = 1, 名称 = '陈橙', 称谓 = '陈家村村长他哥', x = 260, y = 75, 脚本 = 'scripts/npc/宝象国/火云戈壁/小湖仙.lua' },
    { mid = 101538, 分类 = '传送', 外形 = 2025, 方向 = 1, 名称 = '小妖', x = 47, y = 72, 脚本 = 'scripts/npc/宝象国/火云戈壁/小妖.lua' },
    { mid = 101538, 分类 = '传送', 外形 = 2300, 方向 = 1, 名称 = '小湖仙', x = 157, y = 93, 脚本 = 'scripts/npc/宝象国/火云戈壁/小湖仙.lua' },
    { mid = 101538, 分类 = '传送', 外形 = 3079, 方向 = 2, 名称 = '楚曲晚', x = 188, y = 71, 脚本 = 'scripts/npc/宝象国/火云戈壁/楚曲晚.lua' },
    -------------------------------------------------火云洞-------------------------------------------------
    { mid = 101541, 分类 = '普通', 外形 = 6554, 方向 = 2, 名称 = '红孩儿手下', 称谓 = '火云洞', x = 73, y = 28, 脚本 = 'scripts/npc/宝象国/火云戈壁/火云洞/红孩儿手下.lua' },
    { mid = 101541, 分类 = '普通', 外形 = 2498, 方向 = 2, 名称 = '红孩儿', 称谓 = '圣婴大王', x = 71, y = 42, 脚本 = 'scripts/npc/宝象国/火云戈壁/火云洞/红孩儿.lua' },
    -------------------------------------------------金兜洞-------------------------------------------------
    { mid = 101542, 分类 = '普通', 外形 = 2499, 方向 = 2, 名称 = '独角兕', x = 70, y = 43, 脚本 = 'scripts/npc/宝象国/火云戈壁/金兜洞/独角兕.lua' },
    -------------------------------------------------女儿国-------------------------------------------------
    { mid = 101550, 分类 = '普通', 外形 = 6606, 方向 = 2, 名称 = '木甲修理人', x = 290, y = 26, 脚本 = 'scripts/npc/宝象国/女儿国/木甲修理人.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 6595, 方向 = 2, 名称 = '女儿国卫兵', x = 248, y = 25, 脚本 = 'scripts/npc/宝象国/女儿国/女儿国卫兵.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 6969, 方向 = 2, 名称 = '徘徊的女蝎妖', x = 66, y = 7, 脚本 = 'scripts/npc/宝象国/女儿国/徘徊的女蝎妖.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 6604, 方向 = 2, 名称 = '女神山居士', x = 108, y = 82, 脚本 = 'scripts/npc/宝象国/女儿国/女神山居士.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 6595, 方向 = 2, 名称 = '女儿国卫兵', x = 287, y = 134, 脚本 = 'scripts/npc/宝象国/女儿国/女儿国卫兵.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 6595, 方向 = 2, 名称 = '女儿国卫兵', x = 277, y = 139, 脚本 = 'scripts/npc/宝象国/女儿国/女儿国卫兵.lua' },
    { mid = 101550, 分类 = '传送', 外形 = 6595, 方向 = 2, 名称 = '女兵', x = 112, y = 98, 脚本 = 'scripts/npc/宝象国/女儿国/女兵.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 6538, 方向 = 2, 名称 = '迎阳驿使', x = 241, y = 22, 脚本 = 'scripts/npc/宝象国/女儿国/迎阳驿使.lua' },
    { mid = 101550, 分类 = '传送', 外形 = 6595, 方向 = 2, 名称 = '侍卫队长', x = 290, y = 129, 脚本 = 'scripts/npc/宝象国/女儿国/侍卫队长.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 6536, 方向 = 4, 名称 = '巧手匠人', x = 274, y = 8, 脚本 = 'scripts/npc/宝象国/女儿国/巧手匠人.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 6606, 方向 = 2, 名称 = '杂货商', x = 237, y = 35, 脚本 = 'scripts/npc/宝象国/女儿国/杂货商.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 3828, 方向 = 2, 名称 = '碧水精魄', x = 92, y = 66, 脚本 = 'scripts/npc/宝象国/女儿国/碧水精魄.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 3845, 方向 = 2, 名称 = '落胎泉', x = 45, y = 160, 脚本 = 'scripts/npc/宝象国/女儿国/落胎泉.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 3045, 方向 = 1, 名称 = '聚仙庵道士', x = 62, y = 136, 脚本 = 'scripts/npc/宝象国/女儿国/聚仙庵道士.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 3829, 方向 = 1, 名称 = '孤独的木甲人', x = 121, y = 155, 脚本 = 'scripts/npc/宝象国/女儿国/孤独的木甲人.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 6604, 方向 = 1, 名称 = '女官', x = 192, y = 152, 脚本 = 'scripts/npc/宝象国/女儿国/女官.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 6604, 方向 = 3, 名称 = '小姑娘', x = 200, y = 143, 脚本 = 'scripts/npc/宝象国/女儿国/小姑娘.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 6604, 方向 = 3, 名称 = '女官', x = 207, y = 144, 脚本 = 'scripts/npc/宝象国/女儿国/女官.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 6597, 方向 = 1, 名称 = '如意真仙', x = 38, y = 131, 脚本 = 'scripts/npc/宝象国/女儿国/如意真仙.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 6596, 方向 = 1, 名称 = '女力士', x = 232, y = 135, 脚本 = 'scripts/npc/宝象国/女儿国/女力士.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 6608, 方向 = 2, 名称 = '超级巫医', x = 76, y = 53, 脚本 = 'scripts/npc/超级巫医.lua' },
    { mid = 101550, 分类 = '普通', 外形 = 6603, 方向 = 1, 名称 = '舞女', x = 202, y = 150, 脚本 = 'scripts/npc/宝象国/女儿国/舞女.lua' },
    -------------------------------------------------女儿国国王寝宫-------------------------------------------------
    { mid = 101552, 分类 = '普通', 外形 = 6536, 方向 = 1, 名称 = '侍女', x = 64, y = 16, 脚本 = 'scripts/npc/宝象国/女儿国/车夫.lua' },
    -------------------------------------------------女儿国王宫-------------------------------------------------
    { mid = 101553, 分类 = '普通', 外形 = 3044, 方向 = 2, 名称 = '普提小仙', x = 65, y = 22, 脚本 = 'scripts/npc/宝象国/女儿国王宫/女儿国卫兵.lua' },
    { mid = 101553, 分类 = '普通', 外形 = 6593, 方向 = 2, 名称 = '女儿国国王', x = 77, y = 45, 脚本 = 'scripts/npc/宝象国/女儿国王宫/女儿国卫兵.lua' },
    { mid = 101553, 分类 = '普通', 外形 = 6594, 方向 = 2, 名称 = '女儿国太师', x = 51, y = 32, 脚本 = 'scripts/npc/宝象国/女儿国王宫/女儿国卫兵.lua' },
    { mid = 101555, 分类 = '普通', 外形 = 6969, 方向 = 1, 名称 = '看门小妖', x = 16, y = 10, 脚本 = 'scripts/npc/宝象国/女儿国/车夫.lua' },
    { mid = 101555, 分类 = '普通', 外形 = 6598, 方向 = 2, 名称 = '琵琶精', x = 45, y = 39, 脚本 = 'scripts/npc/宝象国/女儿国/车夫.lua' },
    -------------------------------------------------长安-------------------------------------------------
    { mid = 001001, 分类 = '商业', 外形 = 3084, 方向 = 2, 名称 = '石破烂', x = 176, y = 67, 脚本 = 'scripts/npc/长安/石破烂.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3008, 方向 = 2, 名称 = '教书先生', x = 156, y = 147, 脚本 = 'scripts/npc/长安/教书先生.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3018, 方向 = 1, 名称 = '陈懿', x = 281, y = 58, 脚本 = 'scripts/npc/长安/陈懿.lua' },
    { mid = 001001, 分类 = '任务', 外形 = 3031, 方向 = 3, 名称 = '云游大师', x = 105, y = 177, 脚本 = 'scripts/npc/长安/云游大师.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3011, 方向 = 2, 名称 = '帮派总管', x = 219, y = 77, 脚本 = 'scripts/npc/长安/帮派总管.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3076, 方向 = 2, 名称 = '帮派成就记录员', x = 215, y = 68, 脚本 = 'scripts/npc/长安/帮派成就记录员.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3011, 方向 = 1, 名称 = '帮派传送人', x = 208, y = 75, 脚本 = 'scripts/npc/长安/帮派传送人.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3043, 方向 = 1, 名称 = '宠物驯养师', x = 214, y = 78, 脚本 = 'scripts/npc/帮派/宠物驯养师.lua' },
    { mid = 001001, 分类 = '商业', 外形 = 3075, 方向 = 0, 名称 = '矿石出售商人', x = 149, y = 71, 脚本 = 'scripts/npc/长安/矿石出售商人.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3038, 方向 = 2, 名称 = '二品侍卫', x = 340, y = 254, 脚本 = 'scripts/npc/长安/二品侍卫.lua' },
    { mid = 001001, 分类 = '任务', 外形 = 3035, 方向 = 2, 名称 = '科举报名官员', x = 355, y = 246, 脚本 = 'scripts/npc/长安/科举报名官员.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3069, 方向 = 0, 名称 = '媒婆张', x = 19, y = 56, 脚本 = 'scripts/npc/长安/媒婆张.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3038, 方向 = 2, 名称 = '一品侍卫', x = 325, y = 262, 脚本 = 'scripts/npc/长安/一品侍卫.lua' },
    { mid = 001001, 分类 = '商业', 外形 = 3090, 方向 = 1, 名称 = '王元宝', 称谓 = '唐代巨富', x = 256, y = 114, 脚本 = 'scripts/npc/长安/王元宝.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3038, 方向 = 2, 名称 = '校场监军', x = 310, y = 269, 脚本 = 'scripts/npc/长安/校场监军.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3001, 方向 = 0, 名称 = '超级巫医', x = 169, y = 99, 脚本 = 'scripts/npc/超级巫医.lua' },
    { mid = 001001, 分类 = '商业', 外形 = 3002, 方向 = 0, 名称 = '杜老板', x = 200, y = 200, 脚本 = 'scripts/npc/长安/杜老板.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3020, 方向 = 0, 名称 = '陈夫人', x = 147, y = 52, 脚本 = 'scripts/npc/长安/陈夫人.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 0048, 方向 = 1, 名称 = '小剑', x = 120, y = 44, 脚本 = 'scripts/npc/长安/小剑.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3027, 方向 = 1, 名称 = '李老九', x = 71, y = 14, 脚本 = 'scripts/npc/长安/李老九.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3019, 方向 = 1, 名称 = '庞夫人', x = 41, y = 43, 脚本 = 'scripts/npc/长安/庞夫人.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 2082, 方向 = 2, 名称 = '高统领', x = 354, y = 155, 脚本 = 'scripts/npc/长安/高统领.lua' },
    { mid = 001001, 分类 = '任务', 外形 = 3032, 方向 = 2, 名称 = '宫廷侍卫', x = 313, y = 258, 脚本 = 'scripts/npc/长安/宫廷侍卫.lua' },
    { mid = 001001, 分类 = '任务', 外形 = 3022, 方向 = 2, 名称 = '人族使者', x = 333, y = 33, 脚本 = 'scripts/npc/长安/长安_人使者.lua' },
    { mid = 001001, 分类 = '任务', 外形 = 3053, 方向 = 2, 名称 = '魔族使者', x = 337, y = 31, 脚本 = 'scripts/npc/长安/长安_魔使者.lua' },
    { mid = 001001, 分类 = '任务', 外形 = 3056, 方向 = 2, 名称 = '仙族使者', x = 341, y = 29, 脚本 = 'scripts/npc/长安/长安_仙使者.lua' },
    { mid = 001001, 分类 = '任务', 外形 = 3058, 方向 = 2, 名称 = '鬼族使者', x = 345, y = 27, 脚本 = 'scripts/npc/长安/长安_鬼使者.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3030, 方向 = 0, 名称 = '天灯老人', x = 171, y = 5, 脚本 = 'scripts/npc/长安/天灯老人.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3020, 方向 = 0, 名称 = '程夫人', x = 160, y = 208, 脚本 = 'scripts/npc/长安/程夫人.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3028, 方向 = 0, 名称 = '凤姑娘', x = 88, y = 35, 脚本 = 'scripts/npc/长安/凤姑娘.lua' },
    { mid = 001001, 分类 = '任务', 外形 = 3043, 方向 = 0, 名称 = '太白金星', x = 144, y = 134, 脚本 = 'scripts/npc/长安/太白金星.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3056, 方向 = 0, 名称 = '袁天罡', x = 170, y = 186, 脚本 = 'scripts/npc/长安/袁天罡.lua' },
    { mid = 001001, 分类 = '任务', 外形 = 2089, 方向 = 2, 名称 = '九头魔', x = 91, y = 4, 脚本 = 'scripts/npc/长安/九头魔.lua' },
    { mid = 001001, 分类 = '任务', 外形 = 2177, 方向 = 2, 名称 = '阴长生', x = 227, y = 17, 脚本 = 'scripts/npc/长安/阴长生.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3022, 方向 = 0, 名称 = '觉新', x = 73, y = 79, 脚本 = 'scripts/npc/长安/觉新.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3032, 方向 = 0, 名称 = '衙役', x = 103, y = 109, 脚本 = 'scripts/npc/长安/衙役.lua' },
    { mid = 001001, 分类 = '任务', 外形 = 3035, 方向 = 2, 名称 = '赈灾官员', x = 284, y = 148, 脚本 = 'scripts/npc/长安/赈灾官员.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3021, 方向 = 1, 名称 = '小三', x = 24, y = 20, 脚本 = 'scripts/npc/长安/小三.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3035, 方向 = 0, 名称 = '售屋吏', x = 89, y = 110, 脚本 = 'scripts/npc/长安/售屋吏.lua' },
    { mid = 001001, 分类 = '马车', 外形 = 3322, 方向 = 1, 名称 = ' ', x = 309, y = 44, 脚本 = 'scripts/npc/长安/马车.lua' },
    { mid = 001001, 分类 = '传送', 外形 = 3015, 方向 = 1, 名称 = '驿站老板', x = 299, y = 256, 脚本 = 'scripts/npc/长安/驿站老板_皇宫.lua' },
    { mid = 001001, 分类 = '任务', 外形 = 3026, 方向 = 0, 名称 = '程小晶', x = 167, y = 252, 脚本 = 'scripts/npc/长安/程小晶.lua' },
    { mid = 001001, 分类 = '传送', 外形 = 3015, 方向 = 1, 名称 = '驿站老板', x = 81, y = 226, 脚本 = 'scripts/npc/长安/驿站老板_大雁塔.lua' },
    { mid = 001001, 分类 = '传送', 外形 = 3080, 方向 = 1, 名称 = '张闻', 称谓 = '修罗古城传送人', x = 243, y = 103, 脚本 = 'scripts/npc/长安/张闻.lua' },
    { mid = 001001, 分类 = '马车', 外形 = 3322, 方向 = 1, 名称 = ' ', x = 77, y = 223, 脚本 = 'scripts/npc/长安/马车.lua' },
    { mid = 001001, 分类 = '传送', 外形 = 3015, 方向 = 1, 名称 = '驿站老板', x = 65, y = 20, 脚本 = 'scripts/npc/长安/驿站老板_留香阁.lua' },
    { mid = 001001, 分类 = '马车', 外形 = 3322, 方向 = 1, 名称 = ' ', x = 64, y = 27, 脚本 = 'scripts/npc/长安/马车.lua' },
    { mid = 001001, 分类 = '马车', 外形 = 3322, 方向 = 1, 名称 = ' ', x = 248, y = 86, 脚本 = 'scripts/npc/长安/马车.lua' },
    { mid = 001001, 分类 = '传送', 外形 = 3015, 方向 = 1, 名称 = '驿站老板', x = 259, y = 90, 脚本 = 'scripts/npc/长安/驿站老板_桥头.lua' },
    { mid = 001001, 分类 = '任务', 外形 = 3031, 方向 = 2, 名称 = '慈恩寺方丈', x = 101, y = 202, 脚本 = 'scripts/npc/长安/慈恩寺方丈.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 0001, 方向 = 2, 名称 = '小趴菜',称谓 = '水路大赛冠军', x = 246, y = 97, 脚本 = 'scripts/npc/长安/测试人员.lua' },
    { mid = 001001, 分类 = '任务', 外形 = 2170, 方向 = 2, 名称 = '帮派大战组织人', x = 359, y = 55, 脚本 = 'scripts/npc/长安/帮派大战组织人.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3049, 方向 = 2, 名称 = '慈恩寺监院', x = 105, y = 203, 脚本 = 'scripts/npc/长安/慈恩寺监院.lua' },
    { mid = 001001, 分类 = '传送', 外形 = 3015, 方向 = 1, 名称 = '驿站老板', x = 310, y = 37, 脚本 = 'scripts/npc/长安/驿站老板_武馆.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 6507, 方向 = 0, 名称 = '超级管家', x = 219, y = 107, 脚本 = 'scripts/npc/长安/超级管家.lua' },
    { mid = 001001, 分类 = '任务', 外形 = 50, 方向 = 0, 名称 = '东君', x = 325, y = 115, 脚本 = 'scripts/npc/长安/东君.lua' },
    --{ mid = 001001, 分类 = '普通', 外形 = 3376, 方向 = 0, 名称 = '耿强达', x = 235, y = 76, 称谓 = '礼包大使', 脚本 = 'scripts/npc/长安/礼包大使.lua' },
    { mid = 001001, 分类 = '普通', 外形 = 3028, 方向 = 0, 名称 = '耿美达', x = 239, y = 78, 称谓 = '回收大使', 脚本 = 'scripts/npc/长安/回收大使.lua' },
    --{ mid = 001001, 分类 = '任务', 外形 = 50, 方向 = 2, 名称 = '补偿使者', x = 265, y = 110, 脚本 = 'scripts/npc/长安/补偿使者.lua' },
    --{ mid = 001001, 分类 = '任务', 外形 = 3090, 方向 = 2, 名称 = '黑市商人', x = 234, y = 105, 脚本 = 'scripts/npc/长安/长安_黑市商人.lua' },


    -------------------------------------------------化生寺-------------------------------------------------
    { mid = 001002, 分类 = '普通', 外形 = 3049, 方向 = 0, 名称 = '榜评僧', x = 117, y = 54, 脚本 = 'scripts/npc/长安/化生寺/榜评僧.lua' },
    { mid = 001002, 分类 = '任务', 外形 = 3031, 方向 = 0, 名称 = '玄慈禅师', x = 145, y = 34, 脚本 = 'scripts/npc/长安/化生寺/玄慈禅师.lua' },
    { mid = 001002, 分类 = '普通', 外形 = 2283, 方向 = 0, 名称 = '步长禅师', x = 86, y = 20, 脚本 = 'scripts/npc/长安/化生寺/步长禅师.lua' },
    { mid = 001002, 分类 = '普通', 外形 = 3031, 方向 = 0, 名称 = '晦定禅师', x = 138, y = 107, 脚本 = 'scripts/npc/长安/化生寺/晦定禅师.lua' },
    { mid = 001002, 分类 = '任务', 外形 = 3061, 方向 = 0, 名称 = '大闹天宫奖励领取人', x = 137, y = 57, 脚本 = 'scripts/npc/长安/化生寺/大闹天宫奖励领取人.lua' },
    -------------------------------------------------皇宫-------------------------------------------------
    { mid = 001003, 分类 = '普通', 外形 = 3122, 方向 = 2, 名称 = '班宏', 称谓 = '大唐户部尚书', x = 116, y = 16, 脚本 = 'scripts/npc/长安/皇宫/班宏.lua' },
    { mid = 001003, 分类 = '任务', 外形 = 3038, 方向 = 2, 名称 = '凌烟阁守将', x = 232, y = 14, 脚本 = 'scripts/npc/长安/皇宫/凌烟阁守将.lua' },
    { mid = 001003, 分类 = '普通', 外形 = 3038, 方向 = 3, 名称 = '御林军右统领', x = 139, y = 53, 脚本 = 'scripts/npc/长安/皇宫/御林军右统领.lua' },
    { mid = 001003, 分类 = '普通', 外形 = 3076, 方向 = 2, 名称 = '水陆百晓生', 称谓 = '水陆大会风云榜', x = 133, y = 49, 脚本 = 'scripts/npc/长安/皇宫/水陆百晓生.lua' },
    { mid = 001003, 分类 = '普通', 外形 = 3038, 方向 = 1, 名称 = '御林军左统领', x = 132, y = 56, 脚本 = 'scripts/npc/长安/皇宫/御林军左统领.lua' },
    { mid = 001003, 分类 = '任务', 外形 = 3035, 方向 = 2, 名称 = '魏征', 称谓 = '水陆大会组织人', x = 119, y = 48, 脚本 = 'scripts/npc/长安/皇宫/魏征.lua' },
    { mid = 001003, 分类 = '普通', 外形 = 3035, 方向 = 2, 名称 = '功绩官', x = 233, y = 9, 脚本 = 'scripts/npc/长安/皇宫/功绩官.lua' },
    { mid = 001003, 分类 = '普通', 外形 = 3007, 方向 = 2, 名称 = '作坊老板', x = 88, y = 35, 脚本 = 'scripts/npc/长安/皇宫/作坊老板.lua' },
    { mid = 001003, 分类 = '普通', 外形 = 3031, 方向 = 0, 名称 = '色空禅师', x = 63, y = 50, 脚本 = 'scripts/npc/长安/皇宫/色空禅师.lua' },
    { mid = 001003, 分类 = '普通', 外形 = 3051, 方向 = 0, 名称 = '黄大仙', 称谓 = '种族转换人', x = 70, y = 26, 脚本 = 'scripts/npc/长安/皇宫/黄大仙.lua' },
    -------------------------------------------------大雁塔一层-------------------------------------------------
    { mid = 001004, 分类 = '传送', 外形 = 2004, 方向 = 1, 名称 = '引路小妖', 称谓 = '我是传送小妖怪', x = 108, y = 24, 脚本 = 'scripts/npc/长安/大雁塔一层/引路小妖.lua' },
    { mid = 001004, 分类 = '普通', 外形 = 3073, 方向 = 0, 名称 = '索命鬼', x = 114, y = 68, 脚本 = 'scripts/npc/长安/大雁塔一层/索命鬼.lua' },
    -------------------------------------------------大雁塔二层-------------------------------------------------
    { mid = 001005, 分类 = '普通', 外形 = 3053, 方向 = 0, 名称 = '大力精', x = 49, y = 59, 脚本 = 'scripts/npc/长安/大雁塔二层/大力精.lua' },
    -------------------------------------------------大雁塔三层-------------------------------------------------
    { mid = 001006, 分类 = '普通', 外形 = 2059, 方向 = 0, 名称 = '狐狸贝贝', x = 12, y = 67, 脚本 = 'scripts/npc/长安/大雁塔三层/狐狸贝贝.lua' },
    { mid = 001006, 分类 = '普通', 外形 = 3045, 方向 = 0, 名称 = '茅山道士', x = 48, y = 54, 脚本 = 'scripts/npc/长安/大雁塔三层/大力精.lua' },
    -------------------------------------------------大雁塔四层-------------------------------------------------
    { mid = 001007, 分类 = '普通', 外形 = 3068, 方向 = 0, 名称 = '鬼魁', x = 48, y = 53, 脚本 = 'scripts/npc/长安/大雁塔四层/鬼魁.lua' },
    { mid = 001007, 分类 = '普通', 外形 = 2019, 方向 = 1, 名称 = '悲鸣怪', x = 54, y = 44, 脚本 = 'scripts/npc/长安/大雁塔四层/悲鸣怪.lua' },
    -------------------------------------------------大雁塔五层-------------------------------------------------
    -------------------------------------------------大雁塔顶-------------------------------------------------
    { mid = 001009, 分类 = '任务', 外形 = 0062, 方向 = 0, 名称 = '三尸派掌门', x = 32, y = 14, 脚本 = 'scripts/npc/掌门/三尸派掌门.lua' },
    { mid = 001009, 分类 = '普通', 外形 = 2176, 方向 = 2, 名称 = '三尸神', x = 37, y = 19, 脚本 = 'scripts/npc/师门传送.lua' },
    -------------------------------------------------长安赌坊-------------------------------------------------
    { mid = 001010, 分类 = '普通', 外形 = 3086, 方向 = 1, 名称 = '赌场老板', x = 14, y = 10, 脚本 = 'scripts/npc/长安/长乐赌坊/赌场老板.lua' },
    { mid = 001010, 分类 = '普通', 外形 = 3087, 方向 = 1, 名称 = '赌天天', x = 11, y = 11, 脚本 = 'scripts/npc/长安/长乐赌坊/赌天天.lua' },
    -------------------------------------------------国子监考场-------------------------------------------------
    { mid = 001011, 分类 = '普通', 外形 = 3022, 方向 = 0, 名称 = '王秀才', x = 16, y = 14, 脚本 = 'scripts/npc/长安/国子监考场/王秀才.lua' },
    -------------------------------------------------长安城隍庙-------------------------------------------------
    { mid = 001012, 分类 = '普通', 外形 = 3045, 方向 = 0, 名称 = '庙祝', x = 21, y = 17, 脚本 = 'scripts/npc/长安/长安城隍庙/庙祝.lua' },
    -------------------------------------------------长安钱庄-------------------------------------------------
    { mid = 001013, 分类 = '商业', 外形 = 3026, 方向 = 1, 名称 = '金掌柜', 称谓 = '福荣钱庄老板', x = 21, y = 8, 脚本 = 'scripts/npc/长安/元裕钱庄/金掌柜.lua' },
    { mid = 001013, 分类 = '商业', 外形 = 3004, 方向 = 0, 名称 = '钱庄老板', x = 7, y = 11, 脚本 = 'scripts/npc/长安/长安钱庄/钱庄老板.lua' },
    -------------------------------------------------长安当铺-------------------------------------------------
    { mid = 001014, 分类 = '商业', 外形 = 3005, 方向 = 2, 名称 = '当铺老板', x = 20, y = 12, 脚本 = 'scripts/npc/长安/长安当铺/当铺老板.lua' },
    -------------------------------------------------长安杂货店-------------------------------------------------
    { mid = 011015, 分类 = '商业', 外形 = 3001, 方向 = 1, 名称 = '杂货店老板', 称谓 = '南北杂货店', x = 17, y = 9, 脚本 = 'scripts/npc/长安/南北杂货店/杂货店老板.lua' },
    { mid = 001015, 分类 = '商业', 外形 = 3001, 方向 = 2, 名称 = '杂货店老板', x = 21, y = 7, 脚本 = 'scripts/npc/长安/长安杂货店/杂货店老板.lua' },
    -------------------------------------------------回春堂-------------------------------------------------
    { mid = 001016, 分类 = '普通', 外形 = 3008, 方向 = 1, 名称 = '阎王敌', x = 11, y = 7, 脚本 = 'scripts/npc/长安/回春堂/阎王敌.lua' },
    { mid = 001016, 分类 = '商业', 外形 = 3002, 方向 = 0, 名称 = '药店老板', x = 18, y = 11, 脚本 = 'scripts/npc/长安/回春堂/药店老板.lua' },
    -------------------------------------------------长安饰品店-------------------------------------------------
    { mid = 001017, 分类 = '商业', 外形 = 3007, 方向 = 0, 名称 = '饰品店老板', 称谓 = '长安饰品店', x = 11, y = 8, 脚本 = 'scripts/npc/长安/长安饰品店/饰品店老板.lua' },
    -------------------------------------------------长安乐坊-------------------------------------------------
    { mid = 001018, 分类 = '商业', 外形 = 3007, 方向 = 0, 名称 = '乐坊老板', 称谓 = '长安乐坊', x = 15, y = 10, 脚本 = 'scripts/npc/长安/长安乐坊/乐坊老板.lua' },
    -------------------------------------------------长安书店-------------------------------------------------
    { mid = 001019, 分类 = '商业 ', 外形 = 3076, 方向 = 0, 名称 = '丹青生', 称谓 = '长安书店', x = 21, y = 11, 脚本 = 'scripts/npc/长安/长安书店/丹青生.lua' },
    { mid = 001019, 分类 = '商业', 外形 = 3076, 方向 = 0, 名称 = '书店老板', 称谓 = '长安书店', x = 16, y = 11, 脚本 = 'scripts/npc/长安/长安书店/书店老板.lua' },
    -------------------------------------------------长安武器店-------------------------------------------------
    { mid = 001020, 分类 = '普通', 外形 = 3012, 方向 = 0, 名称 = '武器店伙计', 称谓 = '长安武器店', x = 18, y = 9, 脚本 = 'scripts/npc/长安/长安武器店/武器店伙计.lua' },
    { mid = 001020, 分类 = '商业', 外形 = 3003, 方向 = 0, 名称 = '武器店老板', 称谓 = '长安武器店', x = 14, y = 12, 脚本 = 'scripts/npc/长安/长安武器店/武器店老板.lua' },
    -------------------------------------------------长安福寿店-------------------------------------------------
    { mid = 001021, 分类 = '商业', 外形 = 3009, 方向 = 1, 名称 = '福寿店老板', 称谓 = '长安福寿店', x = 21, y = 12, 脚本 = 'scripts/npc/长安/长安福寿店/福寿店老板.lua' },
    -------------------------------------------------长安布庄-------------------------------------------------
    { mid = 011022, 分类 = '商业', 外形 = 3010, 方向 = 0, 名称 = '服装店老板', 称谓 = '张记布庄', x = 13, y = 11, 脚本 = 'scripts/npc/长安/张记布庄/服装店老板.lua' },
    { mid = 001022, 分类 = '商业', 外形 = 3010, 方向 = 2, 名称 = '服装店老板', x = 21, y = 9, 脚本 = 'scripts/npc/长安/长安布庄/服装店老板.lua' },
    -------------------------------------------------长安武馆-------------------------------------------------
    { mid = 001023, 分类 = '商业', 外形 = 2077, 方向 = 2, 名称 = '武馆老板', x = 20, y = 19, 脚本 = 'scripts/npc/长安/长安武馆/武馆老板.lua' },
    -------------------------------------------------长风镖局-------------------------------------------------
    { mid = 001024, 分类 = '传送', 外形 = 3015, 方向 = 1, 名称 = '镖局老板', x = 14, y = 9, 脚本 = 'scripts/npc/长安/长风镖局/镖局老板.lua' },
    -------------------------------------------------冯记铁铺-------------------------------------------------
    { mid = 001025, 分类 = '普通', 外形 = 3003, 方向 = 0, 名称 = '木匠', x = 15, y = 5, 脚本 = 'scripts/npc/长安/冯记铁铺/木匠.lua' },
    { mid = 001025, 分类 = '普通', 外形 = 3023, 方向 = 1, 名称 = '学徒', x = 24, y = 10, 脚本 = 'scripts/npc/长安/冯记铁铺/学徒.lua' },
    { mid = 001025, 分类 = '普通', 外形 = 3012, 方向 = 0, 名称 = '冯铁匠', x = 9, y = 8, 脚本 = 'scripts/npc/长安/冯记铁铺/冯铁匠.lua' },
    -------------------------------------------------国子监书库-------------------------------------------------
    { mid = 001026, 分类 = '普通', 外形 = 3008, 方向 = 0, 名称 = '贺知章', x = 31, y = 13, 脚本 = 'scripts/npc/长安/国子监书库/贺知章.lua' },
    -------------------------------------------------广源酒馆-------------------------------------------------
    { mid = 001027, 分类 = '商业', 外形 = 3013, 方向 = 0, 名称 = '酒店老板', 称谓 = '广源酒馆', x = 14, y = 13, 脚本 = 'scripts/npc/长安/广源酒馆/酒店老板.lua' },
    -------------------------------------------------长安酒店-------------------------------------------------
    { mid = 001028, 分类 = '普通', 外形 = 3021, 方向 = 0, 名称 = '小二', 称谓 = '长安酒店', x = 12, y = 10, 脚本 = 'scripts/npc/长安/长安酒店/小二.lua' },
    { mid = 001028, 分类 = '商业', 外形 = 3013, 方向 = 0, 名称 = '酒店老板', 称谓 = '长安酒店', x = 10, y = 4, 脚本 = 'scripts/npc/长安/长安酒店/酒店老板.lua' },
    { mid = 001028, 分类 = '普通', 外形 = 3105, 方向 = 0, 名称 = '莫问尘', 称谓 = '可以帮你洗点的人', x = 23, y = 10, 脚本 = 'scripts/npc/长安/长安酒店/莫问尘.lua' },
    -------------------------------------------------云来酒店-------------------------------------------------
    { mid = 001030, 分类 = '传送', 外形 = 3013, 方向 = 1, 名称 = '酒店老板', x = 18, y = 8, 脚本 = 'scripts/npc/长安/云来酒店/酒店老板.lua' },
    { mid = 001030, 分类 = '传送', 外形 = 3021, 方向 = 1, 名称 = '小二', x = 12, y = 4, 脚本 = 'scripts/npc/长安/云来酒店/小二.lua' },
    -------------------------------------------------留香阁-------------------------------------------------
    { mid = 001033, 分类 = '普通', 外形 = 3006, 方向 = 0, 名称 = '青楼老板', 称谓 = '留香阁', x = 18, y = 25, 脚本 = 'scripts/npc/长安/留香阁/青楼老板.lua' },
    -------------------------------------------------方丈室-------------------------------------------------
    { mid = 001042, 分类 = '普通', 外形 = 3047, 方向 = 0, 名称 = '空慈方丈', x = 19, y = 16, 脚本 = 'scripts/npc/长安/化生寺/空慈方丈.lua' },
    -------------------------------------------------玄空僧房-------------------------------------------------
    { mid = 001043, 分类 = '普通', 外形 = 3048, 方向 = 0, 名称 = '玄奘', x = 22, y = 16, 脚本 = 'scripts/npc/长安/玄空僧房/玄奘.lua' },
    { mid = 001043, 分类 = '普通', 外形 = 3049, 方向 = 0, 名称 = '玄空', x = 8, y = 12, 脚本 = 'scripts/npc/长安/玄空僧房/玄空.lua' },
    { mid = 011043, 分类 = '普通', 外形 = 3031, 方向 = 1, 名称 = '空度禅师', x = 24, y = 18, 脚本 = 'scripts/npc/师门传送.lua' },
    { mid = 011043, 分类 = '任务', 外形 = 0126, 方向 = 0, 名称 = '化生寺掌门', x = 19, y = 14, 脚本 = 'scripts/npc/掌门/化生寺掌门.lua' },
    -------------------------------------------------金銮殿-------------------------------------------------
    { mid = 001044, 分类 = '普通', 外形 = 2077, 方向 = 0, 名称 = '胡敬德', x = 45, y = 35, 脚本 = 'scripts/npc/长安/金銮殿/胡敬德.lua' },
    { mid = 001044, 分类 = '普通', 外形 = 3122, 方向 = 0, 名称 = '兵部尚书', x = 14, y = 25, 脚本 = 'scripts/npc/长安/金銮殿/兵部尚书.lua' },
    { mid = 001044, 分类 = '普通', 外形 = 3035, 方向 = 0, 名称 = '徐茂公', x = 37, y = 31, 脚本 = 'scripts/npc/长安/金銮殿/徐茂公.lua' },
    { mid = 001044, 分类 = '普通', 外形 = 3122, 方向 = 2, 名称 = '杜如晦', x = 52, y = 22, 脚本 = 'scripts/npc/长安/金銮殿/杜如晦.lua' },
    { mid = 001044, 分类 = '普通', 外形 = 3085, 方向 = 2, 名称 = '上官仪', x = 63, y = 27, 脚本 = 'scripts/npc/长安/金銮殿/上官仪.lua' },
    { mid = 001044, 分类 = '普通', 外形 = 3037, 方向 = 2, 名称 = '李世民', x = 67, y = 41, 脚本 = 'scripts/npc/长安/金銮殿/李世民.lua' },
    { mid = 001044, 分类 = '任务', 外形 = 3061, 方向 = 2, 名称 = '大闹天宫奖励领取人', x = 62, y = 45, 脚本 = 'scripts/npc/长安/金銮殿/大闹天宫奖励领取人.lua' },
    { mid = 001045, 分类 = '普通', 外形 = 3033, 方向 = 0, 名称 = '公孙大娘', x = 19, y = 8, 脚本 = 'scripts/npc/长安/皇宫/公孙大娘.lua' },
    -------------------------------------------------丞相府-------------------------------------------------
    { mid = 001049, 分类 = '普通', 外形 = 3014, 方向 = 1, 名称 = '殷夫人', x = 15, y = 17, 脚本 = 'scripts/npc/长安/丞相府/殷夫人.lua' },
    { mid = 001049, 分类 = '普通', 外形 = 3035, 方向 = 1, 名称 = '殷丞相', x = 29, y = 23, 脚本 = 'scripts/npc/长安/丞相府/殷丞相.lua' },
    -------------------------------------------------衙门-------------------------------------------------
    { mid = 001050, 分类 = '普通', 外形 = 3076, 方向 = 1, 名称 = '师爷', x = 22, y = 20, 脚本 = 'scripts/npc/长安/衙门/师爷.lua' },
    { mid = 001052, 分类 = '任务', 外形 = 3020, 方向 = 2, 名称 = '程夫人', x = 15, y = 18, 脚本 = 'scripts/npc/长安/程府厢房/程夫人.lua' },
    -------------------------------------------------程咬金府-------------------------------------------------
    { mid = 001054, 分类 = '任务', 外形 = 0040, 方向 = 0, 名称 = '将军府掌门', x = 27, y = 11, 脚本 = 'scripts/npc/掌门/将军府掌门.lua' },
    { mid = 001054, 分类 = '普通', 外形 = 2083, 方向 = 2, 名称 = '程咬金', x = 37, y = 11, 脚本 = 'scripts/npc/师门传送.lua' },
    -------------------------------------------------秦府内室-------------------------------------------------
    { mid = 001056, 分类 = '普通', 外形 = 3019, 方向 = 1, 名称 = '秦夫人', x = 25, y = 27, 脚本 = 'scripts/npc/长安/秦府内室/秦夫人.lua' },
    -------------------------------------------------秦琼府-------------------------------------------------
    { mid = 001057, 分类 = '普通', 外形 = 2082, 方向 = 2, 名称 = '秦琼', 称谓 = '秦琼府', x = 22, y = 17, 脚本 = 'scripts/npc/长安/秦琼府/秦琼.lua' },
    -------------------------------------------------长寿村-------------------------------------------------
    { mid = 001070, 分类 = '普通', 外形 = 3027, 方向 = 0, 名称 = '天寿老人', x = 29, y = 25, 脚本 = 'scripts/npc/长寿村/天寿老人.lua' },
    { mid = 001070, 分类 = '传送', 外形 = 3015, 方向 = 2, 名称 = '驿站老板', x = 54, y = 21, 脚本 = 'scripts/npc/长寿村/驿站老板.lua' },
    { mid = 001070, 分类 = '普通', 外形 = 3026, 方向 = 0, 名称 = '陈老财', x = 71, y = 127, 脚本 = 'scripts/npc/长寿村/陈老财.lua' },
    { mid = 001070, 分类 = '普通', 外形 = 3023, 方向 = 0, 名称 = '小黑', x = 19, y = 7, 脚本 = 'scripts/npc/长寿村/小黑.lua' },
    { mid = 001070, 分类 = '普通', 外形 = 3046, 方向 = 0, 名称 = '惠静师太', x = 19, y = 31, 脚本 = 'scripts/npc/长寿村/惠静师太.lua' },
    { mid = 001070, 分类 = '普通', 外形 = 3055, 方向 = 0, 名称 = '南极仙翁', x = 33, y = 47, 脚本 = 'scripts/npc/长寿村/南极仙翁.lua' },
    { mid = 001070, 分类 = '普通', 外形 = 3001, 方向 = 0, 名称 = '超级巫医', x = 58, y = 107, 脚本 = 'scripts/npc/超级巫医.lua' },
    -------------------------------------------------长寿村当铺-------------------------------------------------
    { mid = 001072, 分类 = '商业', 外形 = 3005, 方向 = 0, 名称 = '当铺老板', x = 13, y = 7, 脚本 = 'scripts/npc/长寿村/长寿村当铺/当铺老板.lua' },
    -------------------------------------------------长寿村打铁铺-------------------------------------------------
    { mid = 001073, 分类 = '普通', 外形 = 3112, 方向 = 0, 名称 = '龙天兵', x = 24, y = 17, 脚本 = 'scripts/npc/长寿村/长寿村打铁铺/龙天兵.lua' },
    { mid = 001073, 分类 = '普通', 外形 = 3003, 方向 = 0, 名称 = '木匠', x = 16, y = 15, 脚本 = 'scripts/npc/长寿村/长寿村打铁铺/木匠.lua' },
    -------------------------------------------------长寿村服装店-------------------------------------------------
    { mid = 001074, 分类 = '商业', 外形 = 3010, 方向 = 0, 名称 = '服装店老板', x = 15, y = 8, 脚本 = 'scripts/npc/长寿村/长寿村服装店/服装店老板.lua' },
    -------------------------------------------------长寿酒馆-------------------------------------------------
    { mid = 001075, 分类 = '商业', 外形 = 3013, 方向 = 0, 名称 = '酒店老板', x = 25, y = 16, 脚本 = 'scripts/npc/长寿村/长寿酒馆/酒店老板.lua' },
    -------------------------------------------------长寿村丹房-------------------------------------------------
    { mid = 001077, 分类 = '商业', 外形 = 3002, 方向 = 0, 名称 = '药店老板', x = 17, y = 8, 脚本 = 'scripts/npc/长寿村/长寿村丹房/药店老板.lua' },
    -------------------------------------------------村长家-------------------------------------------------
    { mid = 001080, 分类 = '普通', 外形 = 3051, 方向 = 0, 名称 = '村长', x = 16, y = 10, 脚本 = 'scripts/npc/长寿村/村长.lua' },
    -------------------------------------------------长寿村钱庄-------------------------------------------------
    { mid = 001081, 分类 = '商业', 外形 = 3004, 方向 = 2, 名称 = '钱庄老板', x = 20, y = 7, 脚本 = 'scripts/npc/长寿村/长寿村钱庄/钱庄老板.lua' },
    -------------------------------------------------长寿神庙-------------------------------------------------
    { mid = 001082, 分类 = '普通', 外形 = 2070, 方向 = 0, 名称 = '守护使者', x = 15, y = 16, 脚本 = 'scripts/npc/长寿村/守护使者.lua' },
    -------------------------------------------------长寿村饰品店-------------------------------------------------
    { mid = 001083, 分类 = '商业', 外形 = 3007, 方向 = 0, 名称 = '饰品店老板', x = 21, y = 18, 脚本 = 'scripts/npc/长寿村/长寿村饰品店/饰品店老板.lua' },
    -------------------------------------------------长寿武馆-------------------------------------------------
    { mid = 001084, 分类 = '普通', 外形 = 3011, 方向 = 0, 名称 = '武馆老板', x = 12, y = 8, 脚本 = 'scripts/npc/长寿村/长寿武馆/武馆老板.lua' },
    -------------------------------------------------长寿村武器店-------------------------------------------------
    { mid = 001085, 分类 = '商业', 外形 = 3003, 方向 = 0, 名称 = '武器店老板', x = 16, y = 10, 脚本 = 'scripts/npc/长寿村/长寿村武器店/武器店老板.lua' },
    -------------------------------------------------杂货店-------------------------------------------------
    { mid = 001087, 分类 = '商业', 外形 = 3001, 方向 = 2, 名称 = '杂货店老板', x = 15, y = 8, 脚本 = 'scripts/npc/长寿村/长寿村杂货店/杂货店老板.lua' },
    -------------------------------------------------大雁塔六层-------------------------------------------------
    { mid = 001090, 分类 = '普通', 外形 = 2045, 方向 = 0, 名称 = '山贼之灵', x = 50, y = 56, 脚本 = 'scripts/npc/长安/大雁塔六层/山贼之灵.lua' },
    { mid = 001090, 分类 = '普通', 外形 = 2294, 方向 = 0, 名称 = '镇塔之神', x = 55, y = 44, 脚本 = 'scripts/npc/长安/大雁塔六层/镇塔之神.lua' },
    -------------------------------------------------长寿村外-------------------------------------------------
    { mid = 001091, 分类 = '普通', 外形 = 3027, 方向 = 0, 名称 = '长寿老人', x = 96, y = 90, 脚本 = 'scripts/npc/长寿村/长寿村外/长寿老人.lua' },
    { mid = 001091, 分类 = '传送', 外形 = 3063, 方向 = 1, 名称 = '天将', x = 88, y = 19, 脚本 = 'scripts/npc/长寿村/长寿郊外/天将.lua' },
    { mid = 001091, 分类 = '普通', 外形 = 3061, 方向 = 1, 名称 = '小花仙', x = 56, y = 38, 脚本 = 'scripts/npc/长寿村/长寿村外/小花仙.lua' },
    { mid = 001091, 分类 = '普通', 外形 = 3047, 方向 = 1, 名称 = '云游僧', x = 31, y = 97, 脚本 = 'scripts/npc/长寿村/长寿村外/云游僧.lua' },
    -- {mid = 001091, 分类 = '普通', 外形 = 3348, 方向 = 1, 名称 = '', x = 82, y = 91, 脚本 = 'scripts/npc/长寿村/长寿村外/云游僧.lua'},
    -------------------------------------------------傲来国-------------------------------------------------
    { mid = 001092, 分类 = '普通', 外形 = 2015, 方向 = 0, 名称 = '紫霞', x = 311, y = 35, 脚本 = 'scripts/npc/傲来国/紫霞.lua' },
    { mid = 001092, 分类 = '普通', 外形 = 2025, 方向 = 0, 名称 = '山妖头领', x = 239, y = 234, 脚本 = 'scripts/npc/傲来国/山妖头领.lua' },
    { mid = 001092, 分类 = '普通', 外形 = 2077, 方向 = 0, 名称 = '镖局老板', x = 320, y = 124, 脚本 = 'scripts/npc/傲来国/镖局老板.lua' },
    { mid = 001092, 分类 = '传送', 外形 = 3015, 方向 = 1, 名称 = '驿站老板', x = 239, y = 104, 脚本 = 'scripts/npc/傲来国/驿站老板.lua' },
    { mid = 001092, 分类 = '传送', 外形 = 2063, 方向 = 1, 名称 = '蟹兵', x = 94, y = 13, 脚本 = 'scripts/npc/傲来国/蟹将.lua' },
    { mid = 001092, 分类 = '传送', 外形 = 3057, 方向 = 1, 名称 = '古灵精怪', x = 32, y = 21, 脚本 = 'scripts/npc/傲来国/古灵精怪.lua' },
    { mid = 001092, 分类 = '普通', 外形 = 7467, 方向 = 0, 名称 = '蝴蝶妹妹', x = 107, y = 79, 脚本 = 'scripts/npc/傲来国/蝴蝶妹妹.lua' },
    { mid = 001092, 分类 = '普通', 外形 = 3023, 方向 = 0, 名称 = '大牛', x = 110, y = 7, 脚本 = 'scripts/npc/傲来国/大牛.lua' },
    { mid = 001092, 分类 = '普通', 外形 = 2064, 方向 = 0, 名称 = '龟学士', x = 360, y = 147, 脚本 = 'scripts/npc/傲来国/龟学士.lua' },
    { mid = 001092, 分类 = '普通', 外形 = 2089, 方向 = 0, 名称 = '九头精怪', x = 154, y = 121, 脚本 = 'scripts/npc/傲来国/九头精怪.lua' },
    { mid = 001092, 分类 = '传送', 外形 = 2112, 方向 = 1, 名称 = '海太公', x = 85, y = 46, 脚本 = 'scripts/npc/傲来国/海太公.lua' },
    { mid = 001092, 分类 = '普通', 外形 = 3043, 方向 = 0, 名称 = '灵兽大仙', x = 15, y = 12, 脚本 = 'scripts/npc/傲来国/灵兽大仙.lua' },
    { mid = 001092, 分类 = '普通', 外形 = 2062, 方向 = 0, 名称 = '虾将军', x = 116, y = 31, 脚本 = 'scripts/npc/傲来国/虾将军.lua' },
    { mid = 001092, 分类 = '普通', 外形 = 3001, 方向 = 0, 名称 = '超级巫医', x = 273, y = 130, 脚本 = 'scripts/npc/超级巫医.lua' },
    { mid = 001092, 分类 = '普通', 外形 = 3047, 方向 = 0, 名称 = '守禅僧', x = 215, y = 214, 脚本 = 'scripts/npc/傲来国/守禅僧.lua' },
    { mid = 001092, 分类 = '普通', 外形 = 2023, 方向 = 0, 名称 = '雷鸟怪', x = 217, y = 205, 脚本 = 'scripts/npc/傲来国/雷鸟怪.lua' },
    { mid = 001100, 分类 = '普通', 外形 = 3106, 方向 = 0, 名称 = '琼芝草苗', x = 28, y = 29, 脚本 = 'scripts/npc/傲来国/琼芝草苗.lua' },
    -------------------------------------------------女儿村-------------------------------------------------
    { mid = 001142, 分类 = '普通', 外形 = 3067, 方向 = 0, 名称 = '月老', x = 16, y = 46, 脚本 = 'scripts/npc/傲来国/女儿村/月老.lua' },
    { mid = 001142, 分类 = '商业', 外形 = 3008, 方向 = 0, 名称 = '烟火商人', x = 52, y = 41, 脚本 = 'scripts/npc/傲来国/女儿村/烟火商人.lua' },
    { mid = 001142, 分类 = '普通', 外形 = 3071, 方向 = 0, 名称 = '翠花', x = 52, y = 53, 脚本 = 'scripts/npc/傲来国/女儿村/翠花.lua' },
    -------------------------------------------------傲来国当铺-------------------------------------------------
    { mid = 001094, 分类 = '商业', 外形 = 3005, 方向 = 0, 名称 = '当铺老板', x = 22, y = 5, 脚本 = 'scripts/npc/傲来国/傲来国当铺/当铺老板.lua' },
    -------------------------------------------------傲来国服装店-------------------------------------------------
    { mid = 001095, 分类 = '商业', 外形 = 3010, 方向 = 0, 名称 = '服装店老板', x = 19, y = 10, 脚本 = 'scripts/npc/傲来国/傲来国服装店/服装店老板.lua' },
    -------------------------------------------------傲来国皇宫-------------------------------------------------
    { mid = 001096, 分类 = '普通', 外形 = 2062, 方向 = 2, 名称 = '虾兵', x = 35, y = 34, 脚本 = 'scripts/npc/傲来国/傲来国皇宫/蟹将.lua' },
    { mid = 001096, 分类 = '普通', 外形 = 2063, 方向 = 2, 名称 = '蟹将', x = 47, y = 29, 脚本 = 'scripts/npc/傲来国/傲来国皇宫/蟹将.lua' },
    -------------------------------------------------傲来国酒店-------------------------------------------------
    { mid = 001097, 分类 = '商业', 外形 = 3013, 方向 = 0, 名称 = '酒店老板', x = 18, y = 10, 脚本 = 'scripts/npc/傲来国/傲来国酒店/酒店老板.lua' },
    -------------------------------------------------傲来国钱庄-------------------------------------------------
    { mid = 001099, 分类 = '商业', 外形 = 3004, 方向 = 0, 名称 = '钱庄老板', x = 17, y = 10, 脚本 = 'scripts/npc/傲来国/傲来国钱庄/钱庄老板.lua' },
    -------------------------------------------------傲来国武器店-------------------------------------------------
    { mid = 001101, 分类 = '普通', 外形 = 3113, 方向 = 0, 名称 = '黄哥', x = 13, y = 22, 脚本 = 'scripts/npc/傲来国/傲来国武器店/黄哥.lua' },
    { mid = 001101, 分类 = '商业', 外形 = 3003, 方向 = 0, 名称 = '武器店老板', x = 23, y = 17, 脚本 = 'scripts/npc/傲来国/傲来国武器店/武器店老板.lua' },
    { mid = 001101, 分类 = '普通', 外形 = 3003, 方向 = 0, 名称 = '木匠', x = 9, y = 18, 脚本 = 'scripts/npc/傲来国/傲来国武器店/木匠.lua' },
    -------------------------------------------------傲来国武馆-------------------------------------------------
    { mid = 001102, 分类 = '普通', 外形 = 3011, 方向 = 0, 名称 = '武馆老板', x = 17, y = 10, 脚本 = 'scripts/npc/傲来国/傲来国武馆/武馆老板.lua' },
    -------------------------------------------------傲来国杂货店-------------------------------------------------
    { mid = 001105, 分类 = '商业', 外形 = 3001, 方向 = 0, 名称 = '杂货店老板', x = 14, y = 10, 脚本 = 'scripts/npc/傲来国/傲来国杂货店/杂货店老板.lua' },
    -------------------------------------------------同义堂-------------------------------------------------
    { mid = 001104, 分类 = '商业', 外形 = 3002, 方向 = 2, 名称 = '药店老板', x = 19, y = 9, 脚本 = 'scripts/npc/傲来国/同义堂/药店老板.lua' },
    -------------------------------------------------民居-------------------------------------------------
    { mid = 001108, 分类 = '传送', 外形 = 3165, 方向 = 1, 名称 = '流沙河船夫', x = 18, y = 7, 脚本 = 'scripts/npc/大唐边境/流沙河船夫.lua' },
    { mid = 001110, 分类 = '普通', 外形 = 2006, 方向 = 2, 名称 = '抢经的黑熊', x = 519, y = 5, 脚本 = 'scripts/npc/大唐境内/抢经的黑熊.lua' },
    { mid = 001110, 分类 = '普通', 外形 = 2044, 方向 = 1, 名称 = '抢药的飞贼', x = 307, y = 87, 脚本 = 'scripts/npc/大唐境内/抢药的飞贼.lua' },
    { mid = 001110, 分类 = '传送', 外形 = 3015, 方向 = 1, 名称 = '驿站老板', x = 83, y = 97, 脚本 = 'scripts/npc/大唐境内/驿站老板_洪都.lua' },
    { mid = 001110, 分类 = '普通', 外形 = 3017, 方向 = 1, 名称 = '老李', x = 239, y = 140, 脚本 = 'scripts/npc/大唐境内/老李.lua' },
    { mid = 001110, 分类 = '传送', 外形 = 3015, 方向 = 2, 名称 = '驿站老板', x = 479, y = 84, 脚本 = 'scripts/npc/大唐境内/驿站老板_江都.lua' },
    { mid = 001110, 分类 = '普通', 外形 = 2059, 方向 = 1, 名称 = '伶俐鬼', x = 619, y = 157, 脚本 = 'scripts/npc/大唐境内/伶俐鬼.lua' },
    { mid = 001110, 分类 = '普通', 外形 = 3042, 方向 = 1, 名称 = '云紫仙', x = 220, y = 53, 脚本 = 'scripts/npc/大唐境内/云紫仙.lua' },
    { mid = 001110, 分类 = '传送', 外形 = 3015, 方向 = 1, 名称 = '驿站老板', x = 14, y = 18, 脚本 = 'scripts/npc/大唐境内/驿站老板_丰都.lua' },
    { mid = 001110, 分类 = '普通', 外形 = 2077, 方向 = 1, 名称 = '刘洪', x = 519, y = 129, 脚本 = 'scripts/npc/大唐境内/长安西土地.lua' },
    { mid = 001110, 分类 = '普通', 外形 = 3070, 方向 = 1, 名称 = '长安西土地', x = 384, y = 145, 脚本 = 'scripts/npc/大唐境内/长安西土地.lua' },
    { mid = 001110, 分类 = '普通', 外形 = 3020, 方向 = 1, 名称 = '殷温娇', x = 543, y = 133, 脚本 = 'scripts/npc/大唐境内/长安西土地.lua' },
    -------------------------------------------------天宫-------------------------------------------------
    { mid = 001111, 分类 = '普通', 外形 = 3063, 方向 = 2, 名称 = '南天王', x = 13, y = 14, 脚本 = 'scripts/npc/天宫/南天王.lua' },
    { mid = 001111, 分类 = '普通', 外形 = 3063, 方向 = 1, 名称 = '神兽大将', x = 75, y = 18, 脚本 = 'scripts/npc/天宫/神兽大将.lua' },
    { mid = 001111, 分类 = '普通', 外形 = 3001, 方向 = 2, 名称 = '超级巫医', x = 67, y = 40, 脚本 = 'scripts/npc/超级巫医.lua' },
    { mid = 001111, 分类 = '任务', 外形 = 2294, 方向 = 2, 名称 = '李靖', x = 56, y = 46, 脚本 = 'scripts/npc/天宫/李靖.lua' },
    { mid = 001111, 分类 = '普通', 外形 = 2061, 方向 = 2, 名称 = '千里眼', x = 19, y = 11, 脚本 = 'scripts/npc/天宫/千里眼.lua' },
    { mid = 001111, 分类 = '普通', 外形 = 2128, 方向 = 2, 名称 = '广寒宫侍女', x = 31, y = 68, 脚本 = 'scripts/npc/天宫/广寒宫侍女.lua' },
    { mid = 001111, 分类 = '普通', 外形 = 3061, 方向 = 2, 名称 = '仙女', x = 14, y = 39, 脚本 = 'scripts/npc/天宫/仙女.lua' },
    -------------------------------------------------凌霄宝殿-------------------------------------------------
    { mid = 001112, 分类 = '普通', 外形 = 3065, 方向 = 1, 名称 = '王母娘娘', x = 84, y = 50, 脚本 = 'scripts/npc/天宫/凌霄宝殿/王母娘娘.lua' },
    { mid = 001112, 分类 = '普通', 外形 = 3064, 方向 = 0, 名称 = '二郎神', x = 39, y = 42, 脚本 = 'scripts/npc/天宫/凌霄宝殿/二郎神.lua' },
    { mid = 001112, 分类 = '普通', 外形 = 3066, 方向 = 2, 名称 = '玉皇大帝', x = 67, y = 53, 脚本 = 'scripts/npc/天宫/凌霄宝殿/玉皇大帝.lua' },
    { mid = 001112, 分类 = '普通', 外形 = 3060, 方向 = 0, 名称 = '哪吒', x = 30, y = 38, 脚本 = 'scripts/npc/天宫/凌霄宝殿/哪吒.lua' },
    -------------------------------------------------老君丹房-------------------------------------------------
    { mid = 001113, 分类 = '任务', 外形 = 0045, 方向 = 1, 名称 = '天宫掌门', x = 23, y = 10, 脚本 = 'scripts/npc/掌门/天宫掌门.lua' },
    { mid = 001113, 分类 = '普通', 外形 = 6535, 方向 = 1, 名称 = '太上老君', x = 11, y = 13, 脚本 = 'scripts/npc/师门传送.lua' },
    -------------------------------------------------天牢-------------------------------------------------
    { mid = 001115, 分类 = '普通', 外形 = 2077, 方向 = 2, 名称 = '天牢守卫', x = 27, y = 19, 脚本 = 'scripts/npc/天宫/天牢守卫.lua' },
    -------------------------------------------------龙宫-------------------------------------------------
    { mid = 001116, 分类 = '传送', 外形 = 2063, 方向 = 2, 名称 = '蟹将', x = 77, y = 16, 脚本 = 'scripts/npc/龙宫/蟹将.lua' },
    -------------------------------------------------水晶宫-------------------------------------------------
    { mid = 001117, 分类 = '任务', 外形 = 0044, 方向 = 0, 名称 = '东海龙宫掌门', x = 27, y = 11, 脚本 = 'scripts/npc/掌门/东海龙宫掌门.lua' },
    { mid = 001117, 分类 = '普通', 外形 = 3074, 方向 = 1, 名称 = '东海龙王', x = 34, y = 19, 脚本 = 'scripts/npc/龙宫/水晶宫/东海龙王.lua' },
    -------------------------------------------------海底迷宫一层-------------------------------------------------
    { mid = 001118, 分类 = '传送', 外形 = 2062, 方向 = 2, 名称 = '虾将', x = 71, y = 21, 脚本 = 'scripts/npc/龙宫/海底迷宫一层/虾将.lua' },
    -------------------------------------------------海底迷宫三层-------------------------------------------------
    { mid = 001120, 分类 = '普通', 外形 = 2017, 方向 = 2, 名称 = '千年妖尸', x = 60, y = 36, 脚本 = 'scripts/npc/龙宫/海底迷宫三层/千年妖尸.lua' },
    -------------------------------------------------海底迷宫四层-------------------------------------------------
    -- {mid = 001121, 分类 = '普通', 外形 = 2061, 方向 = 2, 名称 = '飞龙天兵', x = 24, y = 22, 脚本 = 'scripts/npc/龙宫/海底迷宫四层/飞龙天兵.lua'},
    -------------------------------------------------地府-------------------------------------------------
    { mid = 001122, 分类 = '普通', 外形 = 2051, 方向 = 1, 名称 = '孤魂野鬼', x = 89, y = 11, 脚本 = 'scripts/npc/地府/孤魂野鬼.lua' },
    { mid = 001122, 分类 = '商业', 外形 = 3001, 方向 = 2, 名称 = '超级巫医', x = 76, y = 33, 脚本 = 'scripts/npc/超级巫医.lua' },
    { mid = 001122, 分类 = '任务', 外形 = 3039, 方向 = 2, 名称 = '钟馗', 称谓 = '抓鬼任务', x = 78, y = 44, 脚本 = 'scripts/npc/地府/钟馗.lua' },
    { mid = 001122, 分类 = '任务', 外形 = 3040, 方向 = 1, 名称 = '孟婆', x = 36, y = 53, 脚本 = 'scripts/npc/地府/孟婆.lua' },
    -------------------------------------------------阎王殿-------------------------------------------------
    { mid = 001123, 分类 = '普通', 外形 = 2282, 方向 = 4, 名称 = '转轮王', x = 30, y = 17, 脚本 = 'scripts/npc/地府/阎王殿/阎罗王.lua' },
    { mid = 001123, 分类 = '普通', 外形 = 2075, 方向 = 2, 名称 = '阎罗王', x = 35, y = 20, 脚本 = 'scripts/npc/地府/阎王殿/阎罗王.lua' },
    { mid = 001123, 分类 = '普通', 外形 = 3073, 方向 = 0, 名称 = '黑无常', x = 10, y = 20, 脚本 = 'scripts/npc/地府/阎王殿/阎罗王.lua' },
    { mid = 001123, 分类 = '普通', 外形 = 2278, 方向 = 3, 名称 = '平等王', x = 45, y = 12, 脚本 = 'scripts/npc/地府/阎王殿/阎罗王.lua' },
    { mid = 001123, 分类 = '普通', 外形 = 2275, 方向 = 2, 名称 = '初江王', x = 44, y = 26, 脚本 = 'scripts/npc/地府/阎王殿/阎罗王.lua' },
    { mid = 001123, 分类 = '普通', 外形 = 2274, 方向 = 1, 名称 = '秦广王', x = 34, y = 31, 脚本 = 'scripts/npc/地府/阎王殿/阎罗王.lua' },
    { mid = 001123, 分类 = '普通', 外形 = 2280, 方向 = 4, 名称 = '都市王', x = 23, y = 13, 脚本 = 'scripts/npc/地府/阎王殿/阎罗王.lua' },
    { mid = 001123, 分类 = '普通', 外形 = 2279, 方向 = 1, 名称 = '泰山王', x = 18, y = 19, 脚本 = 'scripts/npc/地府/阎王殿/阎罗王.lua' },
    { mid = 001123, 分类 = '普通', 外形 = 2276, 方向 = 3, 名称 = '宋帝王', x = 53, y = 19, 脚本 = 'scripts/npc/地府/阎王殿/阎罗王.lua' },
    { mid = 001123, 分类 = '普通', 外形 = 2281, 方向 = 3, 名称 = '卞城王', x = 39, y = 9, 脚本 = 'scripts/npc/地府/阎王殿/阎罗王.lua' },
    { mid = 001123, 分类 = '普通', 外形 = 2277, 方向 = 1, 名称 = '杵官王', x = 27, y = 25, 脚本 = 'scripts/npc/地府/阎王殿/阎罗王.lua' },
    -------------------------------------------------阎王书房-------------------------------------------------
    { mid = 001124, 分类 = '任务', 外形 = 0042, 方向 = 1, 名称 = '地府掌门', x = 14, y = 11, 脚本 = 'scripts/npc/掌门/地府掌门.lua' },
    { mid = 001124, 分类 = '任务', 外形 = 2075, 方向 = 1, 名称 = '地藏王', x = 23, y = 15, 脚本 = 'scripts/npc/地府/阎王书房/地藏王.lua' },
    { mid = 001124, 分类 = '普通', 外形 = 3036, 方向 = 1, 名称 = '崔判官', x = 15, y = 19, 脚本 = 'scripts/npc/地府/阎王书房/崔判官.lua' },
    -------------------------------------------------轮回司-------------------------------------------------
    { mid = 001125, 分类 = '普通', 外形 = 2053, 方向 = 2, 名称 = '勾魂马面', x = 56, y = 34, 脚本 = 'scripts/npc/地府/轮回司/勾魂马面.lua' },
    { mid = 001125, 分类 = '传送', 外形 = 3058, 方向 = 1, 名称 = '白无常', x = 40, y = 24, 脚本 = 'scripts/npc/地府/轮回司/白无常.lua' },
    -------------------------------------------------地狱迷宫二层-------------------------------------------------
    { mid = 001127, 分类 = '普通', 外形 = 2052, 方向 = 0, 名称 = '牛头', x = 37, y = 21, 脚本 = 'scripts/npc/地府/地狱迷宫2层/牛头.lua' },
    { mid = 001127, 分类 = '普通', 外形 = 2072, 方向 = 0, 名称 = '绝地魔', x = 22, y = 23, 脚本 = 'scripts/npc/地府/地狱迷宫2层/绝地魔.lua' },
    -------------------------------------------------地狱迷宫四层-------------------------------------------------
    { mid = 001128, 分类 = '普通', 外形 = 2053, 方向 = 0, 名称 = '马面', x = 4, y = 20, 脚本 = 'scripts/npc/地府/地狱迷宫4层/马面.lua' },
    -------------------------------------------------地狱迷宫三层-------------------------------------------------
    { mid = 001130, 分类 = '普通', 外形 = 2055, 方向 = 0, 名称 = '金银铜铁鬼', x = 50, y = 17, 脚本 = 'scripts/npc/地府/地狱迷宫三层/金银铜铁鬼.lua' },
    -------------------------------------------------狮驼岭-------------------------------------------------
    { mid = 001131, 分类 = '普通', 外形 = 2052, 方向 = 2, 名称 = '疯牛怪', x = 54, y = 4, 脚本 = 'scripts/npc/大唐边境/狮驼岭/疯牛怪.lua' },
    { mid = 001131, 分类 = '普通', 外形 = 2025, 方向 = 2, 名称 = '引路小妖', x = 28, y = 6, 脚本 = 'scripts/npc/大唐边境/狮驼岭/引路小妖.lua' },
    { mid = 001131, 分类 = '传送', 外形 = 3079, 方向 = 2, 名称 = '车夫', x = 41, y = 10, 脚本 = 'scripts/npc/大唐边境/狮驼岭/车夫.lua' },
    { mid = 001131, 分类 = '普通', 外形 = 2022, 方向 = 2, 名称 = '蛤蟆精', x = 37, y = 29, 脚本 = 'scripts/npc/大唐边境/狮驼岭/蛤蟆精.lua' },
    { mid = 001131, 分类 = '普通', 外形 = 2090, 方向 = 2, 名称 = '孙空悟', x = 93, y = 33, 脚本 = 'scripts/npc/大唐边境/狮驼岭/孙空悟.lua' },
    { mid = 001131, 分类 = '普通', 外形 = 2089, 方向 = 1, 名称 = '多头神魔', x = 18, y = 23, 脚本 = 'scripts/npc/大唐边境/狮驼岭/多头神魔.lua' },
    { mid = 001131, 分类 = '普通', 外形 = 3068, 方向 = 1, 名称 = '山神', x = 5, y = 31, 脚本 = 'scripts/npc/大唐边境/狮驼岭/山神.lua' },
    { mid = 001131, 分类 = '普通', 外形 = 2023, 方向 = 2, 名称 = '雷鸟精', x = 9, y = 8, 脚本 = 'scripts/npc/大唐边境/狮驼岭/雷鸟精.lua' },
    -------------------------------------------------白象洞-------------------------------------------------
    { mid = 001132, 分类 = '普通', 外形 = 3053, 方向 = 0, 名称 = '二大王', x = 33, y = 16, 脚本 = 'scripts/npc/大唐边境/狮驼岭/白象洞/二大王.lua' },
    -------------------------------------------------老雕洞-------------------------------------------------
    { mid = 001133, 分类 = '普通', 外形 = 3057, 方向 = 0, 名称 = '三大王', x = 26, y = 13, 脚本 = 'scripts/npc/大唐边境/狮驼岭/老雕洞/三大王.lua' },
    -------------------------------------------------狮子洞-------------------------------------------------
    { mid = 001134, 分类 = '普通', 外形 = 3052, 方向 = 2, 名称 = '大大王', x = 31, y = 15, 脚本 = 'scripts/npc/师门传送.lua' },
    { mid = 001134, 分类 = '任务', 外形 = 0052, 方向 = 0, 名称 = '狮驼岭掌门', x = 17, y = 16, 脚本 = 'scripts/npc/掌门/狮驼岭掌门.lua' },
    -------------------------------------------------方寸山-------------------------------------------------
    { mid = 001135, 分类 = '普通', 外形 = 3024, 方向 = 0, 名称 = '张三', x = 87, y = 40, 脚本 = 'scripts/npc/长寿村/方寸山/张三.lua' },
    { mid = 001135, 分类 = '普通', 外形 = 3045, 方向 = 0, 名称 = '游方术士', x = 28, y = 37, 脚本 = 'scripts/npc/长寿村/方寸山/游方术士.lua' },
    { mid = 001135, 分类 = '普通', 外形 = 3045, 方向 = 0, 名称 = '道士', x = 35, y = 13, 脚本 = 'scripts/npc/长寿村/方寸山/道士.lua' },
    { mid = 001135, 分类 = '传送', 外形 = 3045, 方向 = 1, 名称 = '崂三', x = 11, y = 15, 脚本 = 'scripts/npc/长寿村/方寸山/崂三.lua' },
    -------------------------------------------------方寸后山-------------------------------------------------
    { mid = 001136, 分类 = '普通', 外形 = 7467, 方向 = 0, 名称 = '彩衣', x = 47, y = 51, 脚本 = 'scripts/npc/长寿村/方寸山/方寸后山/彩衣.lua' },
    { mid = 001136, 分类 = '普通', 外形 = 3026, 方向 = 0, 名称 = '陈百万', x = 51, y = 28, 脚本 = 'scripts/npc/长寿村/方寸山/方寸后山/陈百万.lua' },
    -------------------------------------------------方寸大殿-------------------------------------------------
    { mid = 001137, 分类 = '任务', 外形 = 0041, 方向 = 1, 名称 = '方寸山掌门', x = 15, y = 14, 脚本 = 'scripts/npc/掌门/方寸山掌门.lua' },
    { mid = 001137, 分类 = '普通', 外形 = 3043, 方向 = 1, 名称 = '菩提祖师', x = 21, y = 13, 脚本 = 'scripts/npc/师门传送.lua' },
    -------------------------------------------------普陀山-------------------------------------------------
    { mid = 001140, 分类 = '传送', 外形 = 3061, 方向 = 1, 名称 = '引路仙子', x = 20, y = 15, 脚本 = 'scripts/npc/大唐边境/普陀山/引路仙子.lua' },
    { mid = 001140, 分类 = '普通', 外形 = 2059, 方向 = 0, 名称 = '玉狐仙', x = 29, y = 18, 脚本 = 'scripts/npc/大唐边境/普陀山/玉狐仙.lua' },
    { mid = 001140, 分类 = '普通', 外形 = 3020, 方向 = 0, 名称 = '黄夫人', x = 40, y = 53, 脚本 = 'scripts/npc/大唐边境/普陀山/黄夫人.lua' },
    { mid = 001140, 分类 = '普通', 外形 = 3061, 方向 = 0, 名称 = '小仙女', x = 96, y = 71, 脚本 = 'scripts/npc/大唐边境/普陀山/小仙女.lua' },
    -------------------------------------------------潮音洞-------------------------------------------------
    { mid = 001141, 分类 = '普通', 外形 = 3059, 方向 = 2, 名称 = '观音姐姐', x = 33, y = 29, 脚本 = 'scripts/npc/大唐边境/普陀山/潮音洞/观音姐姐.lua' },
    { mid = 001141, 分类 = '任务', 外形 = 0055, 方向 = 2, 名称 = '普陀山掌门', x = 28, y = 23, 脚本 = 'scripts/npc/掌门/普陀山掌门.lua' },
    { mid = 001141, 分类 = '普通', 外形 = 2128, 方向 = 2, 名称 = '善财龙女', x = 23, y = 26, 脚本 = 'scripts/npc/大唐边境/普陀山/潮音洞/善财龙女.lua' },
    { mid = 001141, 分类 = '普通', 外形 = 0046, 方向 = 2, 名称 = '善财童子', x = 32, y = 20, 脚本 = 'scripts/npc/大唐边境/普陀山/潮音洞/善财童子.lua' },
    { mid = 001141, 分类 = '普通', 外形 = 3061, 方向 = 1, 名称 = '仙女姐姐', x = 22, y = 15, 脚本 = 'scripts/npc/大唐边境/普陀山/潮音洞/仙女姐姐.lua' },
    -------------------------------------------------孙婆婆家-------------------------------------------------
    { mid = 001143, 分类 = '普通', 外形 = 3069, 方向 = 1, 名称 = '孙婆婆', x = 18, y = 7, 脚本 = 'scripts/npc/师门传送.lua' },
    { mid = 001143, 分类 = '任务', 外形 = 0128, 方向 = 0, 名称 = '女儿村掌门', x = 11, y = 9, 脚本 = 'scripts/npc/掌门/女儿村掌门.lua' },
    -------------------------------------------------盘丝洞-------------------------------------------------
    { mid = 001144, 分类 = '普通', 外形 = 2067, 方向 = 2, 名称 = '青霞', x = 17, y = 10, 脚本 = 'scripts/npc/师门传送.lua' },
    { mid = 001144, 分类 = '任务', 外形 = 0053, 方向 = 0, 名称 = '盘丝洞掌门', x = 10, y = 15, 脚本 = 'scripts/npc/掌门/盘丝洞掌门.lua' },
    -------------------------------------------------魔王寨-------------------------------------------------
    { mid = 001145, 分类 = '普通', 外形 = 2081, 方向 = 2, 名称 = '牛魔王', x = 28, y = 17, 脚本 = 'scripts/npc/师门传送.lua' },
    { mid = 001145, 分类 = '任务', 外形 = 0043, 方向 = 0, 名称 = '魔王寨掌门', x = 21, y = 16, 脚本 = 'scripts/npc/掌门/魔王寨掌门.lua' },
    -------------------------------------------------五庄观-------------------------------------------------
    { mid = 001146, 分类 = '普通', 外形 = 3044, 方向 = 1, 名称 = '清风', x = 75, y = 67, 脚本 = 'scripts/npc/大唐边境/五庄观/清风.lua' },
    { mid = 001146, 分类 = '普通', 外形 = 3070, 方向 = 0, 名称 = '人参果园土地', x = 6, y = 55, 脚本 = 'scripts/npc/大唐边境/五庄观/人参果园土地.lua' },
    { mid = 001146, 分类 = '传送', 外形 = 3046, 方向 = 1, 名称 = '五庄道姑', x = 7, y = 4, 脚本 = 'scripts/npc/大唐边境/五庄观/道姑.lua' },
    { mid = 001146, 分类 = '普通', 外形 = 3044, 方向 = 3, 名称 = '明月', x = 81, y = 63, 脚本 = 'scripts/npc/大唐边境/五庄观/明月.lua' },
    { mid = 001146, 分类 = '普通', 外形 = 2177, 方向 = 0, 名称 = '赵香炉', x = 34, y = 25, 脚本 = 'scripts/npc/大唐边境/五庄观/赵香炉.lua' },
    -------------------------------------------------五庄观大殿-------------------------------------------------
    { mid = 001147, 分类 = '任务', 外形 = 0054, 方向 = 0, 名称 = '五庄观掌门', x = 15, y = 15, 脚本 = 'scripts/npc/掌门/五庄观掌门.lua' },
    { mid = 001147, 分类 = '普通', 外形 = 3062, 方向 = 1, 名称 = '镇元大仙', x = 23, y = 18, 脚本 = 'scripts/npc/师门传送.lua' },
    -------------------------------------------------人参果员-------------------------------------------------
    { mid = 101379, 分类 = '普通', 外形 = 3107, 方向 = 1, 名称 = '人参果树', x = 29, y = 34, 脚本 = 'scripts/npc/大唐边境/五庄观/人参果树.lua' },

    -------------------------------------------------金山寺大殿-------------------------------------------------
    { mid = 001153, 分类 = '普通', 外形 = 3047, 方向 = 1, 名称 = '法明方丈', x = 16, y = 17, 脚本 = 'scripts/npc/大唐境内/金山寺大殿/法明方丈.lua' },
    { mid = 001153, 分类 = '普通', 外形 = 3031, 方向 = 3, 名称 = '晦明禅师', x = 29, y = 10, 脚本 = 'scripts/npc/大唐境内/金山寺大殿/晦明禅师.lua' },
    -------------------------------------------------野外山洞-------------------------------------------------
    { mid = 001160, 分类 = '普通', 外形 = 2018, 方向 = 1, 名称 = '食婴鬼', x = 22, y = 12, 脚本 = 'scripts/npc/大唐境内/野外山洞/食婴鬼.lua' },
    -------------------------------------------------高老庄大厅-------------------------------------------------
    { mid = 001170, 分类 = '普通', 外形 = 3027, 方向 = 1, 名称 = '高老先生', x = 23, y = 27, 脚本 = 'scripts/npc/大唐边境/高老庄厅/高老先生.lua' },
    -------------------------------------------------民居 -------------------------------------------------
    { mid = 001171, 分类 = '普通', 外形 = 3061, 方向 = 1, 名称 = '高小姐', x = 20, y = 7, 脚本 = 'scripts/npc/大唐边境/高小姐房/高小姐.lua' },
    -------------------------------------------------大唐边境------------------------------------------------
    { mid = 001173, 分类 = '普通', 外形 = 2092, 方向 = 1, 名称 = '沙和尚', x = 131, y = 222, 脚本 = 'scripts/npc/大唐边境/沙和尚.lua' },
    { mid = 001173, 分类 = '普通', 外形 = 2074, 方向 = 0, 名称 = '摄魂鬼', x = 506, y = 33, 脚本 = 'scripts/npc/大唐边境/摄魂鬼.lua' },
    { mid = 001173, 分类 = '传送', 外形 = 2023, 方向 = 1, 名称 = '怪鸟精', x = 454, y = 9, 脚本 = 'scripts/npc/大唐边境/怪鸟精.lua' },
    { mid = 001173, 分类 = '传送', 外形 = 2066, 方向 = 1, 名称 = '老牛怪', x = 610, y = 40, 脚本 = 'scripts/npc/大唐边境/老牛怪.lua' },
    { mid = 001173, 分类 = '普通', 外形 = 2079, 方向 = 1, 名称 = '春三十娘', x = 395, y = 204, 脚本 = 'scripts/npc/大唐边境/春三十娘.lua' },
    { mid = 001173, 分类 = '普通', 外形 = 3004, 方向 = 1, 名称 = '幸存者', x = 200, y = 288, 脚本 = 'scripts/npc/大唐边境/幸存者.lua' },
    { mid = 001173, 分类 = '传送', 外形 = 3056, 方向 = 1, 名称 = '老神仙', x = 36, y = 25, 脚本 = 'scripts/npc/大唐边境/老神仙.lua' },
    { mid = 001173, 分类 = '传送', 外形 = 3061, 方向 = 1, 名称 = '接引仙子', x = 72, y = 10, 脚本 = 'scripts/npc/大唐边境/接引仙子.lua' },
    { mid = 001173, 分类 = '普通', 外形 = 2066, 方向 = 1, 名称 = '牛妖', x = 606, y = 215, 脚本 = 'scripts/npc/大唐边境/牛妖.lua' },
    { mid = 001173, 分类 = '普通', 外形 = 3011, 方向 = 1, 名称 = '武者', x = 245, y = 266, 脚本 = 'scripts/npc/大唐边境/武者.lua' },
    { mid = 001173, 分类 = '普通', 外形 = 3011, 方向 = 1, 名称 = '修行武者', x = 54, y = 342, 脚本 = 'scripts/npc/大唐边境/修行武者.lua' },
    { mid = 001173, 分类 = '普通', 外形 = 2042, 方向 = 4, 名称 = '千年巨鳄', x = 52, y = 330, 脚本 = 'scripts/npc/大唐边境/千年巨鳄.lua' },
    { mid = 001173, 分类 = '传送', 外形 = 3046, 方向 = 1, 名称 = '五庄道姑', x = 180, y = 10, 脚本 = 'scripts/npc/大唐边境/五庄道姑.lua' },
    { mid = 001173, 分类 = '普通', 外形 = 2023, 方向 = 1, 名称 = '雷鸟', x = 600, y = 210, 脚本 = 'scripts/npc/大唐边境/雷鸟.lua' },
    { mid = 001173, 分类 = '传送', 外形 = 3079, 方向 = 1, 名称 = '车夫', x = 174, y = 152, 脚本 = 'scripts/npc/大唐边境/车夫.lua' },
    { mid = 001173, 分类 = '传送', 外形 = 3015, 方向 = 2, 名称 = '驿站老板', x = 562, y = 321, 脚本 = 'scripts/npc/大唐边境/驿站老板.lua' },
    { mid = 001173, 分类 = '传送', 外形 = 3024, 方向 = 1, 名称 = '渡河船夫', x = 141, y = 113, 脚本 = 'scripts/npc/大唐边境/渡河船夫.lua' },
    { mid = 001173, 分类 = '普通', 外形 = 0001, 方向 = 2, 名称 = '逍遥仙', x = 454, y = 157, 脚本 = 'scripts/npc/大唐边境/逍遥仙.lua' },
    { mid = 001173, 分类 = '普通', 外形 = 2091, 方向 = 2, 名称 = '猪八戒', x = 256, y = 326, 脚本 = 'scripts/npc/大唐边境/猪八戒.lua' },
    -------------------------------------------------北俱芦洲-------------------------------------------------
    { mid = 001174, 分类 = '普通', 外形 = 3012, 方向 = 0, 名称 = '沙铁匠', x = 137, y = 142, 脚本 = 'scripts/npc/北俱芦洲/沙铁匠.lua' },
    { mid = 001174, 分类 = '传送', 外形 = 3015, 方向 = 1, 名称 = '驿站老板', x = 128, y = 105, 脚本 = 'scripts/npc/北俱芦洲/驿站老板.lua' },
    { mid = 001174, 分类 = '普通', 外形 = 2024, 方向 = 0, 名称 = '龙女', x = 115, y = 30, 脚本 = 'scripts/npc/北俱芦洲/龙女.lua' },
    { mid = 001174, 分类 = '普通', 外形 = 3027, 方向 = 0, 名称 = '钱二', x = 15, y = 145, 脚本 = 'scripts/npc/北俱芦洲/钱二.lua' },
    { mid = 001174, 分类 = '普通', 外形 = 3024, 方向 = 0, 名称 = '赵大', x = 17, y = 158, 脚本 = 'scripts/npc/北俱芦洲/赵大.lua' },
    { mid = 001174, 分类 = '传送', 外形 = 3079, 方向 = 1, 名称 = '车夫', x = 48, y = 42, 脚本 = 'scripts/npc/北俱芦洲/车夫.lua' },
    { mid = 001174, 分类 = '普通', 外形 = 3057, 方向 = 0, 名称 = '阴森古怪', x = 39, y = 9, 脚本 = 'scripts/npc/北俱芦洲/阴森古怪.lua' },
    { mid = 001174, 分类 = '普通', 外形 = 2075, 方向 = 0, 名称 = '幽冥地鬼', x = 47, y = 134, 脚本 = 'scripts/npc/北俱芦洲/幽冥地鬼.lua' },
    { mid = 001174, 分类 = '普通', 外形 = 3070, 方向 = 0, 名称 = '北俱芦洲土地', x = 114, y = 93, 脚本 = 'scripts/npc/北俱芦洲/北俱芦洲土地.lua' },
    { mid = 001174, 分类 = '普通', 外形 = 2088, 方向 = 2, 名称 = '翻天鬼', x = 76, y = 129, 脚本 = 'scripts/npc/北俱芦洲/翻天鬼.lua' },
    { mid = 001174, 分类 = '普通', 外形 = 7467, 方向 = 0, 名称 = '彩翼仙子', x = 203, y = 25, 脚本 = 'scripts/npc/北俱芦洲/彩翼仙子.lua' },
    { mid = 001174, 分类 = '普通', 外形 = 2072, 方向 = 0, 名称 = '冰风怪', x = 209, y = 149, 脚本 = 'scripts/npc/北俱芦洲/冰风怪.lua' },
    -------------------------------------------------冰窟-------------------------------------------------
    { mid = 101176, 分类 = '传送', 外形 = 2040, 方向 = 1, 名称 = '冰熊守卫', x = 23, y = 19, 脚本 = 'scripts/npc/北俱芦洲/冰窟/冰熊守卫.lua' },
    -------------------------------------------------龙窟四层-------------------------------------------------
    { mid = 001180, 分类 = '普通', 外形 = 2088, 方向 = 0, 名称 = '天一神将', x = 53, y = 44, 脚本 = 'scripts/npc/北俱芦洲/龙窟四层/天一神将.lua' },
    -------------------------------------------------龙窟六层-------------------------------------------------
    { mid = 001182, 分类 = '普通', 外形 = 2065, 方向 = 1, 名称 = '断情蛛', x = 34, y = 63, 脚本 = 'scripts/npc/北俱芦洲/龙窟六层/断情蛛.lua' },
    -------------------------------------------------龙窟七层-------------------------------------------------
    { mid = 001183, 分类 = '普通', 外形 = 2090, 方向 = 0, 名称 = '孙悟空', x = 30, y = 54, 脚本 = 'scripts/npc/北俱芦洲/龙窟七层/孙悟空.lua' },
    -------------------------------------------------凤巢一层-------------------------------------------------
    { mid = 001186, 分类 = '普通', 外形 = 2071, 方向 = 3, 名称 = '炎之凤', x = 34, y = 38, 脚本 = 'scripts/npc/北俱芦洲/凤巢一层/炎之凤.lua' },
    -------------------------------------------------凤巢五层-------------------------------------------------
    { mid = 001190, 分类 = '普通', 外形 = 2090, 方向 = 0, 名称 = '悟孙空', x = 43, y = 55, 脚本 = 'scripts/npc/北俱芦洲/凤巢五层/孙悟空.lua' },
    -------------------------------------------------凤巢六层-------------------------------------------------
    { mid = 001191, 分类 = '普通', 外形 = 2074, 方向 = 0, 名称 = '天之战神', x = 42, y = 58, 脚本 = 'scripts/npc/北俱芦洲/凤巢六层/天之战神.lua' },
    { mid = 001191, 分类 = '普通', 外形 = 2074, 方向 = 0, 名称 = '人之战神', x = 7, y = 38, 脚本 = 'scripts/npc/北俱芦洲/凤巢六层/人之战神.lua' },
    { mid = 001191, 分类 = '普通', 外形 = 2074, 方向 = 0, 名称 = '地之战神', x = 22, y = 47, 脚本 = 'scripts/npc/北俱芦洲/凤巢六层/地之战神.lua' },
    -------------------------------------------------凤巢七层-------------------------------------------------
    { mid = 001192, 分类 = '普通', 外形 = 2080, 方向 = 1, 名称 = '小白', x = 115, y = 61, 脚本 = 'scripts/npc/北俱芦洲/凤巢七层/小白.lua' },
    { mid = 001192, 分类 = '普通', 外形 = 2004, 方向 = 1, 名称 = '无名小妖', x = 20, y = 40, 脚本 = 'scripts/npc/北俱芦洲/凤巢七层/无名小妖.lua' },
    -------------------------------------------------长安城东-------------------------------------------------
    { mid = 001193, 分类 = '传送', 外形 = 2062, 方向 = 2, 名称 = '虾兵', x = 308, y = 154, 脚本 = 'scripts/npc/长安/长安城东/虾兵.lua' },
    { mid = 001193, 分类 = '传送', 外形 = 3165, 方向 = 1, 名称 = '渔夫', x = 297, y = 183, 脚本 = 'scripts/npc/长安/长安城东/渔夫.lua' },
    { mid = 001193, 分类 = '传送', 外形 = 3061, 方向 = 2, 名称 = '鸿雁仙子', x = 146, y = 146, 脚本 = 'scripts/npc/长安/长安城东/鸿雁仙子.lua' },
    { mid = 001193, 分类 = '普通', 外形 = 2017, 方向 = 1, 名称 = '食婴鬼的手下', x = 172, y = 221, 脚本 = 'scripts/npc/长安/长安城东/食婴鬼的手下.lua' },
    { mid = 001193, 分类 = '普通', 外形 = 2017, 方向 = 1, 名称 = '食婴鬼手下的手下', x = 148, y = 215, 脚本 = 'scripts/npc/长安/长安城东/食婴鬼手下的手下.lua' },
    { mid = 001193, 分类 = '传送', 外形 = 3061, 方向 = 1, 名称 = '香花仙子', x = 47, y = 113, 脚本 = 'scripts/npc/长安/长安城东/香花仙子.lua' },
    { mid = 001193, 分类 = '普通', 外形 = 3061, 方向 = 1, 名称 = '梅花仙', x = 106, y = 226, 脚本 = 'scripts/npc/长安/长安城东/梅花仙.lua' },
    { mid = 001193, 分类 = '任务', 外形 = 2184, 方向 = 1, 名称 = '李白', x = 161, y = 142, 脚本 = 'scripts/npc/长安/长安城东/李白.lua' },
    { mid = 001193, 分类 = '普通', 外形 = 3018, 方向 = 1, 名称 = '老贾', x = 46, y = 215, 脚本 = 'scripts/npc/长安/长安城东/老贾.lua' },
    -------------------------------------------------五指山-------------------------------------------------
    { mid = 001194, 分类 = '普通', 外形 = 3070, 方向 = 1, 名称 = '五指山土地', x = 253, y = 48, 脚本 = 'scripts/npc/大唐边境/五指山/五指山土地.lua' },
    { mid = 001194, 分类 = '普通', 外形 = 3011, 方向 = 1, 名称 = '苦行者', x = 162, y = 3, 脚本 = 'scripts/npc/大唐边境/五指山/苦行者.lua' },
    { mid = 001194, 分类 = '普通', 外形 = 2080, 方向 = 0, 名称 = '晶晶姑娘', x = 59, y = 83, 脚本 = 'scripts/npc/大唐边境/五指山/晶晶姑娘.lua' },
    { mid = 001194, 分类 = '普通', 外形 = 3072, 方向 = 0, 名称 = '老猴精', x = 27, y = 29, 脚本 = 'scripts/npc/大唐边境/五指山/老猴精.lua' },
    { mid = 001194, 分类 = '普通', 外形 = 2048, 方向 = 0, 名称 = '莽汉', x = 88, y = 30, 脚本 = 'scripts/npc/大唐边境/五指山/莽汉.lua' },
    { mid = 001194, 分类 = '普通', 外形 = 2025, 方向 = 1, 名称 = '山妖', x = 320, y = 34, 脚本 = 'scripts/npc/大唐边境/五指山/山妖.lua' },
    { mid = 001194, 分类 = '普通', 外形 = 3063, 方向 = 0, 名称 = '斩妖将', x = 26, y = 88, 脚本 = 'scripts/npc/大唐边境/五指山/斩妖将.lua' },
    -------------------------------------------------66734-------------------------------------------------
    { mid = 001198, 分类 = '普通', 外形 = 2061, 方向 = 1, 名称 = '神兵', x = 37, y = 36, 脚本 = 'scripts/npc/天宫/蟠桃园/神兵.lua' },
    { mid = 001198, 分类 = '传送', 外形 = 3079, 方向 = 2, 名称 = '车夫', x = 51, y = 41, 脚本 = 'scripts/npc/天宫/蟠桃园/车夫.lua' },
    { mid = 001198, 分类 = '普通', 外形 = 3070, 方向 = 1, 名称 = '蟠桃园土地', x = 47, y = 49, 脚本 = 'scripts/npc/天宫/蟠桃园/蟠桃园土地.lua' },
    -- { mid = 001198, 分类 = '普通', 外形 = 3063, 方向 = 1, 名称 = '护园大将', x = 43, y = 43, 脚本 = 'scripts/npc/天宫/蟠桃园/护园大将.lua' },
    -------------------------------------------------御马监-------------------------------------------------
    { mid = 001199, 分类 = '任务', 外形 = 2026, 方向 = 2, 名称 = '蓝色妖王', x = 180, y = 100, 脚本 = 'scripts/npc/天宫/御马监/蓝色妖王.lua' },
    { mid = 001199, 分类 = '任务', 外形 = 2073, 方向 = 2, 名称 = '黑山妖王', x = 150, y = 150, 脚本 = 'scripts/npc/天宫/御马监/黑山妖王.lua' },
    { mid = 001199, 分类 = '任务', 外形 = 2006, 方向 = 2, 名称 = '万年熊王', x = 180, y = 10, 脚本 = 'scripts/npc/天宫/御马监/万年熊王.lua' },
    { mid = 001199, 分类 = '普通', 外形 = 0046, 方向 = 2, 名称 = '小马仙', x = 90, y = 55, 脚本 = 'scripts/npc/天宫/御马监/小马仙.lua' },
    { mid = 001199, 分类 = '普通', 外形 = 3061, 方向 = 2, 名称 = '采星仙女', x = 50, y = 131, 脚本 = 'scripts/npc/天宫/御马监/采星仙女.lua' },
    { mid = 001199, 分类 = '普通', 外形 = 3026, 方向 = 2, 名称 = '司马小仙', x = 29, y = 153, 脚本 = 'scripts/npc/天宫/御马监/司马小仙.lua' },
    { mid = 001199, 分类 = '普通', 外形 = 3068, 方向 = 2, 名称 = '督监神将', x = 36, y = 72, 脚本 = 'scripts/npc/天宫/御马监/督监神将.lua' },
    { mid = 001199, 分类 = '任务', 外形 = 2074, 方向 = 2, 名称 = '三头妖王', x = 10, y = 100, 脚本 = 'scripts/npc/天宫/御马监/三头妖王.lua' },
    { mid = 001199, 分类 = '普通', 外形 = 2027, 方向 = 2, 名称 = '御马死灵', x = 22, y = 26, 脚本 = 'scripts/npc/天宫/御马监/御马死灵.lua' },
    { mid = 001199, 分类 = '普通', 外形 = 2291, 方向 = 2, 名称 = '御马女娲', x = 132, y = 30, 脚本 = 'scripts/npc/天宫/御马监/御马女娲.lua' },
    { mid = 001199, 分类 = '普通', 外形 = 2060, 方向 = 2, 名称 = '御马猴精', x = 81, y = 4, 脚本 = 'scripts/npc/天宫/御马监/御马猴精.lua' },
    { mid = 001199, 分类 = '任务', 外形 = 7527, 方向 = 1, 名称 = '孙悟空', x = 65, y = 117, 脚本 = 'scripts/npc/天宫/御马监/孙悟空.lua' },
    -------------------------------------------------御马监察所-------------------------------------------------
    { mid = 001200, 分类 = '普通', 外形 = 3024, 方向 = 2, 名称 = '弼马温', x = 17, y = 8, 脚本 = 'scripts/npc/天宫/御马监察所/弼马温.lua' },
    -------------------------------------------------斧头帮-------------------------------------------------
    { mid = 001203, 分类 = '普通', 外形 = 3024, 方向 = 0, 名称 = '二当家', x = 69, y = 84, 脚本 = 'scripts/npc/大唐边境/斧头帮/二当家.lua' },
    { mid = 001203, 分类 = '普通', 外形 = 2038, 方向 = 0, 名称 = '白虎', x = 16, y = 123, 脚本 = 'scripts/npc/大唐边境/斧头帮/白虎.lua' },
    { mid = 001203, 分类 = '普通', 外形 = 2044, 方向 = 0, 名称 = '三当家', x = 56, y = 70, 脚本 = 'scripts/npc/大唐边境/斧头帮/三当家.lua' },
    { mid = 001203, 分类 = '普通', 外形 = 0001, 方向 = 0, 名称 = '白衣文士', x = 93, y = 20, 脚本 = 'scripts/npc/大唐边境/斧头帮/白衣文士.lua' },
    -------------------------------------------------帮主住房-------------------------------------------------
    { mid = 001206, 分类 = '普通', 外形 = 3054, 方向 = 0, 名称 = '至尊小宝', x = 18, y = 7, 脚本 = 'scripts/npc/大唐边境/斧头帮/至尊小宝.lua' },
    -------------------------------------------------东海渔村-------------------------------------------------
    { mid = 001208, 分类 = '普通', 外形 = 3061, 方向 = 2, 名称 = '宠物领养员', x = 87, y = 108, 脚本 = 'scripts/npc/东海渔村/宠物领养员.lua' },
    { mid = 001208, 分类 = '普通', 外形 = 2082, 方向 = 2, 名称 = '御武盟盟主', x = 54, y = 129, 脚本 = 'scripts/npc/东海渔村/御武盟盟主.lua' },
    { mid = 001208, 分类 = '普通', 外形 = 3011, 方向 = 2, 名称 = '法术指导员', x = 77, y = 120, 脚本 = 'scripts/npc/东海渔村/法术指导员.lua' },
    -- {mid = 001208, 分类 = '普通', 外形 = 2053, 方向 = 2, 名称 = '马面', x = 138, y = 51, 脚本 = 'scripts/npc/东海渔村/马面.lua'},
    { mid = 001208, 分类 = '传送', 外形 = 3165, 方向 = 1, 名称 = '渔夫', x = 21, y = 48, 脚本 = 'scripts/npc/东海渔村/渔夫.lua' },
    { mid = 001208, 分类 = '普通', 外形 = 3034, 方向 = 2, 名称 = '乞丐', x = 88, y = 73, 脚本 = 'scripts/npc/东海渔村/乞丐.lua' },
    { mid = 001208, 分类 = '普通', 外形 = 3166, 方向 = 2, 名称 = '樵夫', x = 56, y = 40, 脚本 = 'scripts/npc/东海渔村/樵夫.lua' },
    { mid = 001208, 分类 = '普通', 外形 = 3043, 方向 = 1, 名称 = '天赎星君', x = 58, y = 111, 脚本 = 'scripts/npc/东海渔村/天赎星君.lua' },
    { mid = 001208, 分类 = '普通', 外形 = 3002, 方向 = 2, 名称 = '江湖郎中', x = 83, y = 90, 脚本 = 'scripts/npc/东海渔村/江湖郎中.lua' },
    { mid = 001208, 分类 = '普通', 外形 = 3050, 方向 = 2, 名称 = '情花仙子', x = 66, y = 125, 脚本 = 'scripts/npc/东海渔村/情花仙子.lua' },
    { mid = 001208, 分类 = '普通', 外形 = 3051, 方向 = 1, 名称 = '渔村村长', x = 38, y = 118, 脚本 = 'scripts/npc/东海渔村/渔村村长.lua' },
    { mid = 001208, 分类 = '任务', 外形 = 3035, 方向 = 1, 名称 = '赈灾官员', x = 64, y = 46, 脚本 = 'scripts/npc/长安/赈灾官员.lua' },
    { mid = 001208, 分类 = '普通', 外形 = 3035, 方向 = 1, 名称 = '推广奖励领取人', x = 55, y = 119, 脚本 = 'scripts/npc/东海渔村/推广奖励领取人.lua' },

    -------------------------------------------------草药店-------------------------------------------------
    { mid = 001210, 分类 = '商业', 外形 = 3002, 方向 = 2, 名称 = '药店老板', x = 16, y = 9, 脚本 = 'scripts/npc/东海渔村/草药店/药店老板.lua' },
    -------------------------------------------------武器店-------------------------------------------------
    { mid = 001211, 分类 = '商业', 外形 = 3003, 方向 = 1, 名称 = '武器店老板', x = 23, y = 19, 脚本 = 'scripts/npc/东海渔村/武器店/武器店老板.lua' },
    { mid = 011074, 分类 = '商业', 外形 = 3010, 方向 = 0, 名称 = '服装店老板', x = 17, y = 11, 脚本 = 'scripts/npc/东海渔村/服装店/服装店老板.lua' },
    -------------------------------------------------珊瑚海岛-------------------------------------------------
    { mid = 001213, 分类 = '普通', 外形 = 3011, 方向 = 2, 名称 = '五老黑', x = 54, y = 124, 脚本 = 'scripts/npc/东海渔村/珊瑚海岛/五老黑.lua' },
    -------------------------------------------------海岛洞窟一层-------------------------------------------------
    { mid = 001214, 分类 = '普通', 外形 = 2055, 方向 = 2, 名称 = '逃跑的野鬼', x = 146, y = 24, 脚本 = 'scripts/npc/东海渔村/海岛洞窟一层/逃跑的野鬼.lua' },
    -------------------------------------------------海岛洞窟二层-------------------------------------------------
    { mid = 001215, 分类 = '普通', 外形 = 2054, 方向 = 2, 名称 = '逃跑的野鬼', x = 69, y = 60, 脚本 = 'scripts/npc/东海渔村/海岛洞窟二层/逃跑的野鬼.lua' },
    -------------------------------------------------海岛洞窟三层-------------------------------------------------
    { mid = 001216, 分类 = '普通', 外形 = 2051, 方向 = 2, 名称 = '逃跑的野鬼', x = 147, y = 55, 脚本 = 'scripts/npc/东海渔村/海岛洞窟三层/逃跑的野鬼.lua' },
    -------------------------------------------------蟠桃园后-------------------------------------------------
    { mid = 001217, 分类 = '普通', 外形 = 2068, 方向 = 0, 名称 = '蟠桃神灵', x = 39, y = 82, 脚本 = 'scripts/npc/天宫/蟠桃园后/蟠桃神灵.lua' },
    { mid = 001217, 分类 = '普通', 外形 = 2025, 方向 = 0, 名称 = '野山妖', x = 18, y = 178, 脚本 = 'scripts/npc/天宫/蟠桃园后/野山妖.lua' },
    { mid = 001217, 分类 = '普通', 外形 = 2071, 方向 = 2, 名称 = '蟠桃凤凰', x = 29, y = 37, 脚本 = 'scripts/npc/天宫/蟠桃园后/蟠桃凤凰.lua' },
    { mid = 001217, 分类 = '普通', 外形 = 2096, 方向 = 1, 名称 = '桃花仙', x = 87, y = 136, 脚本 = 'scripts/npc/天宫/蟠桃园后/桃花仙.lua' },
    { mid = 001217, 分类 = '普通', 外形 = 3109, 方向 = 0, 名称 = '花苗', x = 93, y = 138, 脚本 = 'scripts/npc/天宫/蟠桃园后/花苗.lua' },
    { mid = 001217, 分类 = '普通', 外形 = 2514, 方向 = 2, 名称 = '小灵猴', x = 40, y = 38, 脚本 = 'scripts/npc/天宫/蟠桃园后/小灵猴.lua' },
    { mid = 001217, 分类 = '普通', 外形 = 2025, 方向 = 2, 名称 = '山鬼', x = 91, y = 102, 脚本 = 'scripts/npc/天宫/蟠桃园后/山鬼.lua' },
    { mid = 001217, 分类 = '普通', 外形 = 3051, 方向 = 1, 名称 = '鸿蒙老祖', x = 42, y = 180, 脚本 = 'scripts/npc/天宫/蟠桃园后/鸿蒙老祖.lua' },
    { mid = 001217, 分类 = '普通', 外形 = 3061, 方向 = 2, 名称 = '采桃仙女', x = 69, y = 70, 脚本 = 'scripts/npc/天宫/蟠桃园后/采桃仙女.lua' },
    { mid = 001217, 分类 = '普通', 外形 = 3070, 方向 = 1, 名称 = '蟠桃园土地', x = 19, y = 40, 脚本 = 'scripts/npc/天宫/蟠桃园后/蟠桃园土地.lua' },
    { mid = 001217, 分类 = '普通', 外形 = 3063, 方向 = 2, 名称 = '守园大将', x = 38, y = 66, 脚本 = 'scripts/npc/天宫/蟠桃园后/守园大将.lua' },
    { mid = 001217, 分类 = '普通', 外形 = 2291, 方向 = 2, 名称 = '蟠桃女娲', x = 119, y = 50, 脚本 = 'scripts/npc/天宫/蟠桃园后/蟠桃女娲.lua' },
    -------------------------------------------------洛阳城-------------------------------------------------
    { mid = 001236, 分类 = '普通', 外形 = 3030, 方向 = 0, 名称 = '何老才', x = 385, y = 49, 脚本 = 'scripts/npc/洛阳城/何老才.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3091, 方向 = 0, 名称 = '顶天柱', x = 309, y = 125, 脚本 = 'scripts/npc/洛阳城/顶天柱.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3082, 方向 = 0, 名称 = '满堂春', x = 335, y = 62, 脚本 = 'scripts/npc/洛阳城/满堂春.lua' },
    { mid = 001236, 分类 = '传送', 外形 = 3079, 方向 = 1, 名称 = '车夫', 称谓 = '洛阳镖局', x = 327, y = 170, 脚本 = 'scripts/npc/洛阳城/车夫_镖局.lua' },
    { mid = 001236, 分类 = '传送', 外形 = 3079, 方向 = 1, 名称 = '车夫', 称谓 = '洛阳集市', x = 363, y = 67, 脚本 = 'scripts/npc/洛阳城/车夫_集市.lua' },
    { mid = 001236, 分类 = '传送', 外形 = 3079, 方向 = 1, 名称 = '车夫', 称谓 = '洛阳传送', x = 108, y = 100, 脚本 = 'scripts/npc/洛阳城/车夫_福寿.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 2177, 方向 = 0, 名称 = '葛洪', x = 421, y = 213, 脚本 = 'scripts/npc/洛阳城/葛宏.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3092, 方向 = 0, 名称 = '黄火牛', x = 402, y = 218, 脚本 = 'scripts/npc/洛阳城/黄火牛.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3093, 方向 = 3, 名称 = '胡巧儿', x = 237, y = 89, 脚本 = 'scripts/npc/洛阳城/胡巧儿.lua' },
    { mid = 001236, 分类 = '任务', 外形 = 3012, 方向 = 0, 名称 = '铁匠', x = 134, y = 192, 脚本 = 'scripts/npc/洛阳城/铁匠.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3376, 方向 = 0, 名称 = '游客', x = 272, y = 80, 脚本 = 'scripts/npc/洛阳城/游客.lua' },
    { mid = 001236, 分类 = '商业', 外形 = 3113, 方向 = 1, 名称 = '宝石匠师', x = 27, y = 193, 脚本 = 'scripts/npc/洛阳城/宝石匠师.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3023, 方向 = 1, 名称 = '宝石小贩', x = 31, y = 188, 脚本 = 'scripts/npc/洛阳城/宝石小贩.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3038, 方向 = 0, 名称 = '汉宁中郎将', x = 132, y = 102, 脚本 = 'scripts/npc/洛阳城/汉宁中郎将.lua' },
    { mid = 001236, 分类 = '任务', 外形 = 3035, 方向 = 0, 名称 = '赈灾官员', x = 340, y = 33, 脚本 = 'scripts/npc/长安/赈灾官员.lua' },
    { mid = 001236, 分类 = '商业', 外形 = 3001, 方向 = 0, 名称 = '超级巫医', x = 150, y = 151, 脚本 = 'scripts/npc/超级巫医.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 0047, 方向 = 2, 名称 = '小可怜', x = 185, y = 114, 脚本 = 'scripts/npc/洛阳城/小可爱.lua' },
    { mid = 001236, 分类 = '任务', 外形 = 3085, 方向 = 2, 名称 = '大理寺官员', x = 193, y = 113, 脚本 = 'scripts/npc/洛阳城/大理寺官员.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3045, 方向 = 0, 名称 = '神机子', x = 283, y = 74, 脚本 = 'scripts/npc/洛阳城/神机子.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3076, 方向 = 0, 名称 = '神算子', x = 260, y = 73, 脚本 = 'scripts/npc/洛阳城/神算子.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3121, 方向 = 0, 名称 = '颜归田', x = 38, y = 212, 脚本 = 'scripts/npc/洛阳城/颜归田.lua' },
    { mid = 001236, 分类 = '任务', 外形 = 6538, 方向 = 0, 名称 = '玄阴仙子', x = 155, y = 134, 脚本 = 'scripts/npc/洛阳城/玄阴仙子.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3026, 方向 = 1, 名称 = '江湖百晓生', x = 188, y = 214, 脚本 = 'scripts/npc/洛阳城/江湖百晓生.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3083, 方向 = 0, 名称 = '萧举人', x = 100, y = 31, 脚本 = 'scripts/npc/洛阳城/萧举人.lua' },
    { mid = 001236, 分类 = '商业', 外形 = 3117, 方向 = 0, 名称 = '李道宗', 称谓 = '装备维修', x = 399, y = 99, 脚本 = 'scripts/npc/洛阳城/李道宗.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3082, 方向 = 0, 名称 = '何小姐', x = 97, y = 30, 脚本 = 'scripts/npc/洛阳城/何小姐.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3012, 方向 = 0, 名称 = '庄铁匠', x = 139, y = 193, 脚本 = 'scripts/npc/洛阳城/庄铁匠.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3080, 方向 = 0, 名称 = '胡大力', x = 362, y = 205, 脚本 = 'scripts/npc/洛阳城/胡大力.lua' },
    { mid = 001236, 分类 = '商业', 外形 = 3001, 方向 = 0, 名称 = '超级巫医', x = 405, y = 104, 脚本 = 'scripts/npc/超级巫医.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3069, 方向 = 0, 名称 = '鲁大婶', x = 233, y = 25, 脚本 = 'scripts/npc/洛阳城/鲁大婶.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3062, 方向 = 0, 名称 = '灵兽仙', x = 181, y = 51, 脚本 = 'scripts/npc/洛阳城/灵兽仙.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 3105, 方向 = 1, 名称 = '夕阳武士', x = 395, y = 36, 脚本 = 'scripts/npc/洛阳城/夕阳武士.lua' },
    { mid = 001236, 分类 = '普通', 外形 = 2015, 方向 = 3, 名称 = '无名侠女', x = 402, y = 33, 脚本 = 'scripts/npc/洛阳城/无名侠女.lua' },
    -------------------------------------------------城隍庙-------------------------------------------------
    { mid = 001237, 分类 = '普通', 外形 = 3045, 方向 = 2, 名称 = '庙祝', x = 16, y = 10, 脚本 = 'scripts/npc/洛阳城/城隍庙/庙祝.lua' },
    -------------------------------------------------钱庄-------------------------------------------------
    { mid = 001238, 分类 = '商业', 外形 = 3086, 方向 = 0, 名称 = '钱庄老板', 称谓 = '洛阳南钱庄老板', x = 22, y = 13, 脚本 = 'scripts/npc/洛阳城/钱庄/钱庄老板.lua' },
    { mid = 001238, 分类 = '普通', 外形 = 3086, 方向 = 0, 名称 = '财神', x = 26, y = 9, 脚本 = 'scripts/npc/洛阳城/钱庄/财神.lua' },
    { mid = 001239, 分类 = '普通', 外形 = 3003, 方向 = 1, 名称 = '王五', x = 14, y = 8, 脚本 = 'scripts/npc/洛阳城/洛阳城武器店/王五.lua' },
    -------------------------------------------------衣服店-------------------------------------------------
    { mid = 001240, 分类 = '普通', 外形 = 6649, 方向 = 2, 名称 = '朱老板', x = 14, y = 7, 脚本 = 'scripts/npc/洛阳城/洛阳城饰品店/朱老板.lua' },
    -------------------------------------------------广茂钱庄-------------------------------------------------
    { mid = 001243, 分类 = '商业', 外形 = 3086, 方向 = 0, 名称 = '钱庄老板', 称谓 = '洛阳西钱庄', x = 14, y = 5, 脚本 = 'scripts/npc/洛阳城/广茂钱庄/钱庄老板.lua' },
    -------------------------------------------------衙门厢房-------------------------------------------------
    { mid = 001244, 分类 = '普通', 外形 = 3015, 方向 = 2, 名称 = '詹镖师', x = 16, y = 10, 脚本 = 'scripts/npc/洛阳城/镖局厢房/黄渊源.lua' },
    -------------------------------------------------洛阳酒楼-------------------------------------------------
    { mid = 001246, 分类 = '商业', 外形 = 3013, 方向 = 0, 名称 = '赵老板', 称谓 = '洛阳集市酒楼', x = 27, y = 12, 脚本 = 'scripts/npc/洛阳城/洛阳酒楼/赵老板.lua' },
    -------------------------------------------------当铺-------------------------------------------------
    { mid = 001247, 分类 = '商业', 外形 = 3089, 方向 = 0, 名称 = '当铺老板', 称谓 = '洛阳南当铺老板', x = 16, y = 19, 脚本 = 'scripts/npc/洛阳城/当铺/当铺老板.lua' },
    -------------------------------------------------大赌场-------------------------------------------------
    { mid = 001250, 分类 = '普通', 外形 = 3087, 方向 = 0, 名称 = '三缺一', x = 23, y = 17, 脚本 = 'scripts/npc/洛阳城/大赌场/三缺一.lua' },
    -------------------------------------------------福寿店-------------------------------------------------
    { mid = 001251, 分类 = '商业', 外形 = 3009, 方向 = 0, 名称 = '曹老板', 称谓 = '洛阳福寿店', x = 17, y = 7, 脚本 = 'scripts/npc/洛阳城/福寿店/曹老板.lua' },
    -------------------------------------------------温香轩-------------------------------------------------
    { mid = 001252, 分类 = '普通', 外形 = 3088, 方向 = 0, 名称 = '大香玉', x = 13, y = 11, 脚本 = 'scripts/npc/洛阳城/温香轩/大香玉.lua' },
    -------------------------------------------------暖玉轩-------------------------------------------------
    { mid = 001253, 分类 = '普通', 外形 = 3078, 方向 = 0, 名称 = '小香玉', x = 19, y = 11, 脚本 = 'scripts/npc/洛阳城/暖玉轩/小香玉.lua' },
    -------------------------------------------------镖局厢房-------------------------------------------------
    { mid = 001254, 分类 = '商业', 外形 = 3013, 方向 = 0, 名称 = '郭三才', x = 8, y = 12, 脚本 = 'scripts/npc/洛阳城/酒馆/郭三才.lua' },
    -------------------------------------------------乐坊-------------------------------------------------
    { mid = 001255, 分类 = '普通', 外形 = 3007, 方向 = 0, 名称 = '胜天籁', 称谓 = '洛阳乐坊', x = 9, y = 9, 脚本 = 'scripts/npc/洛阳城/乐坊/胜天籁.lua' },
    -------------------------------------------------洛阳府客厅-------------------------------------------------
    { mid = 001256, 分类 = '普通', 外形 = 3085, 方向 = 2, 名称 = '王大人', x = 30, y = 12, 脚本 = 'scripts/npc/洛阳城/衙门/王大人.lua' },
    { mid = 001257, 分类 = '普通', 外形 = 3076, 方向 = 2, 名称 = '李师爷', x = 38, y = 14, 脚本 = 'scripts/npc/洛阳城/洛阳衙门/李师爷.lua' },
    -------------------------------------------------酒店-------------------------------------------------
    { mid = 001258, 分类 = '普通', 外形 = 3083, 方向 = 0, 名称 = '魏小宝', x = 14, y = 10, 脚本 = 'scripts/npc/洛阳城/洛阳客栈/魏小宝.lua' },
    { mid = 001258, 分类 = '普通', 外形 = 3083, 方向 = 0, 名称 = '魏大宝', x = 6, y = 6, 脚本 = 'scripts/npc/洛阳城/洛阳客栈/魏大宝.lua' },
    -------------------------------------------------洛阳客栈-------------------------------------------------
    { mid = 001259, 分类 = '普通', 外形 = 3021, 方向 = 0, 名称 = '郭小二', x = 33, y = 21, 脚本 = 'scripts/npc/洛阳城/洛阳客栈/郭小二.lua' },
    { mid = 001259, 分类 = '商业', 外形 = 3013, 方向 = 0, 名称 = '掌柜', x = 18, y = 12, 脚本 = 'scripts/npc/洛阳城/洛阳客栈/掌柜.lua' },
    { mid = 001259, 分类 = '普通', 外形 = 3376, 方向 = 0, 名称 = '程英', x = 59, y = 27, 脚本 = 'scripts/npc/洛阳城/洛阳客栈/程英.lua' },
    { mid = 001260, 分类 = '普通', 外形 = 2087, 方向 = 0, 名称 = '贾有钱', x = 13, y = 10, 脚本 = 'scripts/npc/洛阳城/民居/贾有钱.lua' },
    { mid = 001262, 分类 = '普通', 外形 = 3166, 方向 = 0, 名称 = '陆小七', x = 11, y = 9, 脚本 = 'scripts/npc/洛阳城/民居/陆小七.lua' },
    { mid = 001263, 分类 = '商业', 外形 = 3001, 方向 = 3, 名称 = '杂货店老板', x = 19, y = 5, 脚本 = 'scripts/npc/洛阳城/洛阳集市杂货店/杂货店老板.lua' },
    -------------------------------------------------牛记布店-------------------------------------------------
    { mid = 001264, 分类 = '商业', 外形 = 3010, 方向 = 0, 名称 = '服装店老板', 称谓 = '洛阳南牛记布店', x = 14, y = 13, 脚本 = 'scripts/npc/洛阳城/牛记布店/服装店老板.lua' },
    -------------------------------------------------桥边厢房-------------------------------------------------
    { mid = 001266, 分类 = '普通', 外形 = 3075, 方向 = 0, 名称 = '马待封', 称谓 = '巧匠', x = 21, y = 9, 脚本 = 'scripts/npc/洛阳城/马待封.lua' },
    -------------------------------------------------洛阳青楼-------------------------------------------------
    { mid = 001267, 分类 = '普通', 外形 = 2046, 方向 = 0, 名称 = '李霸天', x = 30, y = 15, 脚本 = 'scripts/npc/洛阳城/洛阳青楼/李霸天.lua' },
    { mid = 001267, 分类 = '普通', 外形 = 3033, 方向 = 0, 名称 = '温老板', x = 27, y = 21, 脚本 = 'scripts/npc/洛阳城/洛阳青楼/温老板.lua' },
    -------------------------------------------------饰品店-------------------------------------------------
    { mid = 001268, 分类 = '商业', 外形 = 3007, 方向 = 0, 名称 = '饰品店老板', 称谓 = '洛阳饰品铺', x = 19, y = 12, 脚本 = 'scripts/npc/洛阳城/饰品店/饰品店老板.lua' },
    -------------------------------------------------书店-------------------------------------------------
    { mid = 001269, 分类 = '普通', 外形 = 3062, 方向 = 0, 名称 = '胡惠超', 称谓 = '天师', x = 23, y = 15, 脚本 = 'scripts/npc/洛阳城/书店/胡惠超.lua' },
    -------------------------------------------------铁匠店-------------------------------------------------
    { mid = 001270, 分类 = '普通', 外形 = 3112, 方向 = 0, 名称 = '石冶金', x = 11, y = 13, 脚本 = 'scripts/npc/洛阳城/铁匠店/石冶金.lua' },
    { mid = 001270, 分类 = '普通', 外形 = 3003, 方向 = 0, 名称 = '木匠', x = 9, y = 8, 脚本 = 'scripts/npc/洛阳城/铁匠店/木匠.lua' },
    { mid = 001270, 分类 = '普通', 外形 = 3113, 方向 = 0, 名称 = '石点金', x = 24, y = 10, 脚本 = 'scripts/npc/洛阳城/铁匠店/石点金.lua' },
    -------------------------------------------------洛阳药店-------------------------------------------------
    { mid = 001271, 分类 = '普通', 外形 = 3051, 方向 = 0, 名称 = '孙思邈', x = 15, y = 5, 脚本 = 'scripts/npc/洛阳城/洛阳药店/孙思邈.lua' },
    { mid = 001271, 分类 = '商业', 外形 = 3002, 方向 = 0, 名称 = '药店老板', x = 18, y = 12, 脚本 = 'scripts/npc/洛阳城/洛阳药店/药店老板.lua' },
    { mid = 001272, 分类 = '商业', 外形 = 3013, 方向 = 0, 名称 = '贾老板', x = 25, y = 9, 脚本 = 'scripts/npc/洛阳城/云来酒店/贾老板.lua' },
    -------------------------------------------------洛阳当铺-------------------------------------------------
    { mid = 001273, 分类 = '普通', 外形 = 3083, 方向 = 0, 名称 = '王小宝', x = 22, y = 24, 脚本 = 'scripts/npc/洛阳城/王小宝.lua' },
    { mid = 001273, 分类 = '商业', 外形 = 3005, 方向 = 0, 名称 = '当铺老板', x = 28, y = 18, 脚本 = 'scripts/npc/洛阳城/洛阳当铺/当铺老板.lua' },
    -------------------------------------------------服饰店-------------------------------------------------
    { mid = 001275, 分类 = '商业', 外形 = 3010, 方向 = 0, 名称 = '服装店老板', 称谓 = '洛阳服饰铺', x = 17, y = 13, 脚本 = 'scripts/npc/洛阳城/服饰店/服装店老板.lua' },
    -------------------------------------------------杂货铺-------------------------------------------------
    { mid = 001276, 分类 = '商业', 外形 = 3001, 方向 = 0, 名称 = '杂货店老板', 称谓 = '洛阳杂货铺', x = 17, y = 12, 脚本 = 'scripts/npc/洛阳城/洛阳杂货铺/杂货店老板.lua' },
    -------------------------------------------------赌场-------------------------------------------------
    { mid = 001277, 分类 = '普通', 外形 = 3087, 方向 = 0, 名称 = '殷不赔', x = 20, y = 8, 脚本 = 'scripts/npc/洛阳城/赌场/殷不赔.lua' },
    -------------------------------------------------酒馆-------------------------------------------------
    { mid = 001278, 分类 = '商业', 外形 = 3013, 方向 = 0, 名称 = '高御坤', 称谓 = '洛阳酒店老板', x = 17, y = 12, 脚本 = 'scripts/npc/洛阳城/酒馆/高御坤.lua' },
    { mid = 001280, 分类 = '商业', 外形 = 3007, 方向 = 0, 名称 = '李龟年', 称谓 = '集市乐坊', x = 19, y = 9, 脚本 = 'scripts/npc/洛阳城/乐坊/李龟年.lua' },
    { mid = 001281, 分类 = '商业', 外形 = 3009, 方向 = 0, 名称 = '饰品店老板', 称谓 = '集市饰品店', x = 13, y = 12, 脚本 = 'scripts/npc/洛阳城/饰品店/饰品店老板.lua' },
    { mid = 001282, 分类 = '商业', 外形 = 3009, 方向 = 0, 名称 = '蒋老九', 称谓 = '集市福寿店', x = 14, y = 7, 脚本 = 'scripts/npc/洛阳城/福寿店/蒋老九.lua' },
    { mid = 001283, 分类 = '商业', 外形 = 3003, 方向 = 0, 名称 = '武器店老板', 称谓 = '洛阳武器店', x = 18, y = 7, 脚本 = 'scripts/npc/洛阳城/武器店/武器店老板.lua' },
    -------------------------------------------------药店-------------------------------------------------
    { mid = 001284, 分类 = '商业', 外形 = 3002, 方向 = 2, 名称 = '药店老板', x = 15, y = 4, 脚本 = 'scripts/npc/洛阳城/药店/药店老板.lua' },
    -------------------------------------------------铁匠屋-------------------------------------------------
    { mid = 001285, 分类 = '商业', 外形 = 3012, 方向 = 0, 名称 = '何大雷', 称谓 = '集市铁匠铺', x = 7, y = 11, 脚本 = 'scripts/npc/洛阳城/铁匠屋/何大雷.lua' },
    { mid = 001285, 分类 = '商业', 外形 = 3075, 方向 = 1, 名称 = '崔无眠', 称谓 = '集市铁匠铺', x = 21, y = 13, 脚本 = 'scripts/npc/洛阳城/铁匠屋/崔无眠.lua' },
    { mid = 001286, 分类 = '商业', 外形 = 3021, 方向 = 1, 名称 = '小二', 称谓 = '集市酒店', x = 27, y = 11, 脚本 = 'scripts/npc/洛阳城/酒店/小二.lua' },
    { mid = 001287, 分类 = '普通', 外形 = 2046, 方向 = 0, 名称 = '黄大小', x = 22, y = 19, 脚本 = 'scripts/npc/洛阳城/大赌场/黄大小.lua' },
    -------------------------------------------------镖局大厅-------------------------------------------------
    { mid = 001288, 分类 = '普通', 外形 = 3015, 方向 = 2, 名称 = '周资瑜', x = 20, y = 17, 脚本 = 'scripts/npc/洛阳城/镖局大厅/周资瑜.lua' },
    { mid = 001288, 分类 = '普通', 外形 = 6653, 方向 = 2, 名称 = '黄渊源', x = 27, y = 14, 脚本 = 'scripts/npc/洛阳城/镖局大厅/黄渊源.lua' },
    -------------------------------------------------长寿比武场-------------------------------------------------
    { mid = 001291, 分类 = '任务', 外形 = 4001, 方向 = 1, 名称 = '幻灵鼠', x = 78, y = 73, 脚本 = 'scripts/npc/幻境/幻灵鼠.lua' },

    -------------------------------------------------庙会活动-------------------------------------------------
    { mid = 001001, 分类 = '任务', 外形 = 3035, 方向 = 1, 名称 = '礼部官员', x = 266, y = 124, 脚本 = 'scripts/npc/限时活动/孔庙祭祀_礼部官员.lua' },
    { mid = 101386, 分类 = '任务', 外形 = 3035, 方向 = 1, 名称 = '礼部官员', x = 30, y = 17, 脚本 = 'scripts/npc/限时活动/孔庙祭祀_礼部官员_1.lua' },
    { mid = 101386, 分类 = '商业', 外形 = 3081, 方向 = 4, 名称 = '庙祝', x = 85, y = 54, 脚本 = 'scripts/npc/限时活动/孔庙祭祀_庙祝.lua' },
    { mid = 101386, 分类 = '商业', 外形 = 3081, 方向 = 1, 名称 = '庙祝', x = 107, y = 95, 脚本 = 'scripts/npc/限时活动/孔庙祭祀_庙祝.lua' },
    { mid = 101386, 分类 = '商业', 外形 = 3081, 方向 = 2, 名称 = '庙祝', x = 35, y = 76, 脚本 = 'scripts/npc/限时活动/孔庙祭祀_庙祝.lua' },

    -- -----------------------------------------------限时活动-------------------------------------------------
    -- { mid = 001091, 分类 = '任务', 外形 = 3375, 方向 = 1, 名称 = '灯笼树', x = 82, y = 91, 脚本 = 'scripts/npc/限时活动/灯笼树.lua' },
    -- { mid = 001001, 分类 = '任务', 外形 = 3114, 方向 = 2, 名称 = '贺岁福星', x = 80, y = 163, 脚本 = 'scripts/npc/限时活动/贺岁福星.lua' },
    -- { mid = 001236, 分类 = '任务', 外形 = 3114, 方向 = 0, 名称 = '贺岁福星', x = 141, y = 144, 脚本 = 'scripts/npc/限时活动/贺岁福星.lua' },
    -- { mid = 001208, 分类 = '任务', 外形 = 3114, 方向 = 0, 名称 = '贺岁福星', x = 134, y = 52, 脚本 = 'scripts/npc/限时活动/贺岁福星.lua' },
    -- { mid = 001070, 分类 = '商业', 外形 = 3021, 方向 = 2, 名称 = '年货小贩', x = 84, y = 147, 脚本 = 'scripts/npc/限时活动/年货小贩.lua' },
    -- ---------------------------------------------------------------------------------------------
    -- { mid = 001001, 分类 = '任务', 外形 = 3035, 方向 = 1, 名称 = '介子推', x = 87, y = 150, 脚本 = 'scripts/npc/限时活动/清明_介子推.lua' },
    -- { mid = 001236, 分类 = '任务', 外形 = 3035, 方向 = 1, 名称 = '介子推', x = 180, y = 120, 脚本 = 'scripts/npc/限时活动/清明_介子推.lua' },
    -- { mid = 001208, 分类 = '任务', 外形 = 3035, 方向 = 1, 名称 = '介子推', x = 113, y = 128, 脚本 = 'scripts/npc/限时活动/清明_介子推.lua' },
    -- { mid = 001001, 分类 = '任务', 外形 = 2075, 方向 = 1, 名称 = '阎罗王', x = 174, y = 192, 脚本 = 'scripts/npc/限时活动/清明_阎罗王.lua' },
    -- ---------------------------------------------------------------------------------------------
    -- { mid = 001236, 分类 = '任务', 外形 = 3010, 方向 = 1, 名称 = '裁缝', x = 205, y = 110, 脚本 = 'scripts/npc/限时活动/孔庙祭祀_裁缝.lua' },
    -- { mid = 001001, 分类 = '任务', 外形 = 3010, 方向 = 1, 名称 = '裁缝', x = 120, y = 100, 脚本 = 'scripts/npc/限时活动/孔庙祭祀_裁缝.lua' },
    -- { mid = 001001, 分类 = '任务', 外形 = 3035, 方向 = 1, 名称 = '礼部官员', x = 60, y = 16, 脚本 = 'scripts/npc/限时活动/孔庙祭祀_礼部官员.lua' },
    -- { mid = 101386, 分类 = '商业', 外形 = 3081, 方向 = 4, 名称 = '庙祝', x = 85, y = 54, 脚本 = 'scripts/npc/限时活动/孔庙祭祀_庙祝.lua' },
    -- { mid = 101386, 分类 = '商业', 外形 = 3081, 方向 = 1, 名称 = '庙祝', x = 107, y = 95, 脚本 = 'scripts/npc/限时活动/孔庙祭祀_庙祝.lua' },
    -- { mid = 101386, 分类 = '商业', 外形 = 3081, 方向 = 2, 名称 = '庙祝', x = 35, y = 76, 脚本 = 'scripts/npc/限时活动/孔庙祭祀_庙祝.lua' },

    -------------------------------------------------长寿比武场-------------------------------------------------
    {
        mid = 021197,
        分类 = '普通',
        外形 = 3061,
        方向 = 2,
        名称 = '退场传送人',
        x = 148,
        y = 22,
        脚本 = 'scripts/npc/天宫/天宫寻宝一层/退场传送人.lua'
    },
    {
        mid = 021197,
        分类 = '普通',
        外形 = 3001,
        方向 = 2,
        名称 = '超级巫医',
        x = 101,
        y = 56,
        脚本 = 'scripts/npc/超级巫医.lua'
    },
    {
        mid = 021197,
        分类 = '普通',
        外形 = 0038,
        方向 = 0,
        名称 = '宝库守卫',
        x = 70,
        y = 100,
        脚本 = 'scripts/npc/天宫/天宫寻宝一层/灵人侍卫.lua'
    },
    {
        mid = 021197,
        分类 = '普通',
        外形 = 0038,
        方向 = 0,
        名称 = '宝库守卫',
        x = 93,
        y = 87,
        脚本 = 'scripts/npc/天宫/天宫寻宝一层/灵人侍卫.lua'
    },
    {
        mid = 021197,
        分类 = '普通',
        外形 = 3063,
        方向 = 0,
        名称 = '宝库传送人',
        x = 78,
        y = 64,
        脚本 = 'scripts/npc/天宫/天宫寻宝一层/宝库传送人.lua'
    },

    {
        mid = 001293,
        分类 = '普通',
        外形 = 0038,
        方向 = 0,
        名称 = '宝库守卫',
        x = 60,
        y = 58,
        脚本 = 'scripts/npc/天宫/天宫寻宝二层/御仙使者.lua'
    },
    {
        mid = 001293,
        分类 = '普通',
        外形 = 0038,
        方向 = 0,
        名称 = '宝库守卫',
        x = 25,
        y = 40,
        脚本 = 'scripts/npc/天宫/天宫寻宝二层/御仙使者.lua'
    },
    {
        mid = 001293,
        分类 = '普通',
        外形 = 0038,
        方向 = 0,
        名称 = '宝库守卫',
        x = 66,
        y = 20,
        脚本 = 'scripts/npc/天宫/天宫寻宝二层/御仙使者.lua'
    },
    {
        mid = 001293,
        分类 = '普通',
        外形 = 0038,
        方向 = 0,
        名称 = '宝库守卫',
        x = 102,
        y = 37,
        脚本 = 'scripts/npc/天宫/天宫寻宝二层/御仙使者.lua'
    },
    {
        mid = 001293,
        分类 = '普通',
        外形 = 3001,
        方向 = 0,
        名称 = '超级巫医',
        x = 60,
        y = 44,
        脚本 = 'scripts/npc/超级巫医.lua'
    },
    {
        mid = 001293,
        分类 = '普通',
        外形 = 3063,
        方向 = 0,
        名称 = '宝库传送人',
        x = 63,
        y = 36,
        脚本 = 'scripts/npc/天宫/天宫寻宝二层/宝库传送人.lua'
    },
    {
        mid = 001293,
        分类 = '普通',
        外形 = 3061,
        方向 = 2,
        名称 = '退场传送人',
        x = 76,
        y = 39,
        脚本 = 'scripts/npc/天宫/天宫寻宝一层/退场传送人.lua'
    },


    {
        mid = 011293,
        分类 = '普通',
        外形 = 0038,
        方向 = 0,
        名称 = '宝库守卫',
        x = 60,
        y = 58,
        脚本 = 'scripts/npc/天宫/天宫寻宝三层/御仙使者.lua'
    },
    {
        mid = 011293,
        分类 = '普通',
        外形 = 0038,
        方向 = 0,
        名称 = '宝库守卫',
        x = 25,
        y = 40,
        脚本 = 'scripts/npc/天宫/天宫寻宝三层/御仙使者.lua'
    },
    {
        mid = 011293,
        分类 = '普通',
        外形 = 0038,
        方向 = 0,
        名称 = '宝库守卫',
        x = 66,
        y = 20,
        脚本 = 'scripts/npc/天宫/天宫寻宝三层/御仙使者.lua'
    },
    {
        mid = 011293,
        分类 = '普通',
        外形 = 0038,
        方向 = 0,
        名称 = '宝库守卫',
        x = 102,
        y = 37,
        脚本 = 'scripts/npc/天宫/天宫寻宝三层/御仙使者.lua'
    },
    {
        mid = 011293,
        分类 = '商业',
        外形 = 3001,
        方向 = 0,
        名称 = '超级巫医',
        x = 60,
        y = 44,
        脚本 = 'scripts/npc/超级巫医.lua'
    },
    {
        mid = 011293,
        分类 = '普通',
        外形 = 3063,
        方向 = 0,
        名称 = '宝库传送人',
        x = 63,
        y = 36,
        脚本 = 'scripts/npc/天宫/天宫寻宝三层/宝库传送人.lua'
    },
    {
        mid = 011293,
        分类 = '普通',
        外形 = 3061,
        方向 = 2,
        名称 = '退场传送人',
        x = 76,
        y = 39,
        脚本 = 'scripts/npc/天宫/天宫寻宝一层/退场传送人.lua'
    },


    {
        mid = 001294,
        分类 = '普通',
        外形 = 0038,
        方向 = 0,
        名称 = '宝库守卫',
        x = 41,
        y = 50,
        脚本 = 'scripts/npc/天宫/天宫寻宝四层/御仙使者.lua'
    },
    {
        mid = 001294,
        分类 = '普通',
        外形 = 0038,
        方向 = 2,
        名称 = '宝库守卫',
        x = 82,
        y = 56,
        脚本 = 'scripts/npc/天宫/天宫寻宝四层/御仙使者.lua'
    },
    {
        mid = 001294,
        分类 = '普通',
        外形 = 3063,
        方向 = 0,
        名称 = '宝库传送人',
        x = 64,
        y = 48,
        脚本 = 'scripts/npc/天宫/天宫寻宝四层/宝库传送人.lua'
    },
    {
        mid = 001294,
        分类 = '普通',
        外形 = 3061,
        方向 = 0,
        名称 = '退场传送人',
        x = 69,
        y = 41,
        脚本 = 'scripts/npc/天宫/天宫寻宝一层/退场传送人.lua'
    },
    {
        mid = 001294,
        分类 = '商业',
        外形 = 3001,
        方向 = 0,
        名称 = '超级巫医',
        x = 78,
        y = 46,
        脚本 = 'scripts/npc/超级巫医.lua'
    },

    {
        mid = 001001,
        分类 = '任务',
        外形 = 50,
        方向 = 0,
        名称 = '东君',
        x = 325,
        y = 115,
        脚本 = 'scripts/npc/限时活动/寻芳_东郡.lua'
    },
    {
        mid = 001291,
        分类 = '任务',
        外形 = 4001,
        方向 = 1,
        名称 = '幻灵鼠',
        x = 78,
        y = 73,
        脚本 = 'scripts/npc/幻境/幻灵鼠.lua'
    },
    {
        mid = 001291,
        分类 = '普通',
        外形 = 3001,
        方向 = 1,
        名称 = '超级巫医',
        x = 88,
        y = 72,
        脚本 = 'scripts/npc/超级巫医.lua'
    },


    -- { mid = 001091, 分类 = '任务', 外形 = 3375, 方向 = 1, 名称 = '灯笼树', x = 82, y = 91,
    --     脚本 = 'scripts/npc/限时活动/灯笼树.lua' },
    -- { mid = 001001, 分类 = '任务', 外形 = 3114, 方向 = 2, 名称 = '贺岁福星', x = 80, y = 163,
    --     脚本 = 'scripts/npc/限时活动/贺岁福星.lua' },
    -- { mid = 001236, 分类 = '任务', 外形 = 3114, 方向 = 0, 名称 = '贺岁福星', x = 141, y = 144,
    --     脚本 = 'scripts/npc/限时活动/贺岁福星.lua' },
    -- { mid = 001208, 分类 = '任务', 外形 = 3114, 方向 = 0, 名称 = '贺岁福星', x = 134, y = 52,
    --     脚本 = 'scripts/npc/限时活动/贺岁福星.lua' },
    -- { mid = 001070, 分类 = '商业', 外形 = 3021, 方向 = 2, 名称 = '年货小贩', x = 84, y = 147,
    --     脚本 = 'scripts/npc/限时活动/年货小贩.lua' },

    -- { mid = 001001, 分类 = '任务', 外形 = 3035, 方向 = 1, 名称 = '介子推', x = 87, y = 150,
    --     脚本 = 'scripts/npc/限时活动/清明_介子推.lua' },
    -- { mid = 001236, 分类 = '任务', 外形 = 3035, 方向 = 1, 名称 = '介子推', x = 180, y = 120,
    --     脚本 = 'scripts/npc/限时活动/清明_介子推.lua' },
    -- { mid = 001208, 分类 = '任务', 外形 = 3035, 方向 = 1, 名称 = '介子推', x = 113, y = 128,
    --     脚本 = 'scripts/npc/限时活动/清明_介子推.lua' },
    -- { mid = 001001, 分类 = '任务', 外形 = 2075, 方向 = 1, 名称 = '阎罗王', x = 174, y = 192,
    --     脚本 = 'scripts/npc/限时活动/清明_阎罗王.lua' },

    -- { mid = 001236, 分类 = '任务', 外形 = 3010, 方向 = 1, 名称 = '裁缝', x = 205, y = 110,
    --     脚本 = 'scripts/npc/限时活动/孔庙祭祀_裁缝.lua' },
    -- { mid = 001001, 分类 = '任务', 外形 = 3010, 方向 = 1, 名称 = '裁缝', x = 120, y = 100,
    --     脚本 = 'scripts/npc/限时活动/孔庙祭祀_裁缝.lua' },

    -- { mid = 001001, 分类 = '任务', 外形 = 3035, 方向 = 1, 名称 = '礼部官员', x = 60, y = 16,
    --     脚本 = 'scripts/npc/限时活动/孔庙祭祀_礼部官员.lua' },
    -- { mid = 101386, 分类 = '商业', 外形 = 3081, 方向 = 4, 名称 = '庙祝', x = 85, y = 54,
    --     脚本 = 'scripts/npc/限时活动/孔庙祭祀_庙祝.lua' },
    -- { mid = 101386, 分类 = '商业', 外形 = 3081, 方向 = 1, 名称 = '庙祝', x = 107, y = 95,
    --     脚本 = 'scripts/npc/限时活动/孔庙祭祀_庙祝.lua' },
    -- { mid = 101386, 分类 = '商业', 外形 = 3081, 方向 = 2, 名称 = '庙祝', x = 35, y = 76,
    --     脚本 = 'scripts/npc/限时活动/孔庙祭祀_庙祝.lua' },
    -----------------------------------------------------------------------------------------------
    -- { mid = 1194, 分类 = '任务', 外形 = 2182, 方向 = 2, 名称 = '鬼室福信', x = 427, y = 41,
    --     脚本 = 'scripts/npc/限时活动/盛世华夏_鬼室福信.lua' },
    -- { mid = 1174, 分类 = '任务', 外形 = 2182, 方向 = 1, 名称 = '浮屠道深', x = 182, y = 138,
    --     脚本 = 'scripts/npc/限时活动/盛世华夏_浮屠道深.lua' },
    -- { mid = 101295, 分类 = '任务', 外形 = 2182, 方向 = 1, 名称 = '狭井槟榔', x = 167, y = 156,
    --     脚本 = 'scripts/npc/限时活动/盛世华夏_狭井槟榔.lua' },
    -- { mid = 101299, 分类 = '任务', 外形 = 2182, 方向 = 1, 名称 = '毛野稚子', x = 189, y = 75,
    --     脚本 = 'scripts/npc/限时活动/盛世华夏_毛野稚子.lua' },
    -- { mid = 101300, 分类 = '任务', 外形 = 2182, 方向 = 2, 名称 = '百济王', x = 224, y = 79,
    --     脚本 = 'scripts/npc/限时活动/盛世华夏_百济王.lua' },

    -----------------------------------------------------------------------------------------------


    { mid = 101385, 分类 = '任务', 外形 = 3061, 方向 = 2, 名称 = '退场传送人', x = 399, y = 50, 脚本 = 'scripts/npc/大闹天宫/花果山/退场传送人_花果山.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2131, 方向 = 2, 称谓 = "花果山", 名称 = '任务总管', x = 408, y = 68, 脚本 = 'scripts/npc/大闹天宫/花果山/任务总管_花果山.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2131, 方向 = 2, 称谓 = "花果山", 名称 = '超级巫医', x = 408, y = 54, 脚本 = 'scripts/npc/大闹天宫/花果山/超级巫医_花果山.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2131, 方向 = 2, 称谓 = "花果山", 名称 = '花果山灯芯', x = 390, y = 58, 脚本 = 'scripts/npc/大闹天宫/花果山/灯芯_花果山.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2131, 方向 = 3, 名称 = '花果山基地传出', x = 369, y = 60, 脚本 = 'scripts/npc/大闹天宫/花果山/基地传出_花果山.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2131, 方向 = 1, 名称 = '花果山基地传进', x = 359, y = 69, 脚本 = 'scripts/npc/大闹天宫/花果山/基地传进_花果山.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2131, 方向 = 1, 名称 = '花果山上塔传进', x = 397, y = 122, 脚本 = 'scripts/npc/大闹天宫/花果山/上塔传进_花果山.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2131, 方向 = 3, 名称 = '花果山上塔传出', x = 412, y = 115, 脚本 = 'scripts/npc/大闹天宫/花果山/上塔传出_花果山.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2131, 方向 = 1, 名称 = '花果山中塔传出', x = 355, y = 118, 脚本 = 'scripts/npc/大闹天宫/花果山/中塔传出_花果山.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2131, 方向 = 1, 名称 = '花果山中塔传进', x = 333, y = 121, 脚本 = 'scripts/npc/大闹天宫/花果山/中塔传进_花果山.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2131, 方向 = 1, 名称 = '花果山下塔传出', x = 339, y = 84, 脚本 = 'scripts/npc/大闹天宫/花果山/下塔传出_花果山.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2131, 方向 = 1, 名称 = '花果山下塔传进', x = 324, y = 86, 脚本 = 'scripts/npc/大闹天宫/花果山/下塔传进_花果山.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 3123, 方向 = 2, 名称 = '上塔', x = 404.5, y = 119.5, 脚本 = 'scripts/npc/大闹天宫/花果山/上塔.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 3123, 方向 = 2, 名称 = '中塔', x = 342.4, y = 117.2, 脚本 = 'scripts/npc/大闹天宫/花果山/中塔.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 3123, 方向 = 2, 名称 = '下塔', x = 331.3, y = 83.1, 脚本 = 'scripts/npc/大闹天宫/花果山/下塔.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 3061, 方向 = 0, 名称 = '退场传送人', x = 59, y = 250, 脚本 = 'scripts/npc/大闹天宫/天庭/退场传送人_天庭.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2130, 方向 = 1, 称谓 = "天庭", 名称 = '任务总管', x = 51, y = 281, 脚本 = 'scripts/npc/大闹天宫/天庭/任务总管_天庭.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2130, 方向 = 4, 称谓 = "天庭", 名称 = '超级巫医', x = 48, y = 270, 脚本 = 'scripts/npc/大闹天宫/天庭/超级巫医_天庭.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2130, 方向 = 4, 称谓 = "天庭", 名称 = '天庭灯芯', x = 31, y = 275, 脚本 = 'scripts/npc/大闹天宫/天庭/灯芯_天庭.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2130, 方向 = 1, 名称 = '天庭基地传出', x = 88, y = 244, 脚本 = 'scripts/npc/大闹天宫/天庭/基地传出_天庭.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2130, 方向 = 1, 名称 = '天庭基地传进', x = 125, y = 230, 脚本 = 'scripts/npc/大闹天宫/天庭/基地传进_天庭.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2130, 方向 = 1, 名称 = '天庭上塔传出', x = 138, y = 227, 脚本 = 'scripts/npc/大闹天宫/天庭/上塔传出_天庭.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2130, 方向 = 1, 名称 = '天庭上塔传进', x = 171, y = 212, 脚本 = 'scripts/npc/大闹天宫/天庭/上塔传进_天庭.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2130, 方向 = 1, 名称 = '天庭中塔传出', x = 117, y = 195, 脚本 = 'scripts/npc/大闹天宫/天庭/中塔传出_天庭.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2130, 方向 = 1, 名称 = '天庭中塔传进', x = 141, y = 190, 脚本 = 'scripts/npc/大闹天宫/天庭/中塔传进_天庭.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2130, 方向 = 1, 名称 = '天庭下塔传进', x = 74, y = 179, 脚本 = 'scripts/npc/大闹天宫/天庭/下塔传进_天庭.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2130, 方向 = 1, 名称 = '天庭下塔传出', x = 60, y = 191, 脚本 = 'scripts/npc/大闹天宫/天庭/下塔传出_天庭.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 3124, 方向 = 0, 名称 = '上塔', x = 157.2, y = 220, 脚本 = 'scripts/npc/大闹天宫/天庭/上塔.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 3124, 方向 = 0, 名称 = '中塔', x = 126.5, y = 192, 脚本 = 'scripts/npc/大闹天宫/天庭/中塔.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 3124, 方向 = 0, 名称 = '下塔', x = 71.4, y = 186.6, 脚本 = 'scripts/npc/大闹天宫/天庭/下塔.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2121, 方向 = 1, 名称 = '二郎神', x = 258, y = 193, 脚本 = 'scripts/npc/大闹天宫/二郎神.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2122, 方向 = 1, 称谓 = "天庭", 名称 = '李靖', x = 112, y = 225, 脚本 = 'scripts/npc/大闹天宫/天庭/李靖.lua' },
    { mid = 101385, 分类 = '任务', 外形 = 2123, 方向 = 3, 称谓 = "花果山", 名称 = '孙悟空', x = 363, y = 77, 脚本 = 'scripts/npc/大闹天宫/花果山/孙悟空.lua' },


    {
        mid = 101595,
        分类 = '传送',
        外形 = 2051,
        方向 = 2,
        名称 = '阿飘',
        称谓 = "孤竹城传送人",
        x = 8,
        y = 35,
        脚本 = 'scripts/npc/孤竹城/阿飘.lua'
    },
    {
        mid = 101595,
        分类 = '传送',
        外形 = 2051,
        方向 = 2,
        名称 = '阿飘',
        称谓 = "孤竹城传送人",
        x = 105,
        y = 65,
        脚本 = 'scripts/npc/孤竹城/阿飘.lua'
    },
    {
        mid = 101595,
        分类 = '传送',
        外形 = 2051,
        方向 = 1,
        名称 = '阿飘',
        称谓 = "孤竹城传送人",
        x = 79,
        y = 113,
        脚本 = 'scripts/npc/孤竹城/阿飘.lua'
    },
    {
        mid = 101595,
        分类 = '传送',
        外形 = 2051,
        方向 = 2,
        名称 = '阿飘',
        称谓 = "孤竹城传送人",
        x = 19,
        y = 69,
        脚本 = 'scripts/npc/孤竹城/阿飘.lua'
    },
    {
        mid = 101595,
        分类 = '传送',
        外形 = 2051,
        方向 = 1,
        名称 = '阿飘',
        称谓 = "孤竹城传送人",
        x = 202,
        y = 106,
        脚本 = 'scripts/npc/孤竹城/阿飘.lua'
    },
    {
        mid = 101595,
        分类 = '传送',
        外形 = 2051,
        方向 = 4,
        名称 = '阿飘',
        称谓 = "孤竹城传送人",
        x = 194,
        y = 52,
        脚本 = 'scripts/npc/孤竹城/阿飘.lua'
    },
    {
        mid = 101595,
        分类 = '传送',
        外形 = 2051,
        方向 = 1,
        名称 = '阿飘',
        称谓 = "孤竹城传送人",
        x = 118,
        y = 21,
        脚本 = 'scripts/npc/孤竹城/阿飘.lua'
    },
    {
        mid = 101595,
        分类 = '传送',
        外形 = 2051,
        方向 = 3,
        名称 = '阿飘',
        称谓 = "孤竹城传送人",
        x = 192,
        y = 12,
        脚本 = 'scripts/npc/孤竹城/阿飘.lua'
    },

    {
        mid = 101595,
        分类 = '普通',
        外形 = 3001,
        方向 = 2,
        名称 = '超级巫医',
        x = 12,
        y = 32,
        脚本 = 'scripts/npc/超级巫医.lua'
    },
    {
        mid = 101595,
        分类 = '普通',
        外形 = 3001,
        方向 = 1,
        名称 = '超级巫医',
        x = 34,
        y = 72,
        脚本 = 'scripts/npc/超级巫医.lua'
    },
    {
        mid = 101595,
        分类 = '普通',
        外形 = 3001,
        方向 = 1,
        名称 = '超级巫医',
        x = 202,
        y = 21,
        脚本 = 'scripts/npc/超级巫医.lua'
    },

    --------==================================孤竹城====================
    { mid = 101595, 分类 = '普通', 外形 = 3874, 方向 = 2, 名称 = '生苦', x = 66, y = 55, 脚本 = 'scripts/npc/孤竹城/生苦.lua' }, --十月胎狱，生而为人。呱呱落地，苦厄纷至。入画 罢了
    { mid = 101595, 分类 = '普通', 外形 = 3874, 方向 = 2, 名称 = '老苦', x = 136, y = 71, 脚本 = 'scripts/npc/孤竹城/老苦.lua' }, --公道世间惟白发，贵人头上不曾饶。入画 罢了
    { mid = 101595, 分类 = '普通', 外形 = 3874, 方向 = 1, 名称 = '病苦', x = 60, y = 119, 脚本 = 'scripts/npc/孤竹城/病苦.lua' }, --垂死病中惊坐起，暗风吹雨入寒窗。入画 罢了
    { mid = 101595, 分类 = '普通', 外形 = 3874, 方向 = 1, 名称 = '死苦', x = 28, y = 71, 脚本 = 'scripts/npc/孤竹城/死苦.lua' }, --城廊为山林，庭宇生荆艾。白骨不知谁，纵横莫覆盖。入画(普通模式)入画(困难模式)罢了
    { mid = 101595, 分类 = '普通', 外形 = 3874, 方向 = 2, 名称 = '求不得苦', x = 157, y = 119, 脚本 = 'scripts/npc/孤竹城/求不得苦.lua' }, --机关算尽太聪明,反误了卿卿性命。入画(普通模式)入画(困难模式)罢了
    { mid = 101595, 分类 = '普通', 外形 = 3875, 方向 = 2, 名称 = '爱离别苦', x = 208.5, y = 74, 脚本 = 'scripts/npc/孤竹城/爱离别苦.lua' }, --漫漫百年,一人难免孤寂。你们愿与我聊聊么？愿意。任性跳过(可花费10万两银子跳过此关，正常获得此关奖励 少陪)
    { mid = 101595, 分类 = '普通', 外形 = 3874, 方向 = 1, 名称 = '五阴炽盛苦', x = 136, y = 34, 脚本 = 'scripts/npc/孤竹城/五阴炽盛苦.lua' }, --若以色见我，以音声求我，是人行邪道，不能见如来。入画(普通模式)入画(困难模式)入画(卓越模式)罢了
    { mid = 101595, 分类 = '普通', 外形 = 3874, 方向 = 2, 名称 = '怨憎会苦', x = 187, y = 25, 脚本 = 'scripts/npc/孤竹城/怨憎会苦.lua' }, --世人薄俗，遂成大怨。两刀相向，不知胜负，当尔之时，怖畏无量。入画(普通模式)入画(困难模式)入画(卓越模式)罢了

    --任务目的:#r孤竹城有八苦，画师将其封存于壁画。画中人生生世世，永堕这世间苦。请按顺序去挑战：#r#r#G生苦,老苦，病苦，死苦，求不得苦，爱离别苦，五阴炽盛苦，怨憎会苦 (通过为红色)#r#r#Y温馨提示：#r#W爱离别苦为特殊玩法官咖，可以消耗银两跳过：#r五阴炽盛苦与怨憎会苦关卡为可以选择高难度调整，奖励更加丰厚。




    --------==================================种族比武场====================
    -- { mid = 031197, 分类 = '普通', 外形 = 3061, 方向 = 2, 名称 = '比武大使', x = 89, y = 61,
    --     脚本 = 'scripts/npc/比武场/种族比武/比武大使_人.lua' },
    -- { mid = 041197, 分类 = '普通', 外形 = 3061, 方向 = 2, 名称 = '比武大使', x = 89, y = 61,
    --     脚本 = 'scripts/npc/比武场/种族比武/比武大使_魔.lua' },
    -- { mid = 051197, 分类 = '普通', 外形 = 3061, 方向 = 2, 名称 = '比武大使', x = 89, y = 61,
    --     脚本 = 'scripts/npc/比武场/种族比武/比武大使_仙.lua' },


}

return list
