-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-26 07:12:31
-- @Last Modified time  : 2022-09-05 19:58:42

local 战斗 = {
    是否惩罚 = false --死亡
}


--===============================================

function 战斗:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性 = {}

    怪物属性 = {
        外形 = 12004,
        名称 = "修罗小妖",
        等级 = 等级,
        气血 = 328454 + 转生 * 200000 + 等级 * 10000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 21954 + 转生 * 1200 + 等级 * 100,
        速度 = 300 + 等级 * 3,
        抗性 = {
            物理吸收 = 20,
            抗水 = 47,
            抗雷 = 47,
            抗火 = 47,
            抗风 = 47,
            抗震慑 = 39,
            抗混乱 = 65,
            抗封印 = 85,
            抗昏睡 = 72
        },
        技能 = {
            { 名称 = "阎罗追命", 熟练度 = 25000 },
            { 名称 = "魔音摄心", 熟练度 = 25000 },
            { 名称 = "阎罗追命", 熟练度 = 25000 }
        },
        施法几率 = 50,
        是否消失 = false,

    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 12004,
        名称 = "修罗小妖",
        等级 = 等级,
        气血 = 258454 + 转生 * 100000 + 等级 * 5000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 554 + 转生 * 1200 + 等级 * 100,
        速度 = 80 + 等级 * 1,
        抗性 = {
            抗震慑 = 19,
            抗水 = -180,
            抗雷 = -30,
            抗火 = -30,
            抗风 = -180,
            抗混乱 = 52,
            抗封印 = 66,
            抗中毒 = 30,
            抗昏睡 = 65
        },
        技能 = {
            { 名称 = "雷神怒击", 熟练度 = 15000 },
            { 名称 = "电闪雷鸣", 熟练度 = 15000 },
        },
        施法几率 = 20,
        是否消失 = false,
    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 12004,
        名称 = "修罗小妖",
        等级 = 等级,
        气血 = 258454 + 转生 * 100000 + 等级 * 5000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 1954 + 转生 * 1200 + 等级 * 100,
        速度 = 170 + 等级 * 2,
        抗性 = {
            抗水 = -39.7,
            抗雷 = -139.7,
            抗火 = -139.7,
            抗风 = 139,
            抗震慑 = 31,
            抗混乱 = 52,
            抗封印 = 66,
            抗中毒 = 30,
            抗昏睡 = 65
        },

        技能 = {
            { 名称 = "谗言相加", 熟练度 = 15000 },
            { 名称 = "借刀杀人", 熟练度 = 15000 },

        },
        施法几率 = 20,
        是否消失 = false,

    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 12004,
        名称 = "修罗小妖",
        等级 = 等级,
        气血 = 258454 + 转生 * 100000 + 等级 * 5000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 1954 + 转生 * 1200 + 等级 * 100,
        速度 = 250 + 等级 * 2,
        抗性 = {
            抗水 = -139.7,
            抗雷 = -139.7,
            抗火 = -139.7,
            抗风 = 30,
            抗震慑 = 31,
            抗混乱 = 52,
            抗封印 = 66,
            抗中毒 = 30,
            抗昏睡 = 65
        },

        技能 = {
            { 名称 = "离魂咒", 熟练度 = 15000 },
            { 名称 = "迷魂醉", 熟练度 = 15000 },

        },
        施法几率 = 20,
        是否消失 = false,

    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 12004,
        名称 = "修罗小妖",
        等级 = 等级,
        气血 = 258454 + 转生 * 100000 + 等级 * 5000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 1954 + 转生 * 1200 + 等级 * 100,
        速度 = 30,
        抗性 = { 抗震慑 = 19,
            抗水 = -30,
            抗雷 = -30,
            抗火 = -30,
            抗风 = -30,
            抗毒伤害 = -1000,
            抗混乱 = 52,
            抗封印 = 66,
            抗中毒 = 30,
            抗昏睡 = 65,
            狂暴几率 = 100,
            命中率 = 100,
            忽视防御程度 = 60,
            忽视防御几率 = 60 },
        技能 = {
            { 名称 = "魔音摄心", 熟练度 = 15000 },
            { 名称 = "兽王之力", 熟练度 = 15000 },
        },
        施法几率 = 20,
        是否消失 = false,
    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 12004,
        名称 = "修罗小妖",
        等级 = 等级,
        气血 = 258454 + 转生 * 100000 + 等级 * 5000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 554 + 转生 * 1200 + 等级 * 100,
        速度 = 140 + 等级 * 2,
        抗性 = {
            抗震慑 = 19,
            抗水 = -180,
            抗雷 = -12,
            抗火 = -180,
            抗风 = -180,
            抗混乱 = 52,
            抗封印 = 66,
            抗中毒 = 30,
            抗昏睡 = 65
        },
        技能 = {
            { 名称 = "魔音摄心", 熟练度 = 15000 },
            { 名称 = "楚楚可怜", 熟练度 = 15000 },
        },
        施法几率 = 20,
        是否消失 = false,
    }
    self:加入敌方(6, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 12004,
        名称 = "修罗小妖",
        等级 = 等级,
        气血 = 258454 + 转生 * 100000 + 等级 * 5000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 1954 + 转生 * 1200 + 等级 * 100,
        速度 = 28 + 等级 * 1,
        抗性 = {
            抗震慑 = 19,
            抗水 = -180,
            抗雷 = -30,
            抗火 = -180,
            抗风 = -180,
            抗鬼火 = -180,
            抗毒伤害 = -1000,
            抗混乱 = 30,
            抗封印 = 30,
            抗中毒 = 30,
            抗昏睡 = 30
        },
        技能 = {
            { 名称 = "谗言相加", 熟练度 = 6895 },
            { 名称 = "离魂咒", 熟练度 = 6895 },
        },
        施法几率 = 20,
        是否消失 = false,

    }
    self:加入敌方(7, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 12004,
        名称 = "修罗小妖",
        等级 = 等级,
        气血 = 258454 + 转生 * 100000 + 等级 * 5000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 554 + 转生 * 1200 + 等级 * 100,
        速度 = 194 + 等级 * 3,
        抗性 = {
            抗震慑 = 19,
            抗水 = -180,
            抗雷 = -180,
            抗火 = -180,
            抗风 = -20,
            抗混乱 = 52,
            抗封印 = 66,
            抗中毒 = 30,
            抗昏睡 = 65
        },
        技能 = {
            { 名称 = "魔音摄心", 熟练度 = 15000 },
            { 名称 = "狮王之怒", 熟练度 = 15000 },
        },
        施法几率 = 20,
        是否消失 = false,
    }
    self:加入敌方(8, 生成战斗怪物(怪物属性))








end

function 战斗:进场喊话()

end

function 战斗:战斗回合开始(v)

end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end


local function 掉落包(玩家)




end

function 战斗:战斗结束(s)

end

return 战斗
