local 任务 = {
    名称 = '转生任务3',
    别名 = '转生重来',
    类型 = '转生任务',
    是否可取消 = false,
}

function 任务:任务初始化()
    self.进度 = 1
    self.对话进度 = 0
end

local _描述 = {
    "#W你感到周身圆满，修为再难寸进，隐约有一丝阴霾缠绕心头，去找#G孟婆#W谈谈吧",
    "找#G地藏王#W索取生死符。",
    "去白骨山打败#G罗刹女#W获得生死符。",
    "去找#Y玄阴仙子#W借#G月光宝盒#W一用。",
    "回地府找#G孟婆#W。",
}

function 任务:任务取详情()
    return _描述[self.进度]
end

local _台词 = {
    "好孩子，找来月光宝盒和地藏王菩萨的生死符，婆婆就给你做碗汤喝，你就可以重新再来啦。",
    "你可是来取生死符的么？不过你来晚了，生死符昨夜被白骨山的罗刹女盗去了。能否打败他取回生死符就看你的造化了。",
    "臭贼！快将地藏王菩萨的生死符交出来心#47！",
    "有本事就从姑奶奶这里拿走#28！",
    "上仙果然法力高强#83，这生死符我就交给你了#17",
}

local _菜单1 = [[
人生一世，草木一春。孩子，你可以选择重新来过。要投胎转世么？
#R注意：转生完毕请立即重新进入游戏。
menu
1|好的，我做好准备了
99|不，我还有心愿未了
]]

local _菜单2 = [[
玄阴之气充满玄阴宝鉴，时空之门就会立刻开启，届时大闹天宫就会开启。
menu
1|仙子姐姐，借你的月光宝盒一用（扣除5000000银两）
99|我就是来看看你
]]

function 任务:任务NPC对话(玩家, NPC)
    if NPC.名称 == "孟婆" then
        if self.进度 == 1 then
            NPC.台词 = _台词[1]
            self.进度 = 2
        elseif self.进度 == 5 then
            local r = 玩家:转生条件检测()
            if r then
                NPC.台词 = r
                return
            end
            local 物品1 = 玩家:取物品是否存在("生死符")
            local 物品2 = 玩家:取物品是否存在("月光宝盒")
            if not 物品1 or not 物品2 then
                NPC.台词 = "我要的东西呢？"
                return
            end
            NPC.台词 = _菜单1
        end
    elseif NPC.名称 == "地藏王" then
        if self.进度 == 2 then
            NPC.台词 = _台词[2]
            self.进度 = 3
        end
    elseif NPC.名称 == "罗刹女" then
        if self.进度 == 3 then
            if self.对话进度 == 0 or not self.对话进度 then
                NPC.台词 = _台词[3]
                NPC.头像 = 玩家.原形
                NPC.结束 = false
                self.对话进度 = 1
            elseif self.对话进度 == 1 then
                NPC.台词 = _台词[4]
                NPC.头像 = NPC.外形
                NPC.结束 = false
                self.对话进度 = 2
            elseif self.对话进度 == 2 then
                NPC.台词 = nil
                NPC.结束 = nil
                self.对话进度 = 0
                self:任务攻击事件(玩家, NPC)
            end
        end
    elseif NPC.名称 == "玄阴仙子" then
        if self.进度 == 4 then
            NPC.台词 = _菜单2
        end
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if NPC.名称 == "孟婆" then
        if self.进度 == 5 then
            if i == "1" then
                local 种族, 性别, 外形 = 玩家:转生窗口()
                if 种族 then
                    local r = 玩家:转生条件检测(性别, 外形)
                    if r then
                        NPC.台词 = r
                        return
                    end
                    local 物品1 = 玩家:取物品是否存在("生死符")
                    local 物品2 = 玩家:取物品是否存在("月光宝盒")
                    print(物品1, 物品2)
                    if not 物品1 or not 物品2 then
                        NPC.台词 = "我要的东西呢？"
                        return
                    end
                    物品1:减少(1)
                    物品2:减少(1)
                    玩家:转生处理(种族, 性别, 外形)
                    玩家:最后对话("转生成功，请重新登录游戏。")
                    self:删除()
                end
            end
        end
    elseif NPC.名称 == "玄阴仙子" then
        if self.进度 == 4 then
            if i == "1" then
                if 玩家.银子 < 5000000 then
                    NPC.台词 = "你没有那么多银子，准备好500W再来找我吧！"
                    return
                end
                local 添加物品 = 玩家:添加物品({ 生成物品 { 名称 = '月光宝盒', 数量 = 1, 任务物品 = 1, 禁止交易 = true } })
                if 添加物品 then
                    玩家:扣除银子(5000000)
                    self.进度 = 5
                else
                    NPC.台词 = "包裹空间不足！"
                end
            end
        end
    end
end

function 任务:任务攻击事件(玩家, NPC)
    if NPC.名称 == '罗刹女' then
        if self.进度 == 3 then
            local r = 玩家:进入战斗('scripts/task/转生任务/转生任务3.lua', NPC)
            if r then
                for _, v in 玩家:遍历队伍(玩家) do
                    local 任务 = v:取任务(self.名称)
                    if 任务 and 任务.进度 == 3 then
                        local 添加物品 = v:添加物品({ 生成物品 { 名称 = '生死符', 数量 = 1, 任务物品 = 1, 禁止交易 = true } })
                        if 添加物品 then
                            任务.进度 = 4
                            NPC.台词 = '上仙果然法力高强#83，这生死符我就交给你了#17'
                            NPC.头像 = NPC.外形
                            NPC.结束 = nil
                            v:最后对话(NPC.台词, NPC.头像, NPC.nid, NPC.结束)
                        end
                    end
                end
            else
                self.对话进度 = 0
            end
        end
    end
end

local _小怪外形 = {
    [1] = 0,
    [2] = 0048,
    [3] = 0048,
    [4] = 0048,
    [5] = 0047,
    [6] = 0047,
    [7] = 0047,
    [8] = 0046,
    [9] = 0046,
    [10] = 0046,
}

function 任务:战斗初始化(玩家, NPC)
    for i = 1, 1 do
        local r = 生成战斗怪物 {
            外形 = NPC.外形,
            名称 = NPC.名称,
            等级 = 142,
            攻击 = 30000,
            速度 = 700,
            气血 = 180000,
            魔法 = 12000,
            是否消失 = false,
            抗性 = {
                物理吸收 = 50,
                抗雷 = 50,
                抗火 = 50,
                抗水 = 50,
                抗风 = 50,
                反击几率 = 50,
                反击次数 = 3,

            },
            技能 = {
                { 名称 = "万毒攻心", 熟练度 = 25000 },
                { 名称 = "鹤顶红粉", 熟练度 = 25000 },
                { 名称 = "含情脉脉", 熟练度 = 25000 },
                { 名称 = "魔神护体", 熟练度 = 25000 },
                { 名称 = "乾坤借速", 熟练度 = 25000 },
                { 名称 = "天外飞魔", 熟练度 = 25000 },

            },
        }
        self:加入敌方(i, r)
    end

    for i = 2, 10 do
        local r = 生成战斗怪物 {
            外形 = _小怪外形[i],
            名称 = "罗刹宝宝",
            等级 = 142,
            攻击 = 30000,
            速度 = 700,
            气血 = 180000,
            魔法 = 12000,
            是否消失 = false,
            抗性 = {
                物理吸收 = 50,
                抗雷 = 50,
                抗火 = 50,
                抗水 = 50,
                抗风 = 50,
                反击几率 = 50,
                反击次数 = 3,

            },
            技能 = {
                { 名称 = "四面楚歌", 熟练度 = 15000 },
                { 名称 = "万毒攻心", 熟练度 = 15000 },
                { 名称 = "失心狂乱", 熟练度 = 15000 },
                { 名称 = "百日眠", 熟练度 = 15000 },
                { 名称 = "阎罗追命", 熟练度 = 15000 },
                { 名称 = "魔神附身", 熟练度 = 15000 },
                { 名称 = "含情脉脉", 熟练度 = 15000 },
                { 名称 = "乾坤借速", 熟练度 = 15000 },
                { 名称 = "袖里乾坤", 熟练度 = 15000 },
                { 名称 = "九阴纯火", 熟练度 = 15000 },
                { 名称 = "天诛地灭", 熟练度 = 15000 },
                { 名称 = "九龙冰封", 熟练度 = 15000 },

            },





            内丹 = { { 技能 = "浩然正气", 转生 = 3, 等级 = 170 } },
        }



        self:加入敌方(i, r)
    end
end

function 任务:战斗回合开始(dt)
end

function 任务:战斗结束(s)
end

return 任务
