local 事件 = {
    名称 = '天宫寻宝',
    类型 = '日常任务',
    是否打开 = true,
    是否可接任务 = true,
    开始时间 = os.time { year = 2022, month = 7, day = 25, hour = 0, min = 0, sec = 00 },
    结束时间 = os.time { year = 2099, month = 7, day = 30, hour = 0, min = 0, sec = 00 }
}

function 事件:事件初始化()
    -- 开启时间：每周四中午12点到晚上22点
    if os.date('%w', os.time()) == '4' then
        local year = tonumber(os.date('%Y', os.time()))
        local month = tonumber(os.date('%m', os.time()))
        local day = tonumber(os.date('%d', os.time()))
        -- self.开始时间 = os.time { year = year, month = month, day = day, hour = 12, min = 00, sec = 00 }
        -- self.结束时间 = os.time { year = year, month = month, day = day, hour = 22, min = 00, sec = 00 }
    end
end

function 事件:生成副本()
    self.副本 = {}
    -- 宝库一层
    self.副本[1] = self:生成地图(1197)
    self.副本[1]:添加NPC {
        名称 = "退场传送人",
        外形 = 3043,
        称谓 = '天宫宝库',
        方向 = 3,
        脚本 = 'scripts/npc/限时活动/天宫寻宝/退场传送人.lua',
        X = 144,
        Y = 17,
    }
    -- 宝库一层守卫
    self.副本[1]:添加NPC {
        名称 = "宝库守卫",
        外形 = 2130,
        称谓 = '天宫宝库',
        脚本 = 'scripts/npc/限时活动/天宫寻宝/宝库守卫.lua',
        X = 76,
        Y = 53,
    }
    -- 宝库二层
    self.副本[2] = self:生成地图(1293)
    self.副本[2]:添加NPC {
        名称 = "退场传送人",
        外形 = 3043,
        称谓 = '天宫宝库',
        方向 = 3,
        脚本 = 'scripts/npc/限时活动/天宫寻宝/退场传送人.lua',
        X = 114,
        Y = 10,
    }
    -- 宝库二层守卫
    self.副本[2]:添加NPC {
        名称 = "宝库守卫",
        外形 = 2130,
        称谓 = '天宫宝库',
        脚本 = 'scripts/npc/限时活动/天宫寻宝/宝库守卫.lua',
        X = 62,
        Y = 36,
    }
    -- 宝库三层
    self.副本[3] = self:生成地图(1294)
    self.副本[3]:添加NPC {
        名称 = "退场传送人",
        外形 = 3043,
        称谓 = '天宫宝库',
        脚本 = 'scripts/npc/限时活动/天宫寻宝/退场传送人.lua',
        X = 64,
        Y = 48,
    }
end

local _主怪信息 = {
    [1] = { 名称 = '守财奴', 模型 = 2293, 数量 = 30 },
    [2] = { 名称 = '', 模型 = 6617, 数量 = 30 },
}

function 事件:取怪物数量(map, 名称)
    local 数量 = 0
    for k, v in map:遍历NPC() do
        if v.名称 == 名称 then
            数量 = 数量 + 1
        end
    end
    return 数量
end

function 事件:清除所有怪物()
    for ii, vv in ipairs(self.副本) do
        local map = vv
        for i = 1, #_主怪信息 do
            for k, v in map:遍历NPC() do
                if v.名称 == _主怪信息[i].名称 then
                    v:删除()
                end
            end
        end
    end
end

function 事件:更新()
    if self.是否结束 then
        return
    end
    if not self.副本 then
        self:生成副本()
    end

    self:清除所有怪物()
    self.时间 = os.time() + 30 * 60
    for ii, vv in pairs(self.副本) do
        local map = vv -- 副本地图
        for i = 1, #_主怪信息 do
            local 刷新数量 = _主怪信息[i].数量
            for _ = 1, 刷新数量 do
                local 方向 = math.random(1, 4)
                local X, Y = map:取随机坐标()
                local NPC = map:添加NPC {
                    名称 = _主怪信息[i].名称,
                    外形 = _主怪信息[i].模型,
                    方向 = 方向,
                    脚本 = 'scripts/event/挑战_天宫寻宝.lua',
                    时间 = self.时间,
                    X = X,
                    Y = Y,
                    来源 = self
                }
            end
        end
    end
    发送系统("#C天地豪杰勇气令人称赞，为示嘉奖，玉帝特命天赎星君带路，引导群豪入天宫宝库恣意搜寻。现天宫宝库已经开放，请各路豪杰抓紧时间入库寻宝。")

    return not self.是否结束 and 1800
end

function 事件:事件开始()
    self:更新()
    self:定时(1800, self.更新)
    print('天宫寻宝活动开始')
end

function 事件:事件结束()
    self.是否结束 = true
    self:清除所有怪物()
    print('天宫寻宝活动结束')
end

function 事件:进入副本(玩家)
    if not self.开始时间 or os.time() < self.开始时间 then
        return '还没有到活动开始时间。'
    end
    if os.time() >= self.结束时间 then
        return '本次活动已经结束。'
    end
    if not self.副本 then
        return
    end
    local 层数 = 1
    for i, v in ipairs(self.副本) do
        if v.id == 玩家.地图 then
            层数 = i + 1
        end
    end
    if 层数 == 1 then
        local 副本 = self.副本[层数]
        玩家:进入副本(副本.id, 78, 54)
    elseif 层数 == 2 then
        local 副本 = self.副本[层数]
        玩家:进入副本(副本.id, 66, 36)
    elseif 层数 == 3 then
        local 副本 = self.副本[层数]
        玩家:进入副本(副本.id, 68, 48)
    end
end

--=======================================================
function 事件:NPC对话(玩家, i, NPC)
    if NPC.战斗中 then
        return
    end
    NPC.战斗中 = true
    local r = 玩家:进入战斗('scripts/event/挑战_天宫寻宝.lua', NPC)
    if r then
        self:完成(玩家, NPC)
        NPC:删除()
    else
        NPC.战斗中 = false
    end
end

function 事件:NPC菜单(玩家, i, NPC)
end

--===============================================

local _守财奴 = {
    { 名称 = '守财奴', 外形 = 2293, 等级 = 60, 气血 = 442587, 魔法 = 187000, 攻击 = 8500, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '失心狂乱' }, 熟练度 = 3000, 施法几率 = 80 },
    { 名称 = '守财奴', 外形 = 2293, 等级 = 60, 气血 = 442587, 魔法 = 187000, 攻击 = 8500, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '万毒攻心' }, 熟练度 = 3000, 施法几率 = 80 },
    { 名称 = '守财奴', 外形 = 2293, 等级 = 60, 气血 = 442587, 魔法 = 187000, 攻击 = 8500, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '九龙冰封' }, 熟练度 = 3000, 施法几率 = 80 },
    { 名称 = '守财奴', 外形 = 2293, 等级 = 60, 气血 = 442587, 魔法 = 187000, 攻击 = 8500, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '九阴纯火' }, 熟练度 = 3000, 施法几率 = 80 },
    { 名称 = '守财奴', 外形 = 2293, 等级 = 60, 气血 = 442587, 魔法 = 187000, 攻击 = 8500, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '天诛地灭' }, 熟练度 = 3000, 施法几率 = 80 },
    { 名称 = '守财奴', 外形 = 2293, 等级 = 60, 气血 = 442587, 魔法 = 187000, 攻击 = 8500, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '袖里乾坤' }, 熟练度 = 3000, 施法几率 = 80 },
}

local _盒子怪 = {
    {
        名称 = '贪婪鬼',
        外形 = 0046,
        等级 = 100,
        气血 = 962587,
        魔法 = 207000,
        攻击 = 12500,
        速度 = 580,
        抗性 = { 抗混乱 = 80, 抗昏睡 = 80, 抗封印 = 80, 抗震慑 = 18 },
        技能 = { { 名称 = "九龙冰封", 熟练度 = 10000 }, { 名称 = "九阴纯火", 熟练度 = 10000 } },
        施法几率 = 80,
    },
    {
        名称 = '黄金兽',
        外形 = 2097,
        等级 = 100,
        气血 = 662587,
        魔法 = 207000,
        攻击 = 32500,
        速度 = 730,
        抗性 = { 木 = 100, 忽视防御几率 = 100, 忽视物理防御程度 = 50, 反击率 = 30, 反击次数 = 3, 抗混乱 = 50, 抗昏睡 = 80, 抗封印 = 50, 抗震慑 = 16 }
    },
    { 名称 = '水灵仙', 外形 = 2100, 等级 = 100, 气血 = 452587, 魔法 = 287000, 攻击 = 10500, 速度 = 620, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 12 }, 技能 = { '天诛地灭', '袖里乾坤' }, 熟练度 = 18000, 施法几率 = 80 },
    { 名称 = '符咒女娲', 外形 = 2292, 等级 = 100, 气血 = 652587, 魔法 = 287000, 攻击 = 10500, 速度 = 820, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 12 }, 技能 = { '魔神附身', '阎罗追命' }, 熟练度 = 13000, 施法几率 = 80 },
    { 名称 = '金刚仙', 外形 = 2098, 等级 = 100, 气血 = 452587, 魔法 = 287000, 攻击 = 10500, 速度 = 720, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 12 }, 技能 = { '九龙冰封', '九阴纯火' }, 熟练度 = 18000, 施法几率 = 80 },
    { 名称 = '碧桃仙子', 外形 = 2096, 等级 = 100, 气血 = 652587, 魔法 = 287000, 攻击 = 10500, 速度 = 680, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 12 }, 技能 = { '万毒攻心', '百日眠' }, 熟练度 = 1000, 施法几率 = 80 },
    { 名称 = '青衣仙子', 外形 = 2067, 等级 = 100, 气血 = 652587, 魔法 = 287000, 攻击 = 30500, 速度 = 620, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 12, 忽视防御几率 = 100, 忽视物理防御程度 = 50, 反击率 = 60, 反击次数 = 9 } },
}

function 事件:战斗初始化(玩家, NPC)
    if NPC.名称 == '守财奴' then
        for i, v in ipairs(_守财奴) do
            local r = 生成战斗怪物(v)
            self:加入敌方(i, r)
        end
    end
    if NPC.名称 == '' then
        for i, v in ipairs(_盒子怪) do
            local r = 生成战斗怪物(v)
            self:加入敌方(i, r)
        end
    end
end

function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end

function 事件:完成(玩家, NPC)
    for k, v in 玩家:遍历队伍() do
        self:掉落包(v, NPC)
    end
end

local _广播 = {
    [1] = "#R%s#C鸿运当头，在#Y天宫寻宝#C活动中，获得#G#m(%s)[%s]#m#n#28",
    [2] = "#R%s#C在天地宝库中威武霸气，轻松击败守卫，还从对方的私藏中拿走#G#m(%s)[%s]#m#n#C作为战利品#99",
}

function 事件:掉落包(玩家, NPC)
    if 玩家:取活动限制次数('天宫寻宝') >= 10 then
        return
    end

    玩家:增加活动限制次数('天宫寻宝')

    local 掉落包 = 取掉落包('副本', '天宫寻宝')
    if 掉落包 then
        if NPC.名称 == '守财奴' then
            local 经验 = 3500000
            玩家:添加任务经验(经验)
            奖励掉落包物品(玩家, 掉落包[1], _广播[1])
        else
            local 经验 = 7500000
            玩家:添加任务经验(经验)
            奖励掉落包物品(玩家, 掉落包[2], _广播[1])
        end
    end
end

return 事件
