local 事件 = {
    名称 = '城东魅影',
    类型 = '活动',
    是否打开 = true,
    是否可接任务 = true,
}

function 事件:事件初始化()
    if os.date('%w', os.time()) == '1' then
        print('星期一，开启城东魅影活动')
        local year = tonumber(os.date('%Y', os.time()))
        local month = tonumber(os.date('%m', os.time()))
        local day = tonumber(os.date('%d', os.time()))
        self.开始时间 = os.time { year = year, month = month, day = day, hour = 08, min = 00, sec = 00 }
        self.结束时间 = os.time { year = year, month = month, day = day, hour = 22, min = 00, sec = 00 }
        self.是否结束 = false
    end
end

local _主怪信息 = {
    [1] = { 名称 = '木魅', 模型 = 2095, 数量 = 40 },
    [2] = { 名称 = '木魅花魁', 模型 = 2096, 数量 = 20 },
}

function 事件:取怪物数量(名称)
    local 数量 = 0
    local map = self:取地图(1193)
    for k, v in map:遍历NPC() do
        if v.名称 == 名称 then
            数量 = 数量 + 1
        end
    end
    return 数量
end

function 事件:清除所有怪物()
    local map = self:取地图(1193)
    for i = 1, #_主怪信息 do
        for k, v in map:遍历NPC() do
            if v.名称 == _主怪信息[i].名称 then
                v:删除()
            end
        end
    end
end

function 事件:更新()
    if self.是否结束 then
        return
    end
    local map = self:取地图(1193)
    self.时间 = os.time() + 30 * 60
    for i = 1, #_主怪信息 do
        for k, v in map:遍历NPC() do
            if v.名称 == _主怪信息[i].名称 then
                v:删除()
            end
        end

        local 刷新数量 = _主怪信息[i].数量
        for _ = 1, 刷新数量 do
            local 方向 = math.random(1, 4)
            local X, Y = map:取随机坐标()
            local NPC = map:添加NPC {
                名称 = _主怪信息[i].名称,
                外形 = _主怪信息[i].模型,
                称谓 = '城东魅影',
                方向 = 方向,
                脚本 = 'scripts/event/活动2_城东魅影.lua',
                时间 = self.时间,
                X = X,
                Y = Y,
                来源 = self
            }
        end
    end
    self:发送系统('#Y【斩妖除魔】#C大量成年的树妖，终于修道得到，羽化为木魁，前来作怪。#C请各位侠士前往#Y长安城东#C前去除妖。！')
    return 1800
end

function 事件:事件开始()
    self:更新()
    self:定时(1800, self.更新)
    print('城东魅影活动开始')
end

function 事件:事件结束()
    self.是否结束 = true
    self:清除所有怪物()
    print('城东魅影活动结束')
end

--=======================================================
local 对话 = [[
没想到我躲在这里，也会被你们发现，休想抓我回去。#4
menu
1|妖孽，受死吧
2|我认错人了
]]

function 事件:NPC对话(玩家, NPC)
    return 对话
end

function 事件:NPC菜单(玩家, i, NPC)
    if NPC and NPC:是否战斗中() then
        return "我正在战斗中"
    end
    if i == '1' then
        if not NPC:是否战斗中() then
            if i == '1' then
                NPC:进入战斗(true)
                local r = 玩家:进入战斗('scripts/event/活动2_城东魅影.lua', NPC)
                NPC:进入战斗(false)
                if r then
                    self:完成(玩家, NPC)
                    NPC:删除()
                end
            end
        else
            return "我正在战斗中"
        end
    end
end

--===============================================

local _小怪 = {
    {
        名称 = '木魅',
        外形 = 2095,
        等级 = 80,
        气血 = 262587,
        魔法 = 107000,
        攻击 = 5500,
        速度 = 530,
        技能 = { { 名称 = "九龙冰封", 熟练度 = 10000 }, { 名称 = "九阴纯火", 熟练度 = 10000 } },
        施法几率 = 80
    },
    { 名称 = '落魄仙', 外形 = 0, 等级 = 80, 气血 = 182587, 魔法 = 87000, 攻击 = 3500, 速度 = 400, 技能 = { { 名称 = '天诛地灭', 熟练度 = 5000 }, { 名称 = '袖里乾坤', 熟练度 = 5000 } }, 施法几率 = 50 },
    { 名称 = '落魄仙', 外形 = 0, 等级 = 80, 气血 = 182587, 魔法 = 87000, 攻击 = 3500, 速度 = 400, 技能 = { { 名称 = '九龙冰封', 熟练度 = 5000 }, { 名称 = '九阴纯火', 熟练度 = 5000 } }, 施法几率 = 50 },
    { 名称 = '失魂魔', 外形 = 0, 等级 = 80, 气血 = 182587, 魔法 = 87000, 攻击 = 3500, 速度 = 400, 技能 = { { 名称 = '魔神附身', 熟练度 = 5000 }, { 名称 = '阎罗追命', 熟练度 = 5000 } }, 施法几率 = 50 },
    { 名称 = '失魂魔', 外形 = 0, 等级 = 80, 气血 = 182587, 魔法 = 87000, 攻击 = 3500, 速度 = 400, 技能 = { { 名称 = '含情脉脉', 熟练度 = 5000 }, { 名称 = '阎罗追命', 熟练度 = 5000 } }, 施法几率 = 50 },
    { 名称 = '无心人', 外形 = 0, 等级 = 80, 气血 = 182587, 魔法 = 87000, 攻击 = 3500, 速度 = 400, 技能 = { { 名称 = '百日眠', 熟练度 = 5000 }, { 名称 = '失心狂乱', 熟练度 = 5000 } }, 施法几率 = 80 },
    { 名称 = '无心人', 外形 = 0, 等级 = 80, 气血 = 182587, 魔法 = 87000, 攻击 = 3500, 速度 = 400, 技能 = { { 名称 = '离魂咒', 熟练度 = 5000 }, { 名称 = '百日眠', 熟练度 = 5000 } }, 施法几率 = 50 },
    { 名称 = '无心人', 外形 = 0, 等级 = 80, 气血 = 182587, 魔法 = 87000, 攻击 = 3500, 速度 = 400, 技能 = { { 名称 = '借刀杀人', 熟练度 = 5000 }, { 名称 = '失心狂乱', 熟练度 = 5000 } }, 施法几率 = 80 },
}

local _精英 = {
    {
        名称 = '木魅花魁',
        外形 = 2096,
        等级 = 120,
        气血 = 1662587,
        魔法 = 1207000,
        攻击 = 52500,
        速度 = 730,
        技能 = { { 名称 = "九龙冰封", 熟练度 = 15000 }, { 名称 = "九阴纯火", 熟练度 = 15000 } },
        施法几率 = 80
    },
    {
        名称 = '花魁',
        外形 = 2096,
        等级 = 120,
        气血 = 462587,
        魔法 = 207000,
        攻击 = 12500,
        速度 = 530,
        技能 = { { 名称 = "九龙冰封", 熟练度 = 8000 }, { 名称 = "九阴纯火", 熟练度 = 8000 } },
        施法几率 = 80,
    },
    {
        名称 = '花魁',
        外形 = 2096,
        等级 = 120,
        气血 = 462587,
        魔法 = 207000,
        攻击 = 12500,
        速度 = 530,
        技能 = { { 名称 = "天诛地灭", 熟练度 = 8000 }, { 名称 = "袖里乾坤", 熟练度 = 8000 } },
        施法几率 = 80,
    },
    {
        名称 = '木魅',
        外形 = 2095,
        等级 = 120,
        气血 = 462587,
        魔法 = 207000,
        攻击 = 32500,
        速度 = 530,
        抗性 = { 木 = 100, 忽视防御几率 = 100, 忽视物理防御程度 = 50, 反击率 = 30, 反击次数 = 3, 抗混乱 = 50, 抗昏睡 = 50, 抗封印 = 50, 抗震慑 = 16 }
    },
    {
        名称 = '木魅',
        外形 = 2095,
        等级 = 120,
        气血 = 462587,
        魔法 = 207000,
        攻击 = 32500,
        速度 = 530,
        抗性 = { 木 = 100, 忽视防御几率 = 100, 忽视物理防御程度 = 50, 反击率 = 30, 反击次数 = 3, 抗混乱 = 50, 抗昏睡 = 50, 抗封印 = 50, 抗震慑 = 16 }
    },
    { 名称 = '落魄仙', 外形 = 0, 等级 = 100, 气血 = 322587, 魔法 = 287000, 攻击 = 38500, 速度 = 440, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 10 }, 技能 = { { 名称 = '天诛地灭', 熟练度 = 8000 }, { 名称 = '袖里乾坤', 熟练度 = 8000 } }, 熟练度 = 6000, 施法几率 = 80 },
    { 名称 = '失魂魔', 外形 = 0, 等级 = 100, 气血 = 322587, 魔法 = 287000, 攻击 = 38500, 速度 = 440, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 10 }, 技能 = { { 名称 = '魔神附身', 熟练度 = 8000 }, { 名称 = '阎罗追命', 熟练度 = 8000 } }, 熟练度 = 10000, 施法几率 = 50 },
    { 名称 = '失魂魔', 外形 = 0, 等级 = 100, 气血 = 322587, 魔法 = 287000, 攻击 = 38500, 速度 = 440, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 10 }, 技能 = { { 名称 = '含情脉脉', 熟练度 = 8000 }, { 名称 = '阎罗追命', 熟练度 = 8000 } }, 熟练度 = 10000, 施法几率 = 50 },
    { 名称 = '无心人', 外形 = 0, 等级 = 100, 气血 = 322587, 魔法 = 287000, 攻击 = 38500, 速度 = 440, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 10 }, 技能 = { { 名称 = '百日眠', 熟练度 = 8000 }, { 名称 = '失心狂乱', 熟练度 = 8000 } }, 熟练度 = 6000, 施法几率 = 80 },
    { 名称 = '无心人', 外形 = 0, 等级 = 100, 气血 = 322587, 魔法 = 287000, 攻击 = 38500, 速度 = 440, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 10 }, 技能 = { { 名称 = '借刀杀人', 熟练度 = 8000 }, { 名称 = '失心狂乱', 熟练度 = 8000 } }, 熟练度 = 6000, 施法几率 = 80 },
}

local _喽啰 = { 2001, 2007, 2002, 2072, 2004, 2066, 2012, 2059, 2009, 2017, 2073, 2289, 2046, 2020, 2045, 2044, 2087 }

function 事件:战斗初始化(玩家, NPC)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    if NPC.名称 == '木魅' then
        for i, v in ipairs(_小怪) do
            local r
            if i == 1 then
                v.气血 = 2500000 + 转生 * 80000 + 等级 * math.random(800, 1000)
                v.速度 = math.random(400, 450) + 转生 * 50 + 等级 * 2
                r = 生成战斗怪物(生成怪物抗性(v, '中等'))
            elseif i > 1 then
                v.外形 = _喽啰[math.random(#_喽啰)]
                r = 生成战斗怪物(生成怪物抗性(v, '简单'))
            end
            self:加入敌方(i, r)
        end
    elseif NPC.名称 == '木魅花魁' then
        for i, v in ipairs(_精英) do
            local r
            if i == 1 then
                v.气血 = 1300000 + 转生 * 80000 + 等级 * math.random(800, 1000)
                v.速度 = math.random(600, 650) + 转生 * 50 + 等级 * 2
                r = 生成战斗怪物(生成怪物抗性(v, '中等'))
            elseif i > 1 and i < 5 then
                v.气血 = 500000 + 转生 * 80000 + 等级 * math.random(800, 1000)
                v.速度 = math.random(550, 600) + 转生 * 50 + 等级 * 2
                r = 生成战斗怪物(生成怪物抗性(v, '中等'))
            else
                v.外形 = _喽啰[math.random(#_喽啰)]
            end
            r = 生成战斗怪物(生成怪物抗性(v, '简单'))
            self:加入敌方(i, r)
        end
    end
end

function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end

function 事件:完成(玩家, NPC)
    for k, v in 玩家:遍历队伍() do
        self:掉落包(v, NPC)
    end
end

local _广播 = {
    "#R%s#C火眼金睛，终于找到了藏匿的木魁，木魁无处可藏，奉上#G#m(%s)[%s]#m#n#89",
    "#R%s#C火眼金睛，终于找到了藏匿的木魁魁首，木魁魁首无处可藏，奉上#G#m(%s)[%s]#m#n#89",
}

function 事件:掉落包(玩家, NPC)
    if 玩家:取活动限制次数('城东魅影') >= 60 then
        return
    end
    玩家:增加活动限制次数('城东魅影')

    local 掉落包 = 取掉落包('活动', '城东魅影')

    if 掉落包 then
        if NPC.名称 == '木魅' then
            local 经验 = 466500
            玩家:添加经验(经验)
            玩家:添加参战召唤兽经验(经验 * 1.5)

            奖励掉落包物品(玩家, 掉落包[1], _广播[1])
        elseif NPC.名称 == '木魅花魁' then
            local 经验 = 668900
            玩家:添加经验(经验)
            玩家:添加参战召唤兽经验(经验 * 1.5)
 
            奖励掉落包物品(玩家, 掉落包[2], _广播[2])
        end
    end
end

return 事件
