local 事件 = {
    名称 = '万仙方阵',
    类型 = '活动',
    是否打开 = true,
    是否可接任务 = true,
}

function 事件:事件初始化()
    -- 开启时间：周五早8点到晚10点
    if os.date('%w', os.time()) == '3' then
        print('星期三，开启万仙方阵活动')
        local year = tonumber(os.date('%Y', os.time()))
        local month = tonumber(os.date('%m', os.time()))
        local day = tonumber(os.date('%d', os.time()))
        self.开始时间 = os.time { year = year, month = month, day = day, hour = 08, min = 00, sec = 00 }
        self.结束时间 = os.time { year = year, month = month, day = day, hour = 22, min = 00, sec = 00 }
        self.是否结束 = false
    end
end

local _主怪信息 = {
    { 名称 = '九天玄女', 模型 = 2129, 数量 = 6 },
    { 名称 = '大罗金仙', 模型 = 2098, 数量 = 6 },
    { 名称 = '兜率宫弟子', 模型 = 2083, 数量 = 6 },
    { 名称 = '王母侍女', 模型 = 2128, 数量 = 6 },
    { 名称 = '四海龙王', 模型 = 2076, 数量 = 6 },
    { 名称 = '百花仙子', 模型 = 2096, 数量 = 6 },
    { 名称 = '十殿阎罗', 模型 = 2075, 数量 = 6 },
    { 名称 = '六丁六甲', 模型 = 2114, 数量 = 6 },
    { 名称 = '九曜十都', 模型 = 2115, 数量 = 6 },
    { 名称 = '二十八星宿', 模型 = 2168, 数量 = 6 },
    { 名称 = '天罡星', 模型 = 2127, 数量 = 6 },
    { 名称 = '金甲天兵', 模型 = 2130, 数量 = 6 },
}

local _地图 = { 1193, 1194, 1110, 1091, 1174, 1028 }

function 事件:清除所有怪物()
    for ii, vv in ipairs(_地图) do
        local map = self:取地图(vv)
        for i = 1, #_主怪信息 do
            for k, v in map:遍历NPC() do
                if v.名称 == _主怪信息[i].名称 then
                    v:删除()
                end
            end
        end
    end
end

function 事件:更新()
    if self.是否结束 then
        return
    end
    local 地图组 = {}
    self.时间 = os.time() + 30 * 60
    for ii, vv in ipairs(_地图) do
        local map = self:取地图(vv)
        table.insert(地图组, map.名称)
        for i = 1, #_主怪信息 do
            for k, v in map:遍历NPC() do
                if v.名称 == _主怪信息[i].名称 and not v.战斗中 then
                    v:删除()
                end
            end

            local 刷新数量 = _主怪信息[i].数量
            for _ = 1, 刷新数量 do
                local 方向 = math.random(1, 4)
                local X, Y = map:取随机坐标()
                local NPC = map:添加NPC {
                    名称 = _主怪信息[i].名称,
                    外形 = _主怪信息[i].模型,
                    称谓 = '万仙方阵',
                    方向 = 方向,
                    脚本 = 'scripts/event/活动5_天元盛典_万仙方阵.lua',
                    时间 = self.时间,
                    X = X,
                    Y = Y,
                    来源 = self
                }
            end
        end
    end
    self:发送系统('#Y【万仙方阵】#G天庭举办天界盛典竟有妖怪混入，诸君可以三人及以上组队，速速前往#Y%s，#G寻找天庭的万仙方阵捉拿妖怪。', table.concat(地图组, '、'))
    return 1800
end

function 事件:事件开始()
    self:更新()
    self:定时(1800, self.更新)
    print('万仙方阵活动开始')
end

function 事件:事件结束()
    self.是否结束 = true
    self:清除所有怪物()
    print('万仙方阵活动结束')
end

--=======================================================
local 对话 = [[
没想到我躲在这里，也会被你们发现，休想抓我回去。#4
menu
1|妖孽，受死吧
2|我认错人了
]]

function 事件:NPC对话(玩家, NPC)
    return 对话
end

function 事件:NPC菜单(玩家, i, NPC)
    if NPC and NPC:是否战斗中() then
        return "我正在战斗中"
    end
    if i == '1' then
        if not NPC:是否战斗中() then
            if i == '1' then
                NPC:进入战斗(true)
                local r = 玩家:进入战斗('scripts/event/活动5_天元盛典_万仙方阵.lua', NPC)
                NPC:进入战斗(false)
                if r then
                    self:完成(玩家, NPC)
                    NPC:删除()
                end
            end
        else
            return "我正在战斗中"
        end
    end
end

--===============================================

local _怪物 = {
    {
        等级 = 100,
        气血 = 662587,
        魔法 = 307000,
        攻击 = 22500,
        速度 = 680,
        抗性 = { 抗混乱 = 60, 抗昏睡 = 60, 抗封印 = 60, 抗震慑 = 16 },
        技能 = { { 名称 = "九龙冰封", 熟练度 = 15000 }, { 名称 = "九阴纯火", 熟练度 = 15000 } },
        施法几率 = 80,
    },
    { 等级 = 100, 气血 = 552587, 魔法 = 287000, 攻击 = 12500, 速度 = 580, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 12 }, 技能 = { '天诛地灭', '袖里乾坤' }, 熟练度 = 10000, 施法几率 = 80 },
    { 等级 = 100, 气血 = 552587, 魔法 = 287000, 攻击 = 12500, 速度 = 580, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 12 }, 技能 = { '魔神附身', '阎罗追命' }, 熟练度 = 10000, 施法几率 = 50 },
    { 等级 = 100, 气血 = 342587, 魔法 = 187000, 攻击 = 10500, 速度 = 520, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '九龙冰封', '九阴纯火' }, 熟练度 = 10000, 施法几率 = 80 },
    { 等级 = 100, 气血 = 342587, 魔法 = 187000, 攻击 = 10500, 速度 = 520, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '九龙冰封', '九阴纯火' }, 熟练度 = 10000, 施法几率 = 80 },
    { 等级 = 100, 气血 = 342587, 魔法 = 187000, 攻击 = 28500, 速度 = 520, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '含情脉脉', '阎罗追命' }, 熟练度 = 10000, 施法几率 = 50 },
    { 等级 = 100, 气血 = 342587, 魔法 = 187000, 攻击 = 10500, 速度 = 520, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '百日眠', '失心狂乱' }, 熟练度 = 10000, 施法几率 = 80 },
    { 等级 = 100, 气血 = 342587, 魔法 = 187000, 攻击 = 10500, 速度 = 520, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '离魂咒', '百日眠' }, 熟练度 = 10000, 施法几率 = 80 },
    { 等级 = 100, 气血 = 342587, 魔法 = 187000, 攻击 = 28500, 速度 = 500, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 忽视防御几率 = 100, 忽视防御程度 = 60, 连击率 = 40, 连击次数 = 3, 反击率 = 30, 反击次数 = 3 },
    { 等级 = 100, 气血 = 342587, 魔法 = 187000, 攻击 = 28500, 速度 = 500, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 忽视防御几率 = 100, 忽视防御程度 = 60, 连击率 = 40, 连击次数 = 3, 反击率 = 30, 反击次数 = 3 },
}

function 事件:战斗初始化(玩家, NPC)
    for i = 1, math.random(6, 10), 1 do
        local v = _怪物[i]
        v.名称 = NPC.名称
        v.外形 = NPC.外形
        if i > 3 then
            v.名称 = '喽啰'
        end
        local r = 生成战斗怪物(v)
        self:加入敌方(i, r)
    end
end

function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end

function 事件:完成(玩家, NPC)
    for k, v in 玩家:遍历队伍() do
        self:掉落包(v, NPC)
    end
end

local _广播 = "#R%s#C鸿运当头，在#Y万仙方阵#C活动中奋力斩杀妖魔，妖魔落荒而逃，仓皇之中竟遗留下来#G#m(%s)[%s]#m#n#28"

function 事件:掉落包(玩家, NPC)
    if 玩家:取活动限制次数('万仙方阵') >= 60 then
        return
    end
    玩家:增加活动限制次数('万仙方阵')

    local 经验 = 863600
    玩家:添加任务经验(经验)
    玩家:添加法宝经验(500)

    local 掉落包 = 取掉落包('活动', '天元盛典')
    if 掉落包 then
        奖励掉落包物品(玩家, 掉落包['万仙方阵'], _广播)
    end
end

return 事件
