local 事件 = {
    名称 = '花灯报吉_灯灵',
    类型 = '活动',
    是否打开 = true,
    是否可接任务 = true,
}

function 事件:事件初始化()
    -- 开启时间：周日早8点到晚10点
    if os.date('%w', os.time()) == '7' then
        print('星期天，开启花灯报吉活动')
        local year = tonumber(os.date('%Y', os.time()))
        local month = tonumber(os.date('%m', os.time()))
        local day = tonumber(os.date('%d', os.time()))
        self.开始时间 = os.time { year = year, month = month, day = day, hour = 08, min = 00, sec = 00 }
        self.结束时间 = os.time { year = year, month = month, day = day, hour = 22, min = 00, sec = 00 }
        self.是否结束 = false
    end
end

local _地图 = { 1110, 1173, 1174, 1092, 1217, 101299 }

local _主怪信息 = {
    { 名称 = '灯灵', 模型 = 2113, 数量 = 30 },
    { 名称 = '灯灵', 模型 = 2096, 数量 = 30 },
}


function 事件:清除所有怪物()
    for ii, vv in ipairs(_地图) do
        local map = self:取地图(vv)
        for i = 1, #_主怪信息 do
            for k, v in map:遍历NPC() do
                if v.名称 == _主怪信息[i].名称 and not v.战斗中 then
                    v:删除()
                end
            end
        end
    end
end

function 事件:更新()
    if self.是否结束 then
        return
    end
    local 地图组 = {}
    self.时间 = os.time() + 30 * 60
    for ii, vv in ipairs(_地图) do
        local map = self:取地图(vv)
        table.insert(地图组, map.名称)
        for i = 1, #_主怪信息 do
            for k, v in map:遍历NPC() do
                if v.名称 == _主怪信息[i].名称 and not v.战斗中 then
                    v:删除()
                end
            end

            local 刷新数量 = _主怪信息[i].数量
            for _ = 1, 刷新数量 do
                local 方向 = math.random(1, 4)
                local X, Y = map:取随机坐标()
                local NPC = map:添加NPC {
                    名称 = _主怪信息[i].名称,
                    外形 = _主怪信息[i].模型,
                    称谓 = '花灯报吉',
                    方向 = 方向,
                    脚本 = 'scripts/event/活动7_花灯报吉_灯灵.lua',
                    时间 = self.时间,
                    X = X,
                    Y = Y,
                    来源 = self
                }
            end
        end
    end
    self:发送系统('#G王母娘娘让代表着祥和与安康的灯灵下凡人间为人们送去祝福，不料有些灯灵却被妖怪感化与妖怪一起祸害人间，各位侠士可组队前往#W%s#G这个六个地方寻找灯灵并降服。', table.concat(地图组, '、'))
    return 1800
end

function 事件:事件开始()
    self:更新()
    self:定时(1800, self.更新)
    print('花灯报吉_灯灵活动开始')
end

function 事件:事件结束()
    self.是否结束 = true
    self:清除所有怪物()
    print('花灯报吉_灯灵活动结束')
end

--=======================================================
local 对话 = [[没想到我躲在这里，也会被你们发现，休想抓我回去。#4
menu
1|妖孽，受死吧
2|我认错人了
]]
function 事件:NPC对话(玩家, i)
    return 对话
end

function 事件:NPC菜单(玩家, i)
    if i == '1' then
        local r = 玩家:进入战斗('scripts/event/活动7_花灯报吉_灯灵.lua', self)
        if r then
            self:完成(玩家)
            self:删除()
        end
    end
end

--===============================================
function 事件:战斗初始化(玩家, NPC)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    if NPC.外形 == 2113 then
        怪物属性 = {
            名称 = "灯灵",
            外形 = 2113,
            等级 = 等级,
            气血 = 658454 + 转生 * 300000 + 等级 * 10000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 1954 + 转生 * 1200 + 等级 * 100,
            速度 = 300 + 等级 * 3,
            抗性 = {
                抗水 = -139.7,
                抗雷 = -139.7,
                抗火 = 30,
                抗风 = -139.7,
                抗震慑 = 31
            },

            技能 = {
                { 名称 = "三昧真火", 熟练度 = 15000 },
                { 名称 = "烈火骄阳", 熟练度 = 15000 },
            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "琴魂",
            外形 = 2100,
            等级 = 等级,
            气血 = 552154 + 转生 * 300000 + 等级 * 10000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 1954 + 转生 * 1200 + 等级 * 100,
            速度 = 194 + 等级 * 3,
            抗性 = {
                抗震慑 = 19,
                抗水 = -180,
                抗雷 = -180,
                抗火 = -180,
                抗风 = -180,
                抗混乱 = 30,
                抗封印 = 30,
                抗中毒 = 30,
                抗昏睡 = 30
            },
            技能 = {
                { 名称 = "龙啸九天", 熟练度 = 15000 },
                { 名称 = "蛟龙出海", 熟练度 = 15000 },
            },
            施法几率 = 20,
            是否消失 = false,

        }
        self:加入敌方(2, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "花魂",
            外形 = 2012,
            等级 = 等级,
            气血 = 552154 + 转生 * 300000 + 等级 * 10000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 1954 + 转生 * 1200 + 等级 * 100,
            速度 = 120 + 等级 * 2,
            抗性 = {
                抗震慑 = 19,
                抗水 = -150,
                抗雷 = -150,
                抗火 = -150,
                抗风 = -150,
                抗鬼火 = -140,
                抗毒伤害 = -36000
            },
            技能 = {
                { 名称 = "魔音摄心", 熟练度 = 6854 },
                { 名称 = "楚楚可怜", 熟练度 = 6985 }
            },
            施法几率 = 20,
            是否消失 = false,

        }



        self:加入敌方(3, 生成战斗怪物(怪物属性))


        怪物属性 = {
            名称 = "月魅",
            外形 = 2107,
            等级 = 等级,
            气血 = 552154 + 转生 * 300000 + 等级 * 10000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 1954 + 转生 * 1200 + 等级 * 100,
            速度 = 289 + 等级 * 2,
            抗性 = {
                抗震慑 = 19,
                抗水 = -150,
                抗雷 = -150,
                抗火 = -150,
                抗风 = -150,
                抗鬼火 = -140,
                抗毒伤害 = -36000
            },
            技能 = {
                { 名称 = "魔音摄心", 熟练度 = 6854 },
                { 名称 = "楚楚可怜", 熟练度 = 6985 }
            },
            施法几率 = 20,
            是否消失 = false,

        }
        self:加入敌方(4, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "剑魂",
            外形 = 2109,
            等级 = 等级,
            气血 = 552154 + 转生 * 300000 + 等级 * 10000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 11954 + 转生 * 1200 + 等级 * 100,
            速度 = 275 + 等级 * 1,
            抗性 = {
                抗震慑 = 19,
                抗水 = -180,
                抗雷 = -180,
                抗火 = -180,
                抗风 = -180,
                抗鬼火 = -180,
                抗毒伤害 = -1000,
                抗混乱 = 30,
                抗封印 = 30,
                抗中毒 = 30,
                抗昏睡 = 30,
                狂暴几率 = 100,
                命中率 = 100,
                忽视防御程度 = 60,
                忽视防御几率 = 60
            },
            技能 = {
                { 名称 = "魔神飞舞", 熟练度 = 15000 },
                { 名称 = "天外飞魔", 熟练度 = 15000 },
                { 名称 = "阎罗追命", 熟练度 = 15000 },
            },
            施法几率 = 20,
            是否消失 = false,

        }
        self:加入敌方(5, 生成战斗怪物(怪物属性))


        怪物属性 = {
            名称 = "雪魂",
            外形 = 2099,
            等级 = 等级,
            气血 = 552154 + 转生 * 300000 + 等级 * 10000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 1954 + 转生 * 1200 + 等级 * 100,
            速度 = 12 + 等级 * 1,
            抗性 = {
                抗震慑 = 19,
                抗水 = -180,
                抗雷 = -180,
                抗火 = -180,
                抗风 = -180,
                抗鬼火 = -180,
                抗毒伤害 = -1000,
                抗混乱 = 30,
                抗封印 = 30,
                抗中毒 = 30,
                抗昏睡 = 30
            },
            技能 = {
                { 名称 = "迷魂醉", 熟练度 = 6895 },
                { 名称 = "百日眠", 熟练度 = 6895 },
            },
            施法几率 = 20,
            是否消失 = false,

        }
        self:加入敌方(6, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "玉魅",
            外形 = 2011,
            等级 = 等级,
            气血 = 552154 + 转生 * 300000 + 等级 * 10000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 1954 + 转生 * 1200 + 等级 * 100,
            速度 = 178 + 等级 * 2,
            抗性 = {
                抗震慑 = 19,
                抗水 = -180,
                抗雷 = -180,
                抗火 = -180,
                抗风 = -180,
                抗鬼火 = -180,
                抗毒伤害 = -36000
            },
            技能 = {
                { 名称 = "三昧真火", 熟练度 = 15000 },
                { 名称 = "烈火骄阳", 熟练度 = 15000 },
            },
            施法几率 = 20,
            是否消失 = false,

        }
        self:加入敌方(7, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "竹魂",
            外形 = 2111,
            等级 = 等级,
            气血 = 552154 + 转生 * 300000 + 等级 * 10000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 1954 + 转生 * 1200 + 等级 * 100,
            速度 = 50 + 等级 * 2,
            抗性 = {
                抗水 = -139.7,
                抗雷 = -139.7,
                抗火 = -139.7,
                抗风 = 30,
                抗鬼火 = -30,
                抗震慑 = 31
            },
            技能 = {
                { 名称 = "谗言相加", 熟练度 = 15000 },
                { 名称 = "借刀杀人", 熟练度 = 15000 },

            },
            施法几率 = 20,
            是否消失 = false,

        }
        self:加入敌方(8, 生成战斗怪物(怪物属性))
    else
        怪物属性 = {
            名称 = "桃妖",
            外形 = 2096,
            等级 = 等级,
            气血 = 652154 + 转生 * 300000 + 等级 * 10000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 1954 + 转生 * 1200 + 等级 * 100,
            速度 = 300 + 等级 * 3,
            抗性 = {
                抗水 = 47,
                抗雷 = 47,
                抗火 = 47,
                抗风 = 47,
                抗震慑 = 31
            },
            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 16548 }
            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "树精",
            外形 = 2095,
            等级 = 等级,
            气血 = 552154 + 转生 * 300000 + 等级 * 10000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 1954 + 转生 * 1200 + 等级 * 100,
            速度 = 289 + 等级 * 2,
            抗性 = {
                抗水 = -139.7,
                抗雷 = -139.7,
                抗火 = -139.7,
                抗风 = 30,
                抗鬼火 = -30,
                抗震慑 = 31
            },
            技能 = {
                { 名称 = "谗言相加", 熟练度 = 15000 },
                { 名称 = "借刀杀人", 熟练度 = 15000 },

            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(2, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "熊精",
            外形 = 2006,
            等级 = 等级,
            气血 = 552154 + 转生 * 300000 + 等级 * 10000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 1954 + 转生 * 1200 + 等级 * 100,
            速度 = 245 + 等级 * 3,
            抗性 = {
                抗震慑 = 19,
                抗水 = -180,
                抗雷 = -180,
                抗火 = -180,
                抗风 = -180,
                抗鬼火 = -180,
                抗毒伤害 = -1000,
                抗混乱 = 30,
                抗封印 = 30,
                抗中毒 = 30,
                抗昏睡 = 30,
                狂暴几率 = 100,
                命中率 = 100,
                忽视防御程度 = 60,
                忽视防御几率 = 60
            },
            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 15000 },
            },
            施法几率 = 5,
            是否消失 = false,

        }
        self:加入敌方(3, 生成战斗怪物(怪物属性))


        怪物属性 = {
            名称 = "老虎精",
            外形 = 2028,
            等级 = 等级,
            气血 = 552154 + 转生 * 300000 + 等级 * 10000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 1954 + 转生 * 1200 + 等级 * 100,
            速度 = 30,
            抗性 = {
                抗震慑 = 19,
                抗水 = -180,
                抗雷 = -180,
                抗火 = -180,
                抗风 = -180,
                抗鬼火 = -180,
                抗毒伤害 = -1000,
                抗混乱 = 30,
                抗封印 = 30,
                抗中毒 = 30,
                抗昏睡 = 30,
                狂暴几率 = 100,
                命中率 = 100,
                忽视防御程度 = 60,
                忽视防御几率 = 60
            },
            技能 = {
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(4, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "狐狸精",
            外形 = 2059,
            等级 = 等级,
            气血 = 552154 + 转生 * 300000 + 等级 * 10000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 1954 + 转生 * 1200 + 等级 * 100,
            速度 = 185 + 等级 * 1,
            抗性 = {
                抗水 = 47,
                抗雷 = 47,
                抗火 = 47,
                抗风 = 47,
                抗震慑 = 31
            },
            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 16548 },
                { 名称 = "含情脉脉", 熟练度 = 16548 }
            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(5, 生成战斗怪物(怪物属性))


        怪物属性 = {
            名称 = "羊头怪",
            外形 = 2007,
            等级 = 等级,
            气血 = 552154 + 转生 * 300000 + 等级 * 10000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 1954 + 转生 * 1200 + 等级 * 100,
            速度 = 128 + 等级 * 3,
            抗性 = {
                抗震慑 = 19,
                抗水 = -180,
                抗雷 = -180,
                抗火 = -180,
                抗风 = -180,
                抗鬼火 = -180,
                抗毒伤害 = -1000,
                抗混乱 = 30,
                抗封印 = 30,
                抗中毒 = 30,
                抗昏睡 = 30
            },
            技能 = {
                { 名称 = "谗言相加", 熟练度 = 6895 },
                { 名称 = "百日眠", 熟练度 = 6895 },
            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(6, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "两角怪",
            外形 = 2013,
            等级 = 等级,
            气血 = 552154 + 转生 * 300000 + 等级 * 10000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 1954 + 转生 * 1200 + 等级 * 100,
            速度 = 20 + 等级 * 3,
            抗性 = {
                抗震慑 = 19,
                抗水 = -180,
                抗雷 = -180,
                抗火 = -180,
                抗风 = -180,
                抗鬼火 = -180,
                抗毒伤害 = -1000,
                抗混乱 = 30,
                抗封印 = 30,
                抗中毒 = 30,
                抗昏睡 = 30
            },
            技能 = {
                { 名称 = "太乙生风", 熟练度 = 6895 },
                { 名称 = "风雷涌动", 熟练度 = 6895 },
            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(7, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "泥石怪",
            外形 = 2101,
            等级 = 等级,
            气血 = 552154 + 转生 * 300000 + 等级 * 10000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 49954 + 转生 * 1200 + 等级 * 100,
            速度 = -300,
            抗性 = {
                抗震慑 = 19,
                抗水 = -180,
                抗雷 = -180,
                抗火 = -180,
                抗风 = -180,
                抗鬼火 = -180,
                抗毒伤害 = -1000,
                抗混乱 = 30,
                抗封印 = 30,
                抗中毒 = 30,
                抗昏睡 = 30,
                狂暴几率 = 100,
                命中率 = 100,
                忽视防御程度 = 60,
                忽视防御几率 = 60
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 15000 },
            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(8, 生成战斗怪物(怪物属性))
    end
end

function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end

--===============================================
function 事件:完成(玩家)
    if 玩家.是否组队 then
        for _, v in 玩家:遍历队伍() do
            self:掉落包(v)
        end
    else
        self:掉落包(玩家)
    end
end

local _广播 = {
    '#c00FFFF花灯报吉#23#R%s#c00FFFF正看着远处提灯而过的佳人发怔，王母娘娘悠然飘过，袖中落下一个#G#m(%s)[%s]#m#47',
    '#c00FFFF花灯报吉#23#c00FFFF话说#R%s#R/#c00FFFF昨日梦见来到了玉帝的天宫宝库，今日醒来枕头边还真放了个#G#m(%s)[%s]#m#35'
}

function 事件:掉落包(玩家)
    if 玩家:取活动限制次数('花灯报吉_灯灵') >= 50 then
        return
    end
    玩家:增加活动限制次数('花灯报吉_灯灵')

    local 经验 = 863600
    玩家:添加任务经验(经验)
    玩家:添加法宝经验(500)

    local 掉落包 = 取掉落包('活动', '花灯报吉')
    if 掉落包 then
        奖励掉落包物品(玩家, 掉落包['灯灵'], _广播[math.random(1, 2)])
    end
end

return 事件
