local 事件 = {
    名称 = '年年有余_鲤鱼',
    是否打开 = true,
    是否可接任务 = true,
}

function 事件:事件初始化()
    if os.date('%w', os.time()) == '6' then
        print('星期六，开启夺镖活动')
        local year = tonumber(os.date('%Y', os.time()))
        local month = tonumber(os.date('%m', os.time()))
        local day = tonumber(os.date('%d', os.time()))
        self.开始时间 = os.time { year = year, month = month, day = day, hour = 08, min = 00, sec = 00 }
        self.结束时间 = os.time { year = year, month = month, day = day, hour = 22, min = 00, sec = 00 }
        self.是否结束 = false
    end
end

local _地图 = { 1111, 1092, 1173, 101395 }

local _主怪信息 = {
    { 名称 = '小金鲤', 模型 = 6560, 数量 = 30 },
    { 名称 = '小金鲤', 模型 = 6560, 数量 = 30 },

}

function 事件:清除所有怪物()
    for ii, vv in ipairs(_地图) do
        local map = self:取地图(vv)
        for i = 1, #_主怪信息 do
            for k, v in map:遍历NPC() do
                if v.名称 == _主怪信息[i].名称 and not v.战斗中 then
                    v:删除()
                end
            end
        end
    end
end

function 事件:更新()
    if self.是否结束 then
        return
    end
    local 地图组 = {}
    self.时间 = os.time() + 30 * 60
    for ii, vv in ipairs(_地图) do
        local map = self:取地图(vv)
        table.insert(地图组, map.名称)
        for i = 1, #_主怪信息 do
            for k, v in map:遍历NPC() do
                if v.名称 == _主怪信息[i].名称 and not v.战斗中 then
                    v:删除()
                end
            end

            local 刷新数量 = _主怪信息[i].数量
            for _ = 1, 刷新数量 do
                local 方向 = math.random(1, 4)
                local X, Y = map:取随机坐标()
                local NPC = map:添加NPC {
                    名称 = _主怪信息[i].名称,
                    外形 = _主怪信息[i].模型,
                    称谓 = '年年有余',
                    方向 = 方向,
                    脚本 = 'scripts/event/活动7_年年有余_鲤鱼.lua',
                    时间 = self.时间,
                    X = X,
                    Y = Y,
                    来源 = self
                }
            end
        end
    end
    self:发送系统('#G【年年有鱼】#G七十二尾鲤鱼不翼而飞，唐王广发搜集令。玩家可去#W天宫、傲来国、兰若寺、大唐边境#G等地，寻找失踪的小金鲤。', table.concat(地图组, '、'))
    return 1800
end



function 事件:事件开始()
    self:更新()
    self:定时(1800, self.更新)
    print('年年有余_鲤鱼活动开始')
end

function 事件:事件结束()
    self.是否结束 = true
    self:清除所有怪物()
    print('年年有余_鲤鱼活动结束')
end

--=======================================================
local 对话 = [[我是一只小金鲤#17，不是鱼，自由自在尔小金鲤。#85
menu
1|快跟我回去！
2|我管你是金鱼还是鲤鱼。
]]
function 事件:NPC对话(玩家, i)
    return 对话
end

function 事件:攻击事件(玩家, NPC)
    if not 玩家.是否队长 then
        return "3人或者3人以上挑战"
    end
    if 玩家:取队伍人数() < 3 then
        return "3人或者3人以上挑战"
    end
    if 玩家:取队伍等级是否低于(0, 90) then
        return "队伍内有低于0转90级的玩家无法挑战该任务"
    end
    if not NPC:是否战斗中() then
        NPC:进入战斗(true)
        local r = 玩家:进入战斗('scripts/event/活动7_年年有余_鲤鱼.lua', NPC)
        NPC:进入战斗(false)
        if r then
            NPC:删除()
            self:完成(玩家)
        end
    else
        return "我正在战斗中"
    end
end

function 事件:NPC菜单(玩家, i)

    if i == '1' then
        if not self:是否战斗中() then
            self:进入战斗(true)
            local r = 玩家:进入战斗('scripts/event/活动7_年年有余_鲤鱼.lua', self)
            self:进入战斗(false)
            if r then
                self:删除()
                self:完成(玩家)
            end
        else
            return "我正在战斗中"
        end
    end
end

local _小怪 = {
    {
        名称 = "鱼怪小龙", 外形 = 6560,
        等级 = 等级,
        气血 =
        function(等级, 转生)
            return "气血", 658454 + 转生 * 300000 + 等级 * 10000
        end,
        魔法 =
        function(等级, 转生)
            return "魔法", 20000 + 等级 * 501
        end,
        攻击 =
        function(等级, 转生)
            return "攻击", 21954 + 转生 * 1200 + 等级 * 100
        end,
        速度 =
        function(等级, 转生)
            return "速度", 300 + 等级 * 3
        end,
        抗性 = {
            物理吸收 = 20,
            抗水 = -15,
            抗雷 = -139.7,
            抗火 = -139,
            抗风 = -30.7,
            抗鬼火 = -30,
            抗震慑 = 31,
            抗混乱 = 65,
            抗封印 = 85,
            抗昏睡 = 72
        },
        技能 = {
            { 名称 = "龙啸九天", 熟练度 = 15000 },
            { 名称 = "蛟龙出海", 熟练度 = 15000 },
        },
        施法几率 = 50,
        是否消失 = false,
    },

    {
        名称 = "鱼怪小凤", 外形 = 6560,
        等级 = 等级,
        气血 =
        function(等级, 转生)
            return "气血", 658454 + 转生 * 300000 + 等级 * 10000
        end,
        魔法 =
        function(等级, 转生)
            return "魔法", 20000 + 等级 * 501
        end,
        攻击 =
        function(等级, 转生)
            return "攻击", 21954 + 转生 * 1200 + 等级 * 100
        end,
        速度 =
        function(等级, 转生)
            return "速度", 300 + 等级 * 3
        end,
        抗性 = {
            物理吸收 = 20,
            抗水 = -15,
            抗雷 = -139.7,
            抗火 = -139,
            抗风 = -30.7,
            抗鬼火 = -30,
            抗震慑 = 31,
            抗混乱 = 65,
            抗封印 = 85,
            抗昏睡 = 72
        },
        技能 = {
            { 名称 = "三昧真火", 熟练度 = 15000 },
            { 名称 = "烈火骄阳", 熟练度 = 15000 },
        },
        施法几率 = 50,
        是否消失 = false,
    },


    {
        名称 = "鱼怪小呈", 外形 = 6560,
        等级 = 等级,
        气血 =
        function(等级, 转生)
            return "气血", 658454 + 转生 * 300000 + 等级 * 10000
        end,
        魔法 =
        function(等级, 转生)
            return "魔法", 20000 + 等级 * 501
        end,
        攻击 =
        function(等级, 转生)
            return "攻击", 21954 + 转生 * 1200 + 等级 * 100
        end,
        速度 =
        function(等级, 转生)
            return "速度", 300 + 等级 * 3
        end,
        抗性 = {
            物理吸收 = 20,
            抗水 = -15,
            抗雷 = -139.7,
            抗火 = -139,
            抗风 = -30.7,
            抗鬼火 = -30,
            抗震慑 = 31,
            抗混乱 = 65,
            抗封印 = 85,
            抗昏睡 = 72
        },
        技能 = {
            { 名称 = "谗言相加", 熟练度 = 15000 },
            { 名称 = "借刀杀人", 熟练度 = 15000 },
        },
        施法几率 = 50,
        是否消失 = false,
    },


    {
        名称 = "鱼怪小吉", 外形 = 6560,
        等级 = 等级,
        气血 =
        function(等级, 转生)
            return "气血", 658454 + 转生 * 300000 + 等级 * 10000
        end,
        魔法 =
        function(等级, 转生)
            return "魔法", 20000 + 等级 * 501
        end,
        攻击 =
        function(等级, 转生)
            return "攻击", 21954 + 转生 * 1200 + 等级 * 100
        end,
        速度 =
        function(等级, 转生)
            return "速度", 300 + 等级 * 3
        end,
        抗性 = {
            物理吸收 = 20,
            抗水 = -15,
            抗雷 = -139.7,
            抗火 = -139,
            抗风 = -30.7,
            抗鬼火 = -30,
            抗震慑 = 31,
            抗混乱 = 65,
            抗封印 = 85,
            抗昏睡 = 72
        },
        技能 = {
            { 名称 = "离魂咒", 熟练度 = 15000 },
            { 名称 = "百日眠", 熟练度 = 15000 },
        },
        施法几率 = 50,
        是否消失 = false,
    },

    {
        名称 = "鱼怪小如", 外形 = 6560,
        等级 = 等级,
        气血 =
        function(等级, 转生)
            return "气血", 658454 + 转生 * 300000 + 等级 * 10000
        end,
        魔法 =
        function(等级, 转生)
            return "魔法", 20000 + 等级 * 501
        end,
        攻击 =
        function(等级, 转生)
            return "攻击", 21954 + 转生 * 1200 + 等级 * 100
        end,
        速度 =
        function(等级, 转生)
            return "速度", 300 + 等级 * 3
        end,
        抗性 = {
            物理吸收 = 20,
            抗水 = -15,
            抗雷 = -139.7,
            抗火 = -139,
            抗风 = -30.7,
            抗鬼火 = -30,
            抗震慑 = 31,
            抗混乱 = 65,
            抗封印 = 85,
            抗昏睡 = 72
        },
        技能 = {
            { 名称 = "离魂咒", 熟练度 = 15000 },
            { 名称 = "百日眠", 熟练度 = 15000 },
        },
        施法几率 = 50,
        是否消失 = false,
    },

    {
        名称 = "鱼怪小意", 外形 = 6560,
        等级 = 等级,
        气血 =
        function(等级, 转生)
            return "气血", 658454 + 转生 * 300000 + 等级 * 10000
        end,
        魔法 =
        function(等级, 转生)
            return "魔法", 20000 + 等级 * 501
        end,
        攻击 =
        function(等级, 转生)
            return "攻击", 21954 + 转生 * 1200 + 等级 * 100
        end,
        速度 =
        function(等级, 转生)
            return "速度", 300 + 等级 * 3
        end,
        抗性 = {
            物理吸收 = 20,
            抗水 = -15,
            抗雷 = -139.7,
            抗火 = -139,
            抗风 = -30.7,
            抗鬼火 = -30,
            抗震慑 = 31,
            抗混乱 = 65,
            抗封印 = 85,
            抗昏睡 = 72
        },
        技能 = {
            { 名称 = "阎罗追命", 熟练度 = 25000 },
            { 名称 = "含情脉脉", 熟练度 = 25000 },
        },
        施法几率 = 50,
        是否消失 = false,
    },

}
-- ===============================================

function 事件:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 6560,
        名称 = '小金鲤',
        等级 = 等级,
        气血 = 3000000,
        魔法 = 200000 + 等级 * 501,
        攻击 = 1 + 转生 * 1 + 等级 * 1,
        速度 = 600,
        抗性 = {
            物理吸收 = 20,
            抗水 = 30,
            抗雷 = 30,
            抗火 = 30,
            抗风 = 30,
            抗鬼火 = -30,
            抗震慑 = 100,
            抗混乱 = 65,
            抗封印 = 85,
            抗昏睡 = 72
        },
        技能 = {},
        施法几率 = 0,
        是否消失 = false,
    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 6560,
        名称 = '小金鲤',
        等级 = 等级,
        气血 = 3000000,
        魔法 = 200000 + 等级 * 501,
        攻击 = 1 + 转生 * 1 + 等级 * 1,
        速度 = 600,
        抗性 = {
            物理吸收 = 20,
            抗水 = 30,
            抗雷 = 30,
            抗火 = 30,
            抗风 = 30,
            抗鬼火 = -30,
            抗震慑 = 100,
            抗混乱 = 65,
            抗封印 = 85,
            抗昏睡 = 72
        },
        技能 = {

        },
        施法几率 = 0,
        是否消失 = false,
        --内丹 = { '乘风破浪' }
    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 6560,
        名称 = '小金鲤',
        等级 = 等级,
        气血 = 3000000,
        魔法 = 200000 + 等级 * 501,
        攻击 = 1 + 转生 * 1 + 等级 * 1,
        速度 = 600,
        抗性 = {
            物理吸收 = 20,
            抗水 = 30,
            抗雷 = 30,
            抗火 = 30,
            抗风 = 30,
            抗鬼火 = -30,
            抗震慑 = 100,
            抗混乱 = 65,
            抗封印 = 85,
            抗昏睡 = 72
        },
        技能 = {

        },
        施法几率 = 0,
        是否消失 = false,
        --内丹 = { '乘风破浪' }
    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 6560,
        名称 = '小金鲤',
        等级 = 等级,
        气血 = 3000000,
        魔法 = 200000 + 等级 * 501,
        攻击 = 1 + 转生 * 1 + 等级 * 1,
        速度 = 600,
        抗性 = {
            物理吸收 = 20,
            抗水 = 30,
            抗雷 = 30,
            抗火 = 30,
            抗风 = 30,
            抗鬼火 = -30,
            抗震慑 = 100,
            抗混乱 = 65,
            抗封印 = 85,
            抗昏睡 = 72
        },
        技能 = {

        },
        施法几率 = 0,
        是否消失 = false,
        --内丹 = { '乘风破浪' }
    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 6560,
        名称 = '小金鲤',
        等级 = 等级,
        气血 = 3000000,
        魔法 = 200000 + 等级 * 501,
        攻击 = 1 + 转生 * 1 + 等级 * 1,
        速度 = 600,
        抗性 = {
            物理吸收 = 20,
            抗水 = 30,
            抗雷 = 30,
            抗火 = 30,
            抗风 = 30,
            抗鬼火 = -30,
            抗震慑 = 31,
            抗混乱 = 65,
            抗封印 = 85,
            抗昏睡 = 72
        },
        技能 = {

        },
        施法几率 = 0,
        是否消失 = false,

    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))



    for i = 1, 5, 1 do
        怪物属性 = {}
        for k, v in pairs(_小怪[math.random(#_小怪)]) do
            if type(v) == "function" then
                local a, b = v(等级, 转生)
                怪物属性[a] = b
            else
                怪物属性[k] = v
            end
        end
        self:加入敌方(i + 5, 生成战斗怪物(怪物属性))
    end







end

function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end

--===============================================
function 事件:完成(玩家)
    if 玩家.是否组队 then
        for _, v in 玩家:遍历队伍() do
            self:掉落包(v)
        end
    else
        self:掉落包(玩家)
    end
end

local _广播 = '#C五洲贺喜，四海皆福#47#C金鲤王自怀里掏出个#G#m(%s)[%s]#m#n塞到#R%s#C手里，神秘兮兮地说，嘘--我等正在密谋逃跑呢，一边玩去。'


function 事件:掉落包(玩家)
    if 玩家:取活动限制次数('年年有余_鲤鱼') >= 60 then
        return
    end
    玩家:增加活动限制次数('年年有余_鲤鱼')

    local 经验 = 863600
    玩家:添加任务经验(经验)
    玩家:添加法宝经验(500)

    local 掉落包 = 取掉落包('活动', '年年有余')
    if 掉落包 then
        奖励掉落包物品(玩家, 掉落包['鲤鱼'], _广播[math.random(1)])
    end
end

return 事件

