-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2024-09-24 11:14:52
-- @Last Modified time  : 2024-11-03 11:32:17

local 事件 = {
    名称 = '年年有余_灶神',
    类型 = '活动',
    是否打开 = true,
    是否可接任务 = true,
}

function 事件:事件初始化()
    -- if os.date('%w', os.time()) == '0' then
    --     print('星期日，年年有余_灶神')
    --     local year = tonumber(os.date('%Y', os.time()))
    --     local month = tonumber(os.date('%m', os.time()))
    --     local day = tonumber(os.date('%d', os.time()))
    --     self.开始时间 = os.time { year = year, month = month, day = day, hour = 08, min = 00, sec = 00 }
    --     self.结束时间 = os.time { year = year, month = month, day = day, hour = 22, min = 00, sec = 00 }
    --     self.是否结束 = false
    -- end
end

local _主怪信息 = {
    { 名称 = '满嘴流油的灶神', 模型 = 2168, 数量 = 200 },
    { 名称 = '东逃西窜的灶神', 模型 = 2168 , 数量 = 20},
    { 名称 = '狼狈不堪的灶神', 模型 = 2168 , 数量 = 20},
    { 名称 = '气急败坏的灶神', 模型 = 2168, 数量 = 20 },

}

function 事件:取怪物数量(名称)
    local 数量 = 0
    local map = self:取地图(1001)
    for k, v in map:遍历NPC() do
        if v.名称 == 名称 then
            数量 = 数量 + 1
        end
    end
    return 数量
end

function 事件:清除所有怪物()
    local map = self:取地图(1001 , 1194)
    for i = 1, #_主怪信息 do
        for k, v in map:遍历NPC() do
            if v.名称 == _主怪信息[i].名称 then
                v:删除()
            end
        end
    end
end

function 事件:更新()
    if self.是否结束 then
        return
    end
    local map = self:取地图(1001)
    self.时间 = os.time() + 30 * 60
    for i = 1, #_主怪信息 do
        for k, v in map:遍历NPC() do
            if v.名称 == _主怪信息[i].名称 and not v.战斗中 then
                v:删除()
            end
        end

        local 刷新数量 = _主怪信息[i].数量
        for _ = 1, 刷新数量 do
            local 方向 = math.random(1, 4)
            local X, Y = map:取随机坐标()
            local NPC = map:添加NPC {
                名称 = _主怪信息[i].名称,
                外形 = _主怪信息[i].模型,
                称谓 = '流油的灶神',
                方向 = 方向,
                脚本 = 'scripts/event/活动7_年年有余_灶神.lua',
                时间 = self.时间,
                X = X,
                Y = Y,
                事件 = self
            }
        end

        self:发送系统('#Y【送灶神】#G原是灶神不满年关供奉，将金鲤王掳走。灶神现逃窜在#W长安城内#G，速将其捉拿，解救金鲤王!', _主怪信息[i].名称)
    end
    return 1800
end


function 事件:事件开始()
    self:更新()
    self:定时(1800, self.更新)
    print('城东保卫战活动开始')
end

function 事件:事件结束()
    self.是否结束 = true
    self:清除所有怪物()
    print('年年有余动结束')
end

--=======================================================

local 对话 = [[灶神不满年关供奉，将金鲤王掳走。我耐王者嘉瑞也。坐拥宝物无数。若能通过我的考验，宝物拱手奉上，准备好了么#55？
menu
1|让我们切磋切磋
2|路过路过
]]

function 事件:NPC对话(玩家, NPC)
    return 对话
end

function 事件:NPC菜单(玩家, i, NPC)
    if NPC and NPC:是否战斗中() then
        return "我正在战斗中"
    end
    if i == '1' then
        if not NPC:是否战斗中() then
            if i == '1' then
                NPC:进入战斗(true)
                local r = 玩家:进入战斗('scripts/event/活动7_年年有余_灶神.lua', NPC)
                NPC:进入战斗(false)
                if r then
                    self:完成(玩家)
                    NPC:删除()
                end
            end
        else
            return "我正在战斗中"
        end
    end
end




    local _怪物1 = {
        { 外形 = 2168,
            名称 = "灶神",
            等级 = 120,
            气血 = 525215,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 600,
            抗性 = {
                物理吸收 = 52,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强封印 = 50,
                加强混乱 = 30,
                加强昏睡 = 30,
                忽视抗封 = 30,
                忽视抗睡 = 22,
                忽视抗混 = 22,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                反震几率 = 75,
                反震程度 = 75,
                风法反击 = 75,
                每回合HP = 18000

            },
            技能 = {
                { 名称 = "失心狂乱", 熟练度 = 25000 },
                { 名称 = "借刀杀人", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
        },
        {
            外形 = 2168,
           
            名称 = "油",
            等级 = 120,
            气血 = 382215,
            魔法 = 20000 ,
            攻击 = 54584 ,
            速度 = 2100,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15

            },
            技能 = {

                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        },
        {
            外形 = 2168,
           
            名称 = "油",
            等级 = 120,
            气血 = 382215,
            魔法 = 20000 ,
            攻击 = 54584 ,
            速度 = 2200,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15

            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        },
   {
            外形 = 2168,
           
            名称 = "年",
            等级 = 120,
            气血 = 382215,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 1800,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 41,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强雷 = 200,
                忽视抗雷 = 100,
                抗风 = -60,
                抗火 = -60,
                抗水 = 100,
                抗雷 = 100,
                雷法反击 = 75,
                每回合HP = 18000

            },
            技能 = {
                { 名称 = "天诛地灭", 熟练度 = 25000 },
                { 名称 = "天诛地灭", 熟练度 = 25000 },
                { 名称 = "天诛地灭", 熟练度 = 25000 },
                { 名称 = "电闪雷鸣", 熟练度 = 25000 }
            },
            施法几率 = 100,
            是否消失 = false,
        },
 {
            外形 = 2168,
           
            名称 = "年",
            等级 = 120,
            气血 = 382215,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 500,
            抗性 = {
                物理吸收 = 45,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强封印 = 50,
                加强混乱 = 30,
                加强昏睡 = 30,
                忽视抗封 = 30,
                忽视抗睡 = 22,
                忽视抗混 = 22,
                抗风 = 10,
                抗火 = 10,
                抗水 = 10,
                抗雷 = 10,
                反震几率 = 75,
                反震程度 = 75,
                风法反击 = 15,
                水法反击 = 15,
                每回合HP = 18000

            },
            技能 = {
                { 名称 = "四面楚歌", 熟练度 = 25000 },
                { 名称 = "失心狂乱", 熟练度 = 25000 },

            },
            施法几率 = 100,
            是否消失 = false,
        },
 {
            外形 = 2168,
       
            名称 = "吃货",
            等级 = 120,
            气血 = 382215,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 1700,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 41,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强封印 = 30,
                加强混乱 = 30,
                加强昏睡 = 30,
                忽视抗封 = 22,
                忽视抗睡 = 22,
                加强毒 = 75,
                加强毒伤害 = 72158,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                反震几率 = 75,
                反震程度 = 75,
                雷法反击 = 75,
                每回合HP = 18000

            },
            技能 = {
                { 名称 = "万毒攻心", 熟练度 = 25000 },
                { 名称 = "四面楚歌", 熟练度 = 25000 },

            },
            是否消失 = false,
        },
  {
            外形 = 2168,
           
            名称 = "有",
            等级 = 120,
            气血 = 382215,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 1600,
            抗性 = {
                物理吸收 = 39,
                抗震慑 = 22,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强水 = 200,
                忽视抗水 = 100,
                抗风 = 60,
                抗火 = -60,
                抗水 = 100,
                抗雷 = -60,
                水法反击 = 75,
                每回合HP = 18000

            },
            技能 = {
                { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "蛟龙出海", 熟练度 = 25000 }

            },
            施法几率 = 100,
            是否消失 = false,
        },
  {
            外形 = 2168,
           
            名称 = "余",
            等级 = 120,
            气血 = 382215,
            魔法 = 20000 ,
            攻击 = 39954 ,
            速度 = 800,
            抗性 = {
                物理吸收 = 10,
                抗震慑 = 60,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20

            },
            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 25000 },
                { 名称 = "含情脉脉", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
          },
        }




        local _怪物2 = {
            {外形 = 2168,
            名称 = "灶神",
            等级 = 120,
            气血 = 682545,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 600,
            抗性 = {
                物理吸收 = 45,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强封印 = 50,
                加强混乱 = 30,
                加强昏睡 = 30,
                忽视抗封 = 30,
                忽视抗睡 = 22,
                忽视抗混 = 22,
                抗风 = 10,
                抗火 = 10,
                抗水 = 10,
                抗雷 = 10,
                反震几率 = 75,
                反震程度 = 75,
                风法反击 = 15,
                水法反击 = 15,
                每回合HP = 18000

            },
            技能 = {
                { 名称 = "四面楚歌", 熟练度 = 25000 },
                { 名称 = "失心狂乱", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
        },
   {
            外形 = 2169,
         
            名称 = "甜",
            等级 = 120,
            气血 = 475215,
            魔法 = 20000 ,
            攻击 = 39954 ,
            速度 = 2400,
            抗性 = {
                物理吸收 = 45,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 60,
                抗火 = 60,
                抗水 = -20,
                抗雷 = -20

            },
            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 25000 },
                { 名称 = "乾坤借速", 熟练度 = 25000 },
            },
            施法几率 = 80,
            是否消失 = false,
        },
 {
            外形 = 2169,
           
            名称 = "甜",
            等级 = 120,
            气血 = 475215,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 1400,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 41,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强风 = 100,
                加强雷 = 100,
                忽视抗风 = 50,
                忽视抗雷 = 50,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                风法反击 = 75,
                雷法反击 = 75,

            },
            技能 = {
                { 名称 = "袖里乾坤", 熟练度 = 25000 },
                { 名称 = "天诛地灭", 熟练度 = 25000 }
            },
            施法几率 = 100,
            是否消失 = false,
        },
    {
            外形 = 2169,
         
            名称 = "糖",
            等级 = 120,
            气血 = 475215,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 300,
            抗性 = {
                物理吸收 = 52,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强封印 = 50,
                加强混乱 = 30,
                加强昏睡 = 30,
                忽视抗封 = 30,
                忽视抗睡 = 22,
                忽视抗混 = 22,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                反震几率 = 75,
                反震程度 = 75,
                风法反击 = 75,
                每回合HP = 18000

            },
            技能 = {
                { 名称 = "失心狂乱", 熟练度 = 25000 },
                { 名称 = "借刀杀人", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
        },
 {
            外形 = 2169,
   
            名称 = "糖",
            等级 = 120,
            气血 = 475215,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 1700,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 41,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强封印 = 30,
                加强混乱 = 30,
                加强昏睡 = 30,
                忽视抗封 = 22,
                忽视抗睡 = 22,
                加强毒 = 75,
                加强毒伤害 = 72158,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                反震几率 = 75,
                反震程度 = 75,
                雷法反击 = 75,
                每回合HP = 18000

            },
            技能 = {
                { 名称 = "万毒攻心", 熟练度 = 25000 },
                { 名称 = "四面楚歌", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
        },
    {
            外形 = 2169,
     
            名称 = "甜官",
            等级 = 120,
            气血 = 475215,
            魔法 = 20000 ,
            攻击 = 54584 ,
            速度 = 2300,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15

            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },

            },
            施法几率 = 5,
            是否消失 = false,
        },
      {
            外形 = 2169,
           
            名称 = "蜜",
            等级 = 120,
            气血 = 475215,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 900,
            抗性 = {
                物理吸收 = 25,
                抗震慑 = 49,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强火 = 100,
                加强雷 = 100,
                忽视抗火 = 50,
                忽视抗雷 = 50,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                雷法反击 = 75,
                火法反击 = 75

            },
            技能 = {
                { 名称 = "天诛地灭", 熟练度 = 25000 },
                { 名称 = "九阴纯火", 熟练度 = 25000 },

            },
            施法几率 = 100,
            是否消失 = false,
        },
       {
            外形 = 2169,
          
            名称 = "蜜",
            等级 = 120,
            气血 = 475215,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 2600,
            抗性 = {
                物理吸收 = 39,
                抗震慑 = 22,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强水 = 200,
                忽视抗水 = 100,
                抗风 = 60,
                抗火 = -60,
                抗水 = 100,
                抗雷 = -60,
                水法反击 = 75,
                每回合HP = 18000

            },
            技能 = {
                { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "蛟龙出海", 熟练度 = 25000 }
            },
            施法几率 = 100,
            是否消失 = false,
          },
        }
    

        local _精英 = {
            {外形 = 2168,
            名称 = "灶神",
            等级 = 120,
            气血 = 725545,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 2500,
            抗性 = {
                物理吸收 = 52,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强封印 = 50,
                加强混乱 = 30,
                加强昏睡 = 30,
                忽视抗封 = 30,
                忽视抗睡 = 22,
                忽视抗混 = 22,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                反震几率 = 75,
                反震程度 = 75,
                风法反击 = 75,
                每回合HP = 18000

            },
            技能 = {
                { 名称 = "失心狂乱", 熟练度 = 25000 },
                { 名称 = "借刀杀人", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
        },
      {
            外形 = 2377,
            名称 = "怒",
            等级 = 120,
            气血 = 587454,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 2600,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 41,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强风 = 100,
                加强雷 = 100,
                忽视抗风 = 50,
                忽视抗雷 = 50,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                风法反击 = 75,
                雷法反击 = 75,

            },
            技能 = {
                { 名称 = "袖里乾坤", 熟练度 = 25000 },
                { 名称 = "天诛地灭", 熟练度 = 25000 }
            },
            施法几率 = 100,
            是否消失 = false,
        },
       {
            外形 = 2377,
            名称 = "昏",
            等级 = 120,
            气血 = 587454,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 600,
            抗性 = {
                物理吸收 = 25,
                抗震慑 = 49,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强火 = 100,
                加强雷 = 100,
                忽视抗火 = 50,
                忽视抗雷 = 50,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                雷法反击 = 75,
                火法反击 = 75

            },
            技能 = {
                { 名称 = "天诛地灭", 熟练度 = 25000 },
                { 名称 = "九阴纯火", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
        },
      {
            外形 = 2377,
            名称 = "和",
            等级 = 120,
            气血 = 587454,
            魔法 = 20000 ,
            攻击 = 54584 ,
            速度 = 1000,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15

            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },


            },
            施法几率 = 5,
            是否消失 = false,
        },
     {
            外形 = 2377,
            名称 = "如",
            等级 = 120,
            气血 = 587454,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 2500,
            抗性 = {
                物理吸收 = 72,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强封印 = 30,
                加强混乱 = 30,
                加强昏睡 = 50,
                忽视抗封 = 22,
                忽视抗睡 = 30,
                忽视抗混 = 22,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                反震几率 = 75,
                反震程度 = 75,
                水法反击 = 75,
                每回合HP = 18000

            },
            技能 = {
                { 名称 = "百日眠", 熟练度 = 25000 },
                { 名称 = "四面楚歌", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
        },
       {
            外形 = 2377,
            染色方案 = true,
            染色 = 0x02020202,
            名称 = "冷静",
            等级 = 120,
            气血 = 587454,
            魔法 = 20000 ,
            攻击 = 39954 ,
            速度 = 200,
            抗性 = {
                物理吸收 = 45,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 60,
                抗火 = 60,
                抗水 = -20,
                抗雷 = -20

            },
            技能 = {

                { 名称 = "阎罗追命", 熟练度 = 25000 },
                { 名称 = "乾坤借速", 熟练度 = 25000 },
            },
            施法几率 = 80,
            是否消失 = false,
        },
    {
            外形 = 2377,
            名称 = "祥",
            等级 = 120,
            气血 = 587454,
            魔法 = 20000 ,
            攻击 = 54584 ,
            速度 = 2800,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15

            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        },
      {
            外形 = 2377,
            名称 = "意",
            等级 = 120,
            气血 = 587454,
            魔法 = 20000 ,
            攻击 = 39954 ,
            速度 = 1800,
            抗性 = {
                物理吸收 = 10,
                抗震慑 = 60,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20

            },
            技能 = {

                { 名称 = "阎罗追命", 熟练度 = 25000 },
                { 名称 = "含情脉脉", 熟练度 = 25000 },
            },
            施法几率 = 80,
            是否消失 = false,
        },
        }
       
    
        local _首领  = {
            { 外形 = 2168,
            名称 = "灶神",
            等级 = 120,
            气血 = 885458,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 1600,
            抗性 = {
                物理吸收 = 52,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强封印 = 50,
                加强混乱 = 30,
                加强昏睡 = 30,
                忽视抗封 = 30,
                忽视抗睡 = 22,
                忽视抗混 = 22,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                反震几率 = 75,
                反震程度 = 75,
                风法反击 = 75,
                每回合HP = 18000

            },
            技能 = {
                { 名称 = "失心狂乱", 熟练度 = 25000 },
                { 名称 = "借刀杀人", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
        },
      {
            外形 = 2168,
            名称 = "灶神",
            等级 = 120,
            气血 = 71545,
            魔法 = 20000 ,
            攻击 = 39954 ,
            速度 = 2400,
            抗性 = {
                物理吸收 = 45,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = -60,
                抗火 = -60,
                抗水 = -20,
                抗雷 = -20

            },
            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
            },
            施法几率 = 80,
            是否消失 = false,
        },
  {
            外形 = 2168,
            名称 = "灶神",
            等级 = 120,
            气血 = 71545,
            魔法 = 20000 ,
            攻击 = 39954 ,
            速度 = 800,
            抗性 = {
                物理吸收 = 10,
                抗震慑 = 60,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20

            },
            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 25000 },
                { 名称 = "含情脉脉", 熟练度 = 25000 },
            },
            施法几率 = 80,
            是否消失 = false,
        },
        {
            外形 = 2168,
            名称 = "灶神",
            等级 = 120,
            气血 = 71545,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 1900,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 41,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强火 = 200,
                忽视抗火 = 100,
                抗风 = -60,
                抗火 = 100,
                抗水 = -60,
                抗雷 = 60,
                火法反击 = 75,
                每回合HP = 18000

            },
            技能 = {
                { 名称 = "九阴纯火", 熟练度 = 25000 },
                { 名称 = "九阴纯火", 熟练度 = 25000 },
                { 名称 = "九阴纯火", 熟练度 = 25000 },
                { 名称 = "烈火骄阳", 熟练度 = 25000 }
            },
            施法几率 = 100,
            是否消失 = false,
        },
        {
            外形 = 2168,
            名称 = "灶神",
            等级 = 120,
            气血 = 71545,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 1800,
            抗性 = {
                物理吸收 = 39,
                抗震慑 = 22,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强水 = 200,
                忽视抗水 = 100,
                抗风 = 60,
                抗火 = -60,
                抗水 = 100,
                抗雷 = -60,
                水法反击 = 75,
                每回合HP = 18000

            },
            技能 = {
                { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "蛟龙出海", 熟练度 = 25000 }
            },
            施法几率 = 100,
            是否消失 = false,
        },
        {
            外形 = 2168,
            名称 = "灶神",
            等级 = 120,
            气血 = 71545,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 2870,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 41,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强封印 = 50,
                加强毒 = 30,
                加强毒伤害 = 42158,
                加强昏睡 = 30,
                忽视抗封 = 30,
                忽视抗睡 = 22,
                忽视抗混 = 22,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                反震几率 = 75,
                反震程度 = 75,
                火法反击 = 75,
                每回合HP = 18000

            },
            技能 = {
                { 名称 = "四面楚歌", 熟练度 = 25000 },
                { 名称 = "万毒攻心", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
        },
        {
            外形 = 2168,
            名称 = "灶神",
            等级 = 120,
            气血 = 71545,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 100,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 41,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强风 = 200,
                忽视抗风 = 100,
                抗风 = 100,
                抗火 = -60,
                抗水 = 100,
                抗雷 = -60,
                风法反击 = 75,
                每回合HP = 18000

            },
            技能 = {
                { 名称 = "袖里乾坤", 熟练度 = 25000 },
                { 名称 = "袖里乾坤", 熟练度 = 25000 },
                { 名称 = "袖里乾坤", 熟练度 = 25000 },
                { 名称 = "风雷涌动", 熟练度 = 25000 }
            },
            施法几率 = 100,
            是否消失 = false,
        },
        {
            外形 = 2168,
            名称 = "灶神",
            等级 = 120,
            气血 = 71545,
            魔法 = 20000 ,
            攻击 = 19954 ,
            速度 = 2500,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 41,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强雷 = 200,
                忽视抗雷 = 100,
                抗风 = -60,
                抗火 = -60,
                抗水 = 100,
                抗雷 = 100,
                雷法反击 = 75,
                每回合HP = 18000

            },
            技能 = {
                { 名称 = "天诛地灭", 熟练度 = 25000 },
                { 名称 = "天诛地灭", 熟练度 = 25000 },
                { 名称 = "天诛地灭", 熟练度 = 25000 },
                { 名称 = "电闪雷鸣", 熟练度 = 25000 }
            },
            施法几率 = 100,
            是否消失 = false,
        },
    }


        function 事件:战斗初始化(玩家, NPC)
        if NPC.名称 == '满嘴流油的灶神' then
            local num = math.random(7, 8)
            for i = 1, num do
                local r = 生成战斗怪物(_怪物1[i])
                self:加入敌方(i, r)
            end
        elseif NPC.名称 == '东逃西窜的灶神' then
            local num = math.random(7, 8)
            for i = 1, num do
                local r = 生成战斗怪物(_怪物2[i])
                self:加入敌方(i, r)
            end
        elseif NPC.名称 == '狼狈不堪的灶神' then
            for i, v in ipairs(_精英) do
                local r = 生成战斗怪物(v)
                self:加入敌方(i, r)
            end
        elseif NPC.名称 == '气急败坏的灶神' then
            for i, v in ipairs(_首领) do
                local r = 生成战斗怪物(v)
                self:加入敌方(i, r)
            end
        end
    end

  
function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end

function 事件:完成(玩家, NPC)
    for k, v in 玩家:遍历队伍() do
        self:掉落包(v, NPC)
    end
end

local _广播 = {
    [1] =  "#R%s#C在#Y年年有余#C，成功阻击前来捣乱的#Y满嘴流油的灶神#C，还从对方的私藏中拿了颗#G#m(%s)[%s]#m#n#C作为战利品#89",
    [2] =  "#R%s#C在#Y年年有余#C，成功阻击前来捣乱的#Y东逃西窜的灶神#C，还从对方的私藏中拿了颗#G#m(%s)[%s]#m#n#C作为战利品#89",
    [3] =  "#R%s#C在#Y年年有余#C，成功阻击前来捣乱的#Y狼狈不堪的灶神#C，还从对方的私藏中拿了颗#G#m(%s)[%s]#m#n#C作为战利品#89",
    [4] =  "#R%s#C在#Y年年有余#C，成功阻击前来捣乱的#Y气急败坏的灶神#C，还从对方的私藏中拿了颗#G#m(%s)[%s]#m#n#C作为战利品#89",
}


function 事件:掉落包(玩家, NPC)
    if 玩家:取活动限制次数('年年有余_灶神') >= 60 then
        return
    end
    玩家:增加活动限制次数('年年有余_灶神')

 local 掉落包 = 取掉落包('活动', '年年有余1')


 if 掉落包 then
    if NPC.名称 == '满嘴流油的灶神' then
        local 经验 = 466500
        玩家:添加经验(经验)
        玩家:添加参战召唤兽经验(经验 * 1.5)

        奖励掉落包物品(玩家, 掉落包[1], _广播[1])
    elseif NPC.名称 == '东逃西窜的灶神' then
        local 经验 = 668900
        玩家:添加经验(经验)
        玩家:添加参战召唤兽经验(经验 * 1.5)

        奖励掉落包物品(玩家, 掉落包[2], _广播[2])

    elseif NPC.名称 == '狼狈不堪的灶神' then
        local 经验 = 668900
        玩家:添加经验(经验)
        玩家:添加参战召唤兽经验(经验 * 1.5)

        奖励掉落包物品(玩家, 掉落包[3], _广播[3])    

    elseif NPC.名称 == '气急败坏的灶神' then
        local 经验 = 668900
        玩家:添加经验(经验)
        玩家:添加参战召唤兽经验(经验 * 1.5)

        奖励掉落包物品(玩家, 掉落包[4], _广播[4])
    end   

 end
end

return 事件
