local 事件 = {
    名称 = '城东保卫战',
    类型 = '活动',
    是否打开 = true,
    是否可接任务 = true,
}

function 事件:事件初始化()
    -- 开启时间：周四早8点到晚10点
    if os.date('%w', os.time()) == '5' then
        print('星期五，开启城东保卫战活动')
        local year = tonumber(os.date('%Y', os.time()))
        local month = tonumber(os.date('%m', os.time()))
        local day = tonumber(os.date('%d', os.time()))
        self.开始时间 = os.time { year = year, month = month, day = day, hour = 08, min = 00, sec = 00 }
        self.结束时间 = os.time { year = year, month = month, day = day, hour = 22, min = 00, sec = 00 }
        self.是否结束 = false
    end
end

local _主怪信息 = {
    [1] = { 名称 = '夜叉王', 模型 = 2072, 数量 = 40 },
    [2] = { 名称 = '龟丞相', 模型 = 2064, 数量 = 30 },
    [3] = { 名称 = '泾河龙鬼', 模型 = 2076, 数量 = 20 },
    [4] = { 名称 = '东海龙王', 模型 = 3074, 数量 = 10 },
}

function 事件:取怪物数量(名称)
    local 数量 = 0
    local map = self:取地图(1193)
    for k, v in map:遍历NPC() do
        if v.名称 == 名称 then
            数量 = 数量 + 1
        end
    end
    return 数量
end

function 事件:清除所有怪物()
    local map = self:取地图(1193)
    for i = 1, #_主怪信息 do
        for k, v in map:遍历NPC() do
            if v.名称 == _主怪信息[i].名称 then
                v:删除()
            end
        end
    end
end

function 事件:更新()
    if self.是否结束 then
        return
    end
    local map = self:取地图(1193)
    self.时间 = os.time() + 30 * 60
    for i = 1, #_主怪信息 do
        for k, v in map:遍历NPC() do
            if v.名称 == _主怪信息[i].名称 and not v.战斗中 then
                v:删除()
            end
        end

        local 刷新数量 = _主怪信息[i].数量
        for _ = 1, 刷新数量 do
            local 方向 = math.random(1, 4)
            local X, Y = map:取随机坐标()
            local NPC = map:添加NPC {
                名称 = _主怪信息[i].名称,
                外形 = _主怪信息[i].模型,
                称谓 = '城东保卫战',
                方向 = 方向,
                脚本 = 'scripts/event/活动6_城东保卫战.lua',
                时间 = self.时间,
                X = X,
                Y = Y,
                事件 = self
            }
        end

        self:发送系统('#Y【城东保卫战】#R%s#G在#Y长安东#G向#Y长安城#G发起进攻，唐王下令全体军民誓死抵御来犯之敌#G犯我中华者虽远必诛#90', _主怪信息[i].名称)
    end
    return 1800
end

function 事件:事件开始()
    self:更新()
    self:定时(1800, self.更新)
    print('城东保卫战活动开始')
end

function 事件:事件结束()
    self.是否结束 = true
    self:清除所有怪物()
    print('城东保卫战活动结束')
end

--=======================================================
local 对话 = [[
没想到我躲在这里，也会被你们发现，休想抓我回去。#4
menu
1|妖孽，受死吧
2|我认错人了
]]
function 事件:NPC对话(玩家, NPC)
    return 对话
end

function 事件:NPC菜单(玩家, i, NPC)
    if NPC and NPC:是否战斗中() then
        return "我正在战斗中"
    end
    if i == '1' then
        if not NPC:是否战斗中() then
            if i == '1' then
                NPC:进入战斗(true)
                local r = 玩家:进入战斗('scripts/event/活动6_城东保卫战.lua', NPC)
                NPC:进入战斗(false)
                if r then
                    self:完成(玩家, NPC)
                    NPC:删除()
                end
            end
        else
            return "我正在战斗中"
        end
    end
end

local _怪物1 = {
    {
        名称 = '夜叉王',
        外形 = 2072,
        等级 = 80,
        气血 = 162587,
        魔法 = 107000,
        攻击 = 5500,
        速度 = 530,
        抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 12 },
        技能 = { { 名称 = "九龙冰封", 熟练度 = 1000 }, { 名称 = "九阴纯火", 熟练度 = 1000 } },
        施法几率 = 50,
    },
    { 名称 = '虾兵', 外形 = 2062, 等级 = 80, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 380, 抗性 = { 抗混乱 = 20, 抗昏睡 = 20, 抗封印 = 20, 抗震慑 = 5 }, 技能 = { '天诛地灭', '袖里乾坤' } },
    { 名称 = '蟹将', 外形 = 2063, 等级 = 80, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 380, 抗性 = { 抗混乱 = 20, 抗昏睡 = 20, 抗封印 = 20, 抗震慑 = 5 }, 技能 = { '魔神附身', '阎罗追命' } },
    { 名称 = '虾兵', 外形 = 2062, 等级 = 80, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 380, 抗性 = { 抗混乱 = 20, 抗昏睡 = 20, 抗封印 = 20, 抗震慑 = 5 }, 技能 = { '九龙冰封', '九阴纯火' } },
    { 名称 = '蟹将', 外形 = 2063, 等级 = 80, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 380, 抗性 = { 抗混乱 = 20, 抗昏睡 = 20, 抗封印 = 20, 抗震慑 = 5 }, 技能 = { '含情脉脉', '阎罗追命' } },
    { 名称 = '水妖', 外形 = 2069, 等级 = 80, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 380, 抗性 = { 抗混乱 = 20, 抗昏睡 = 20, 抗封印 = 20, 抗震慑 = 5 }, 技能 = { '百日面', '失心狂乱' } },
    { 名称 = '水妖', 外形 = 2069, 等级 = 80, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 380, 抗性 = { 抗混乱 = 20, 抗昏睡 = 20, 抗封印 = 20, 抗震慑 = 5 }, 技能 = { '离魂咒', '百日眠' } },

    { 名称 = '海龟', 外形 = 2036, 等级 = 80, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 380, 抗性 = { 抗混乱 = 10, 抗昏睡 = 10, 抗封印 = 10 } },
    { 名称 = '毒蛇', 外形 = 2031, 等级 = 80, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 380, 抗性 = { 抗混乱 = 10, 抗昏睡 = 10, 抗封印 = 10 } },
    { 名称 = '飞鱼', 外形 = 2032, 等级 = 80, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 380, 抗性 = { 抗混乱 = 10, 抗昏睡 = 10, 抗封印 = 10 } },
}

local _怪物2 = {
    {
        名称 = '龟丞相',
        外形 = 2064,
        等级 = 80,
        气血 = 162587,
        魔法 = 107000,
        攻击 = 5500,
        速度 = 580,
        抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 12 },
        技能 = { { 名称 = "九龙冰封", 熟练度 = 1000 }, { 名称 = "九阴纯火", 熟练度 = 1000 } },
        施法几率 = 50,
    },
    { 名称 = '虾兵', 外形 = 2062, 等级 = 60, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 480, 抗性 = { 抗混乱 = 20, 抗昏睡 = 20, 抗封印 = 20, 抗震慑 = 5 }, 技能 = { '天诛地灭', '袖里乾坤' } },
    { 名称 = '蟹将', 外形 = 2063, 等级 = 60, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 480, 抗性 = { 抗混乱 = 20, 抗昏睡 = 20, 抗封印 = 20, 抗震慑 = 5 }, 技能 = { '魔神附身', '阎罗追命' } },
    { 名称 = '虾兵', 外形 = 2062, 等级 = 60, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 480, 抗性 = { 抗混乱 = 20, 抗昏睡 = 20, 抗封印 = 20, 抗震慑 = 5 }, 技能 = { '九龙冰封', '九阴纯火' } },
    { 名称 = '蟹将', 外形 = 2063, 等级 = 60, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 480, 抗性 = { 抗混乱 = 20, 抗昏睡 = 20, 抗封印 = 20, 抗震慑 = 5 }, 技能 = { '含情脉脉', '阎罗追命' } },
    { 名称 = '水妖', 外形 = 2069, 等级 = 60, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 480, 抗性 = { 抗混乱 = 20, 抗昏睡 = 20, 抗封印 = 20, 抗震慑 = 5 }, 技能 = { '百日面', '失心狂乱' } },
    { 名称 = '水妖', 外形 = 2069, 等级 = 60, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 480, 抗性 = { 抗混乱 = 20, 抗昏睡 = 20, 抗封印 = 20, 抗震慑 = 5 }, 技能 = { '离魂咒', '百日眠' } },

    { 名称 = '海龟', 外形 = 2036, 等级 = 80, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 480, 抗性 = { 抗混乱 = 10, 抗昏睡 = 10, 抗封印 = 10 } },
    { 名称 = '毒蛇', 外形 = 2031, 等级 = 80, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 480, 抗性 = { 抗混乱 = 10, 抗昏睡 = 10, 抗封印 = 10 } },
    { 名称 = '飞鱼', 外形 = 2032, 等级 = 80, 气血 = 122587, 魔法 = 87000, 攻击 = 3500, 速度 = 480, 抗性 = { 抗混乱 = 10, 抗昏睡 = 10, 抗封印 = 10 } },
}

local _精英 = {
    {
        名称 = '泾河龙鬼',
        外形 = 2076,
        等级 = 100,
        气血 = 462587,
        魔法 = 207000,
        攻击 = 12500,
        速度 = 580,
        抗性 = { 抗混乱 = 50, 抗昏睡 = 50, 抗封印 = 50, 抗震慑 = 16 },
        技能 = { { 名称 = "九龙冰封", 熟练度 = 5000 }, { 名称 = "九阴纯火", 熟练度 = 5000 } },
        施法几率 = 80,
    },
    { 名称 = '复活女娲', 外形 = 2288, 等级 = 100, 气血 = 352587, 魔法 = 287000, 攻击 = 10500, 速度 = 280, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 12 }, 技能 = { '天诛地灭', '袖里乾坤' }, 熟练度 = 3000, 施法几率 = 80 },
    { 名称 = '复活女娲', 外形 = 2288, 等级 = 100, 气血 = 352587, 魔法 = 287000, 攻击 = 10500, 速度 = 280, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 12 }, 技能 = { '魔神附身', '阎罗追命' }, 熟练度 = 3000, 施法几率 = 80 },
    { 名称 = '虾兵', 外形 = 2062, 等级 = 80, 气血 = 242587, 魔法 = 187000, 攻击 = 8500, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '九龙冰封', '九阴纯火' }, 熟练度 = 3000, 施法几率 = 80 },
    { 名称 = '虾兵', 外形 = 2062, 等级 = 80, 气血 = 242587, 魔法 = 187000, 攻击 = 8500, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '九龙冰封', '九阴纯火' }, 熟练度 = 3000, 施法几率 = 80 },
    { 名称 = '蟹将', 外形 = 2063, 等级 = 80, 气血 = 242587, 魔法 = 187000, 攻击 = 8500, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '含情脉脉', '阎罗追命' }, 熟练度 = 3000, 施法几率 = 80 },
    { 名称 = '蟹将', 外形 = 2063, 等级 = 80, 气血 = 242587, 魔法 = 187000, 攻击 = 8500, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '含情脉脉', '阎罗追命' }, 熟练度 = 3000, 施法几率 = 80 },
    { 名称 = '蟹将', 外形 = 2063, 等级 = 80, 气血 = 242587, 魔法 = 187000, 攻击 = 8500, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '含情脉脉', '阎罗追命' }, 熟练度 = 3000, 施法几率 = 80 },
    { 名称 = '水妖', 外形 = 2069, 等级 = 80, 气血 = 242587, 魔法 = 187000, 攻击 = 8500, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '百日面', '失心狂乱' }, 熟练度 = 3000, 施法几率 = 80 },
    { 名称 = '水妖', 外形 = 2069, 等级 = 80, 气血 = 242587, 魔法 = 187000, 攻击 = 8500, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8 }, 技能 = { '离魂咒', '百日眠' }, 熟练度 = 3000, 施法几率 = 80 },
}

local _首领 = {
    {
        名称 = '东海龙王',
        外形 = 3074,
        等级 = 120,
        气血 = 1262587,
        魔法 = 1207000,
        攻击 = 42500,
        速度 = 780,
        抗性 = { 抗混乱 = 80, 抗昏睡 = 80, 抗封印 = 80, 抗震慑 = 18 },
        技能 = { { 名称 = "九龙冰封", 熟练度 = 15000 }, { 名称 = "九阴纯火", 熟练度 = 15000 } },
        施法几率 = 80,
    },
    {
        名称 = '泾河龙鬼',
        外形 = 2076,
        等级 = 120,
        气血 = 462587,
        魔法 = 207000,
        攻击 = 12500,
        速度 = 580,
        抗性 = { 抗混乱 = 50, 抗昏睡 = 50, 抗封印 = 50, 抗震慑 = 16 },
        技能 = { { 名称 = "九龙冰封", 熟练度 = 12000 }, { 名称 = "九阴纯火", 熟练度 = 12000 } },
        施法几率 = 80,
    },
    {
        名称 = '复活女娲',
        外形 = 2076,
        等级 = 120,
        气血 = 462587,
        魔法 = 207000,
        攻击 = 12500,
        速度 = 530,
        抗性 = { 抗混乱 = 50, 抗昏睡 = 50, 抗封印 = 50, 抗震慑 = 16 },
        技能 = { { 名称 = "天诛地灭", 熟练度 = 12000 }, { 名称 = "袖里乾坤", 熟练度 = 12000 } },
        施法几率 = 80,
    },
    {
        名称 = '夜叉王',
        外形 = 2072,
        等级 = 120,
        气血 = 362587,
        魔法 = 107000,
        攻击 = 5500,
        速度 = 530,
        抗性 = { 抗混乱 = 45, 抗昏睡 = 45, 抗封印 = 45, 抗震慑 = 12 },
        技能 = { { 名称 = "九龙冰封", 熟练度 = 11000 }, { 名称 = "九阴纯火", 熟练度 = 11000 } },
        施法几率 = 80,
    },
    {
        名称 = '龟丞相',
        外形 = 2064,
        等级 = 120,
        气血 = 362587,
        魔法 = 107000,
        攻击 = 5500,
        速度 = 530,
        抗性 = { 抗混乱 = 45, 抗昏睡 = 45, 抗封印 = 45, 抗震慑 = 12 },
        技能 = { { 名称 = "九龙冰封", 熟练度 = 11000 }, { 名称 = "九阴纯火", 熟练度 = 11000 } },
        施法几率 = 80,
    },
    { 名称 = '水妖', 外形 = 2069, 等级 = 100, 气血 = 322587, 魔法 = 287000, 攻击 = 38500, 速度 = 440, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 10 }, 技能 = { '失心狂乱', '借刀杀人' }, 熟练度 = 10000, 施法几率 = 80 },
    { 名称 = '虾兵', 外形 = 2062, 等级 = 100, 气血 = 322587, 魔法 = 287000, 攻击 = 38500, 速度 = 440, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 10 }, 技能 = { '九龙冰封', '九阴纯火' }, 熟练度 = 10000, 施法几率 = 80 },
    { 名称 = '虾兵', 外形 = 2062, 等级 = 100, 气血 = 322587, 魔法 = 287000, 攻击 = 38500, 速度 = 440, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 10 }, 技能 = { '九龙冰封', '九阴纯火' }, 熟练度 = 10000, 施法几率 = 80 },
    { 名称 = '蟹将', 外形 = 2063, 等级 = 100, 气血 = 322587, 魔法 = 287000, 攻击 = 48500, 速度 = 440, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 10 }, 技能 = { '含情脉脉', '阎罗追命' }, 熟练度 = 10000, 施法几率 = 30 },
    { 名称 = '蟹将', 外形 = 2063, 等级 = 100, 气血 = 322587, 魔法 = 287000, 攻击 = 48500, 速度 = 440, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 10 }, 技能 = { '含情脉脉', '阎罗追命' }, 熟练度 = 10000, 施法几率 = 30 },

}

function 事件:战斗初始化(玩家, NPC)
    if NPC.名称 == '夜叉王' then
        local num = math.random(7, 10)
        for i = 1, num do
            local r = 生成战斗怪物(_怪物1[i])
            self:加入敌方(i, r)
        end
    elseif NPC.名称 == '龟丞相' then
        local num = math.random(7, 10)
        for i = 1, num do
            local r = 生成战斗怪物(_怪物2[i])
            self:加入敌方(i, r)
        end
    elseif NPC.名称 == '泾河龙鬼' then
        for i, v in ipairs(_精英) do
            local r = 生成战斗怪物(v)
            self:加入敌方(i, r)
        end
    elseif NPC.名称 == '东海龙王' then
        for i, v in ipairs(_首领) do
            local r = 生成战斗怪物(v)
            self:加入敌方(i, r)
        end
    end
end

function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end

function 事件:完成(玩家, NPC)
    for k, v in 玩家:遍历队伍() do
        self:掉落包(v, NPC)
    end
end

local _广播 = {
    [1] = "#R%s#C在#Y长安保卫战中#C，成功阻击前来进攻的#Y夜叉王#C，还从对方的私藏中拿了颗#G#m(%s)[%s]#m#n#C作为战利品#89",
    [2] = "#R%s#C在#Y长安保卫战中#C，成功阻击前来进攻的#Y龟丞相#C，还从对方的私藏中拿了颗#G#m(%s)[%s]#m#n#C作为战利品#89",
    [3] = "#R%s#C在#Y长安保卫战中#C，成功阻击前来进攻的#Y泾河龙鬼#C，还从对方的私藏中拿了颗#G#m(%s)[%s]#m#n#C作为战利品#89",
    [4] = "#R%s#C在#Y长安保卫战中#C，成功阻击前来进攻的#Y东海龙王#C，还从对方的私藏中拿了颗#G#m(%s)[%s]#m#n#C作为战利品#89",
}

function 事件:掉落包(玩家, NPC)
    if 玩家:取活动限制次数('城东保卫战') >= 60 then
        return
    end
    玩家:增加活动限制次数('城东保卫战')

    local 掉落包 = 取掉落包('活动', '城东保卫战')
    if 掉落包 then
        if NPC.名称 == '夜叉王' then
            local 经验 = 350000
            玩家:添加经验(经验)
            玩家:添加参战召唤兽经验(经验 * 1.5)
            -- local 法宝经验 = math.floor(140 + 次数 * 12)
            --     local z = 玩家:取乘骑坐骑()
            --   if z then
            --    z:添加经验(2)
            --    z:添加熟练(2)
            --   end
            奖励掉落包物品(玩家, 掉落包[1], _广播[1])
        elseif NPC.名称 == '龟丞相' then
            local 经验 = 350000
            玩家:添加经验(经验)
            玩家:添加参战召唤兽经验(经验 * 1.5)

            奖励掉落包物品(玩家, 掉落包[1], _广播[2])
        elseif NPC.名称 == '泾河龙鬼' then
            local 经验 = 864000
            玩家:添加经验(经验)
            玩家:添加参战召唤兽经验(经验 * 1.5)

            奖励掉落包物品(玩家, 掉落包[2], _广播[3])
        elseif NPC.名称 == '东海龙王' then
            local 经验 = 1069300
            玩家:添加经验(经验)
            玩家:添加参战召唤兽经验(经验 * 1.5)

            奖励掉落包物品(玩家, 掉落包[3], _广播[4])
        end
    end
end

return 事件
