local 事件 = {
    名称 = '梨园庙会',
    类型 = '活动',
    是否打开 = true,
    是否可接任务 = true,
}

function 事件:事件初始化()
    if os.date('%w', os.time()) == '5' then
        print('星期五，开启梨园庙会')
        local year = tonumber(os.date('%Y', os.time()))
        local month = tonumber(os.date('%m', os.time()))
        local day = tonumber(os.date('%d', os.time()))
        self.开始时间 = os.time { year = year, month = month, day = day, hour = 08, min = 00, sec = 00 }
        self.结束时间 = os.time { year = year, month = month, day = day, hour = 22, min = 00, sec = 00 }
        self.是否结束 = false
    end
end

local _地图 = { 101386 }

local _主怪信息 = {
    [1] = { 名称 = '胡巧儿', 模型 = 3093, 数量 = 20 },
    [2] = { 名称 = '黄火牛', 模型 = 3092, 数量 = 20 },
    [3] = { 名称 = '顶天柱', 模型 = 3091, 数量 = 20 },
    [4] = { 名称 = '乐师', 模型 = 2149, 数量 = 20 },
    [5] = { 名称 = '舞者', 模型 = 2150, 数量 = 20 },
    [6] = { 名称 = '公孙大娘', 模型 = 3033, 数量 = 20 },
}

function 事件:清除所有怪物()
    for ii, vv in ipairs(_地图) do
        local map = self:取地图(vv)
        for i = 1, #_主怪信息 do
            for k, v in map:遍历NPC() do
                if v.名称 == _主怪信息[i].名称 then
                    v:删除()
                end
            end
        end
    end
end

function 事件:更新()
    if self.是否结束 then
        return
    end
    local 地图组 = {}
    self.时间 = os.time() + 30 * 60
    for ii, vv in ipairs(_地图) do
        local map = self:取地图(vv)
        table.insert(地图组, map.名称)
        for i = 1, #_主怪信息 do
            for k, v in map:遍历NPC() do
                if v.名称 == _主怪信息[i].名称 and not v.战斗中 then
                    v:删除()
                end
            end

            local 刷新数量 = _主怪信息[i].数量
            for _ = 1, 刷新数量 do
                local 方向 = math.random(1, 4)
                local X, Y = map:取随机坐标()
                local NPC = map:添加NPC {
                    名称 = _主怪信息[i].名称,
                    外形 = _主怪信息[i].模型,
                    称谓 = '梨园庙会',
                    方向 = 方向,
                    脚本 = 'scripts/event/活动5_梨园庙会.lua',
                    时间 = self.时间,
                    X = X,
                    Y = Y,
                    来源 = self
                }
            end
        end
    end

    self:发送系统('#Y暮春之时，万物生发。为祈祷风调雨顺古物丰收，慰劳我大唐辛勤的子民们，唐王授意举办这热闹的梨园庙会，特邀请我大唐子民前去庙会游玩，欣赏那世代相传的民间曲艺以及玩乐风俗。')
    return 1800
end

function 事件:事件开始()
    self:更新()
    self:定时(1800, self.更新)
    print('梨园庙会活动开始')
end

function 事件:事件结束()
    self.是否结束 = true
    self:清除所有怪物()
    print('梨园庙会活动结束')
end

--=======================================================
local 对话 = [[我们的庙会热闹吗,来一起玩啊#89
menu
1|大胆妖孽,我一眼就看出你不是人
2|挺好玩的
]]
function 事件:NPC对话(玩家, i)
    return 对话
end

function 事件:NPC菜单(玩家, i)
    if i == '1' then
        if not self:是否战斗中() then
            self:进入战斗(true)
            local r = 玩家:进入战斗('scripts/event/活动5_梨园庙会.lua', self)
            self:进入战斗(false)
            if r then
                self:删除()
                self:完成(玩家)
            end
        else
            return "我正在战斗中"
        end
    end
end

--===============================================
function 事件:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性

    怪物属性 = {
        名称 = "瑶姬",
        外形 = 2179,
        等级 = 等级,
        气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = 1870,
        抗性 = {
            物理吸收 = 10,
            抗震慑 = 60,
            抗混乱 = 110,
            抗封印 = 85,
            抗昏睡 = 95,
            加强封印 = 30,
            加强混乱 = 30,
            加强昏睡 = 30,
            忽视抗封 = 22,
            忽视抗睡 = 22,
            忽视抗混 = 22,
        },
        技能 = {
            { 名称 = "乱魂钉", 熟练度 = 10000 },
            { 名称 = "冥烟销骨", 熟练度 = 10000 },
            { 名称 = "血海深仇", 熟练度 = 10000 },
            { 名称 = "孟婆汤", 熟练度 = 10000 },
        },
        施法几率 = 70,
        是否消失 = false,

    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))


    怪物属性 = {
        名称 = "玲珑使者",
        外形 = 2100,
        等级 = 等级,
        气血 = 1552154 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = 1590,
        抗性 = {
            物理吸收 = 60,
            抗震慑 = 10,
            抗风 = 20,
            抗火 = 60,
            抗水 = 20,
            抗雷 = 20,
            抗混乱 = 95,
            抗封印 = 85,
            抗昏睡 = 85,
            忽视防御几率 = 100,
            忽视防御程度 = 100,
            连击率 = 100,
            连击次数 = 5,
            反击率 = 100,
            反击次数 = 5,
            命中率 = 75,
            狂暴几率 = 100,
        },
        技能 = {
        },
        施法几率 = 10,
        是否消失 = false,

    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))
    怪物属性 = {
        名称 = "宝莲使者",
        外形 = 2096,
        等级 = 等级,
        气血 = 1552154 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = 1710,
        抗性 = {
            物理吸收 = 85,
            抗震慑 = 10,
            抗火 = 60,
            抗混乱 = 95,
            抗封印 = 85,
            抗昏睡 = 85,
            忽视防御几率 = 100,
            忽视防御程度 = 100,
            连击率 = 100,
            连击次数 = 3,
            反击率 = 100,
            反击次数 = 5,
            命中率 = 75,
            狂暴几率 = 100,
        },
        技能 = {
        },
        施法几率 = 10,
        是否消失 = false,

    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))
    怪物属性 = {
        名称 = "仙女",
        外形 = 2150,
        等级 = 等级,
        气血 = 1552154 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = -60,
        抗性 = {
            物理吸收 = 60,
            抗震慑 = 10,
            抗火 = 60,
            抗混乱 = 95,
            抗封印 = 85,
            抗昏睡 = 85,
            加强雷 = 100,
            加强风 = 100,
            加强水 = 100,
            忽视抗雷 = 50,
            忽视抗风 = 50,
            忽视抗水 = 50,
            水系狂暴几率 = 30,
            雷系狂暴几率 = 30,
            风系狂暴几率 = 30,
        },
        技能 = {
        },
        施法几率 = 70,
        是否消失 = false,

    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))
    怪物属性 = {
        名称 = "仙女",
        外形 = 2150,
        等级 = 等级,
        气血 = 1552154 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = 1260,
        抗性 = {
            物理吸收 = 60,
            抗震慑 = 10,
            抗火 = 60,
            抗混乱 = 95,
            抗封印 = 85,
            抗昏睡 = 85,
            加强雷 = 100,
            加强风 = 100,
            加强水 = 100,
            忽视抗雷 = 50,
            忽视抗风 = 50,
            忽视抗水 = 50,
            水系狂暴几率 = 30,
            雷系狂暴几率 = 30,
            风系狂暴几率 = 30,
        },
        技能 = {
        },
        施法几率 = 70,
        是否消失 = false,

    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))
    怪物属性 = {
        名称 = "侍女",
        外形 = 2128,
        等级 = 等级,
        气血 = 1552154 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = 10,
        抗性 = {
            物理吸收 = 60,
            抗震慑 = 10,
            抗火 = 60,
            抗混乱 = 85,
            抗封印 = 95,
            抗昏睡 = 95,
        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 10000 },
            { 名称 = "谗言相加", 熟练度 = 10000 },
            { 名称 = "借刀杀人", 熟练度 = 10000 },
        },
        施法几率 = 70,
        是否消失 = false,

    }
    self:加入敌方(6, 生成战斗怪物(怪物属性))
    怪物属性 = {
        名称 = "侍女",
        外形 = 2129,
        等级 = 等级,
        气血 = 1552154 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = 10,
        抗性 = {
            物理吸收 = 60,
            抗震慑 = 10,
            抗火 = 60,
            抗混乱 = 85,
            抗封印 = 95,
            抗昏睡 = 95,
        },
        技能 = {
            { 名称 = "阎罗追命", 熟练度 = 10000 },
        },
        施法几率 = 70,
        是否消失 = false,

    }
    self:加入敌方(7, 生成战斗怪物(怪物属性))
end

function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end

--===============================================
function 事件:完成(玩家)
    for k, v in 玩家:遍历队伍() do
        self:掉落包(v, NPC)
    end
end

local _广播 = '#c44afbf千惊万喜！#50#R%s#c44afbf在梨园庙会中获得了一个#G#m(%s)[%s]#m#n#c00FFFF#40'

function 事件:掉落包(玩家, NPC)
    if 玩家:取活动限制次数('梨园庙会') >= 60 then
        return
    end
    玩家:增加活动限制次数('梨园庙会')

    local 掉落包 = 取掉落包('活动', '梨园庙会')

    if 掉落包 then
        local 经验 = 466500
        玩家:添加经验(经验)
        玩家:添加参战召唤兽经验(经验 * 1.5)

        奖励掉落包物品(玩家, 掉落包, _广播)
    end
end

return 事件
