local 事件 = {
    名称 = '齐力擎天',
    是否打开 = true,
    是否可接任务 = true,
}

function 事件:事件初始化()
    -- 开启时间：周日中午12点到晚上22点
    if os.date('%w', os.time()) == '7' then
        print('星期天，开启齐力擎天活动')
        local year = tonumber(os.date('%Y', os.time()))
        local month = tonumber(os.date('%m', os.time()))
        local day = tonumber(os.date('%d', os.time()))
        self.开始时间 = os.time { year = year, month = month, day = day, hour = 12, min = 00, sec = 00 }
        self.结束时间 = os.time { year = year, month = month, day = day, hour = 22, min = 00, sec = 00 }
        self.是否结束 = false
    end
end

local _主怪信息 = {
    { 名称 = '穷奇', 模型 = 3863, 地图 = 101381, X = 168, Y = 134, 方向 = 1 },
}

function 事件:清除所有怪物()
    for i = 1, #_主怪信息 do
        local map = self:取地图(_主怪信息[i].地图)
        for k, v in map:遍历NPC() do
            if v.名称 == _主怪信息[i].名称 then
                v:删除()
            end
        end
    end
end

function 事件:更新()
    self:清除所有怪物()
    for k, v in pairs(_主怪信息) do
        local map = self:取地图(v.地图)
        local X, Y = map:取随机坐标()
        local NPC = map:添加NPC {
            名称 = v.名称,
            外形 = v.模型,
            称谓 = '力战穷奇',
            方向 = v.方向,
            脚本 = 'scripts/event/活动7_月光爱人_齐力擎天.lua',
            X = v.X,
            Y = v.Y,
            来源 = self
        }
    end
end

function 事件:事件开始()
    self:更新()
    print('齐力擎天活动开始')
end

function 事件:事件结束()
    self:清除所有怪物()
    print('齐力擎天活动结束')
end

--=======================================================
local 对话 = [[
menu
1|挑战神木护法
2|挑战离火护法
3|挑战赤金护法
4|挑战玄水护法
5|挑战穷奇
2|微博之力，无心挑战
]]
function 事件:NPC对话(玩家, i)
    return 对话
end

function 事件:NPC菜单(玩家, i)
    if i == '1' or i == '2' or i == '3' or i == '4' then
        local r = 玩家:进入战斗('scripts/event/活动7_月光爱人_齐力擎天.lua', self, i)
        if r then
            self:完成(玩家, i)
        end
    elseif i == '5' then
        local t = {}
        if not 玩家.是否队长 then
            return "3人或者3人以上挑战"
        end
        if 玩家:取队伍人数() < 3 then
            return "3人或者3人以上挑战"
        end

        for _, v in 玩家:遍历队伍() do
            if v:判断等级是否低于(90) then
                table.insert(t, v.名称)
            end
        end

        if #t > 0 then
            return table.concat(t, '、 ') .. '#W低于90级,无法挑战该任务!'
        end

        for k, v in 玩家:遍历队伍() do
            if v:取活动限制次数("神木护法") < 1 or v:取活动限制次数("离火护法") < 1 or v:取活动限制次数("玄水护法") < 1 or v:取活动限制次数("赤金护法") < 1 then
                table.insert(t, v.名称)
            end
        end

        if #t > 0 then
            return table.concat(t, "、") .. "还没有通过四大护法的考验"
        end

        for k, v in 玩家:遍历队伍() do
            if v:取活动限制次数("齐力擎天") > 0 then
                table.insert(t, v.名称)
            end
        end

        if #t > 0 then
            return table.concat(t, "、") .. "今日已经挑战过该活动了"
        end

        local r = 玩家:进入战斗('scripts/event/活动7_月光爱人_齐力擎天.lua', self, i)
        if r then
            self:完成(玩家, i)
        end
    end
end

--===============================================
function 事件:战斗初始化(玩家, NPC, i)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性 = {}

    if i == '1' then
        怪物属性 = {
            名称 = "神木护法",
            外形 = 6504,
            等级 = 等级,
            气血 = 4552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 19954 + 转生 * 1200 + 等级 * 100,
            速度 = 1870,
            抗性 = {
                物理吸收 = 52,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强封印 = 50,
                加强混乱 = 30,
                加强昏睡 = 30,
                忽视抗封 = 30,
                忽视抗睡 = 22,
                忽视抗混 = 22,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                反震几率 = 75,
                反震程度 = 75,
                风法反击 = 75,
            },
            技能 = {
                { 名称 = "失心狂乱", 熟练度 = 25000 },
                { 名称 = "借刀杀人", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 780,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(2, 生成战斗怪物(怪物属性))
        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 39954 + 转生 * 1200 + 等级 * 100,
            速度 = 1750,
            抗性 = {
                物理吸收 = 10,
                抗震慑 = 60,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20
            },
            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 25000 },
                { 名称 = "含情脉脉", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
        }
        self:加入敌方(3, 生成战斗怪物(怪物属性))


        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 39954 + 转生 * 1200 + 等级 * 100,
            速度 = 1960,
            抗性 = {
                物理吸收 = 45,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 60,
                抗火 = 60,
                抗水 = -20,
                抗雷 = -20
            },
            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 25000 },
                { 名称 = "乾坤借速", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
        }
        self:加入敌方(4, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 19954 + 转生 * 1200 + 等级 * 100,
            速度 = 1280,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 41,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强雷 = 200,
                忽视抗雷 = 100,
                抗风 = -60,
                抗火 = -60,
                抗水 = 100,
                抗雷 = 100,
                雷法反击 = 75,
            },
            技能 = {
                { 名称 = "天诛地灭", 熟练度 = 25000 },
                { 名称 = "天诛地灭", 熟练度 = 25000 },
                { 名称 = "天诛地灭", 熟练度 = 25000 },
                { 名称 = "电闪雷鸣", 熟练度 = 25000 }
            },
            施法几率 = 100,
            是否消失 = false,

        }
        self:加入敌方(5, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 320,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(6, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 320,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(7, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 320,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(8, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 320,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(9, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 320,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(10, 生成战斗怪物(怪物属性))
    elseif i == '2' then
        怪物属性 = {
            名称 = "离火护法",
            外形 = 6504,
            等级 = 等级,
            气血 = 4552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 19954 + 转生 * 1200 + 等级 * 100,
            速度 = 1520,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 41,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强火 = 200,
                忽视抗火 = 100,
                抗风 = -60,
                抗火 = 100,
                抗水 = -60,
                抗雷 = 60,
                火法反击 = 75,
            },
            技能 = {
                { 名称 = "九阴纯火", 熟练度 = 25000 },
                { 名称 = "九阴纯火", 熟练度 = 25000 },
                { 名称 = "九阴纯火", 熟练度 = 25000 },
                { 名称 = "烈火骄阳", 熟练度 = 25000 }
            },
            施法几率 = 100,
            是否消失 = false,
        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 19954 + 转生 * 1200 + 等级 * 100,
            速度 = 1680,
            抗性 = {
                物理吸收 = 52,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强封印 = 50,
                加强混乱 = 30,
                加强昏睡 = 30,
                忽视抗封 = 30,
                忽视抗睡 = 22,
                忽视抗混 = 22,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                反震几率 = 75,
                反震程度 = 75,
                风法反击 = 75,
            },

            技能 = {
                { 名称 = "失心狂乱", 熟练度 = 25000 },
                { 名称 = "借刀杀人", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
        }
        self:加入敌方(2, 生成战斗怪物(怪物属性))
        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 19954 + 转生 * 1200 + 等级 * 100,
            速度 = 950,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 41,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强封印 = 30,
                加强混乱 = 30,
                加强昏睡 = 30,
                忽视抗封 = 22,
                忽视抗睡 = 22,
                加强毒 = 75,
                加强毒伤害 = 72158,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                反震几率 = 75,
                反震程度 = 75,
                雷法反击 = 75,
            },
            技能 = {
                { 名称 = "万毒攻心", 熟练度 = 25000 },
                { 名称 = "四面楚歌", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,

        }
        self:加入敌方(3, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 39954 + 转生 * 1200 + 等级 * 100,
            速度 = 1980,
            抗性 = {
                物理吸收 = 45,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 60,
                抗火 = 60,
                抗水 = -20,
                抗雷 = -20
            },
            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 25000 },
                { 名称 = "乾坤借速", 熟练度 = 25000 },
            },
            施法几率 = 80,
            是否消失 = false,
        }
        self:加入敌方(4, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 39954 + 转生 * 1200 + 等级 * 100,
            速度 = 1620,
            抗性 = {
                物理吸收 = 10,
                抗震慑 = 60,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20
            },
            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 25000 },
                { 名称 = "含情脉脉", 熟练度 = 25000 },
            },
            施法几率 = 80,
            是否消失 = false,
        }
        self:加入敌方(5, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 580,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(6, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 580,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(7, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 580,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(8, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 580,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(9, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 580,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(10, 生成战斗怪物(怪物属性))
    elseif i == '3' then
        怪物属性 = {
            名称 = "赤金护法",
            外形 = 6504,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 1258,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 19954 + 转生 * 1200 + 等级 * 100,
            速度 = 1560,
            抗性 = {
                物理吸收 = 52,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强封印 = 50,
                加强混乱 = 30,
                加强昏睡 = 30,
                忽视抗封 = 30,
                忽视抗睡 = 22,
                忽视抗混 = 22,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                反震几率 = 75,
                反震程度 = 75,
                风法反击 = 75,
            },
            技能 = {
                { 名称 = "失心狂乱", 熟练度 = 25000 },
                { 名称 = "借刀杀人", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
        }
        self:加入敌方(2, 生成战斗怪物(怪物属性))
        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 19954 + 转生 * 1200 + 等级 * 100,
            速度 = 1680,
            抗性 = {
                物理吸收 = 39,
                抗震慑 = 22,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强水 = 200,
                忽视抗水 = 100,
                抗风 = 60,
                抗火 = -60,
                抗水 = 100,
                抗雷 = -60,
                水法反击 = 75,
            },
            技能 = {
                { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "蛟龙出海", 熟练度 = 25000 }
            },
            施法几率 = 100,
            是否消失 = false,

        }
        self:加入敌方(3, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 19954 + 转生 * 1200 + 等级 * 100,
            速度 = 360,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 41,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强风 = 200,
                忽视抗风 = 100,
                抗风 = 100,
                抗火 = -60,
                抗水 = 100,
                抗雷 = -60,
                风法反击 = 75,
            },
            技能 = {
                { 名称 = "袖里乾坤", 熟练度 = 25000 },
                { 名称 = "袖里乾坤", 熟练度 = 25000 },
                { 名称 = "袖里乾坤", 熟练度 = 25000 },
                { 名称 = "风雷涌动", 熟练度 = 25000 }
            },
            施法几率 = 100,
            是否消失 = false,
        }
        self:加入敌方(4, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 39954 + 转生 * 1200 + 等级 * 100,
            速度 = 1920,
            抗性 = {
                物理吸收 = 10,
                抗震慑 = 60,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20
            },
            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 25000 },
                { 名称 = "含情脉脉", 熟练度 = 25000 },
            },
            施法几率 = 80,
            是否消失 = false,
        }
        self:加入敌方(5, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 580,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(6, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 580,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(7, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 580,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(8, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 580,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(9, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 580,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(10, 生成战斗怪物(怪物属性))
    elseif i == '4' then
        怪物属性 = {
            名称 = "玄水护法",
            外形 = 6504,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 19954 + 转生 * 1200 + 等级 * 100,
            速度 = 2154,
            抗性 = {
                物理吸收 = 39,
                抗震慑 = 22,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强水 = 200,
                忽视抗水 = 100,
                抗风 = 60,
                抗火 = -60,
                抗水 = 100,
                抗雷 = -60,
                水法反击 = 75,
            },
            技能 = {
                { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "蛟龙出海", 熟练度 = 25000 }
            },
            施法几率 = 100,
            是否消失 = false,

        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 19954 + 转生 * 1200 + 等级 * 100,
            速度 = 1580,
            抗性 = {
                物理吸收 = 52,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强封印 = 50,
                加强混乱 = 30,
                加强昏睡 = 30,
                忽视抗封 = 30,
                忽视抗睡 = 22,
                忽视抗混 = 22,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                反震几率 = 75,
                反震程度 = 75,
                风法反击 = 75,
            },
            技能 = {
                { 名称 = "失心狂乱", 熟练度 = 25000 },
                { 名称 = "借刀杀人", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
        }
        self:加入敌方(2, 生成战斗怪物(怪物属性))
        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 19954 + 转生 * 1200 + 等级 * 100,
            速度 = 1720,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 41,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强封印 = 30,
                加强混乱 = 30,
                加强昏睡 = 30,
                忽视抗封 = 22,
                忽视抗睡 = 22,
                加强毒 = 75,
                加强毒伤害 = 72158,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                反震几率 = 75,
                反震程度 = 75,
                雷法反击 = 75,
            },
            技能 = {
                { 名称 = "万毒攻心", 熟练度 = 25000 },
                { 名称 = "四面楚歌", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,

        }
        self:加入敌方(3, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 39954 + 转生 * 1200 + 等级 * 100,
            速度 = 1950,
            抗性 = {
                物理吸收 = 45,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 60,
                抗火 = 60,
                抗水 = -20,
                抗雷 = -20
            },
            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 25000 },
                { 名称 = "乾坤借速", 熟练度 = 25000 },
            },
            施法几率 = 80,
            是否消失 = false,
        }
        self:加入敌方(4, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 39954 + 转生 * 1200 + 等级 * 100,
            速度 = 1480,
            抗性 = {
                物理吸收 = 10,
                抗震慑 = 60,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20
            },
            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 25000 },
                { 名称 = "含情脉脉", 熟练度 = 25000 },
            },
            施法几率 = 80,
            是否消失 = false,
        }
        self:加入敌方(5, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 580,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(6, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 580,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(7, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 580,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(8, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 580,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(9, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 580,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(10, 生成战斗怪物(怪物属性))
    elseif i == '5' then
        怪物属性 = {
            名称 = "穷奇",
            外形 = 3863,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 3000,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 125,
                抗混乱 = 115,
                抗昏睡 = 110,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15,
                加强封印 = 50,
                加强混乱 = 50,
                加强昏睡 = 50,
                忽视抗封 = 30,
                忽视抗睡 = 30,
                忽视抗混 = 30,
                加强震慑 = 30,
                加强风 = 300,
                加强水 = 300,
                加强雷 = 300,
                加强火 = 300,
                忽视抗风 = 150,
                忽视抗水 = 150,
                忽视抗雷 = 150,
                忽视抗火 = 150
            },
            技能 = {
                { 名称 = "袖里乾坤", 熟练度 = 25000 },
                { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "天诛地灭", 熟练度 = 25000 },
                { 名称 = "九阴纯火", 熟练度 = 25000 },
                { 名称 = "失心狂乱", 熟练度 = 25000 },
                { 名称 = "阎罗追命", 熟练度 = 25000 },
                { 名称 = "四面楚歌", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "赤金护法",
            外形 = 6504,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 19954 + 转生 * 1200 + 等级 * 100,
            速度 = 2800,
            抗性 = {
                物理吸收 = 52,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强混乱 = 50,
                忽视抗混 = 30,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                反震几率 = 75,
                反震程度 = 75,
                风法反击 = 75,
            },
            技能 = {
                { 名称 = "失心狂乱", 熟练度 = 25000 },
                { 名称 = "借刀杀人", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,
        }
        self:加入敌方(4, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "玄水护法",
            外形 = 6504,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 39954 + 转生 * 1200 + 等级 * 100,
            速度 = 2800,
            抗性 = {
                物理吸收 = 10,
                抗震慑 = 60,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                加强震慑 = 15,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20
            },
            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 25000 },
                { 名称 = "含情脉脉", 熟练度 = 25000 },
            },
            施法几率 = 80,
            是否消失 = false,
        }
        self:加入敌方(5, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 19954 + 转生 * 1200 + 等级 * 100,
            速度 = 1780,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 41,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强封印 = 30,
                加强混乱 = 30,
                加强昏睡 = 30,
                忽视抗封 = 22,
                忽视抗睡 = 22,
                加强毒 = 75,
                加强毒伤害 = 72158,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                反震几率 = 75,
                反震程度 = 75,
                雷法反击 = 75,
            },
            技能 = {
                { 名称 = "万毒攻心", 熟练度 = 25000 },
                { 名称 = "四面楚歌", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,

        }
        self:加入敌方(6, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 54584 + 转生 * 1200 + 等级 * 100,
            速度 = 800,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 44,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 56,
                抗火 = 56,
                抗水 = 56,
                抗雷 = 56,
                忽视防御几率 = 75,
                忽视防御程度 = 75,
                命中率 = 80,
                狂暴几率 = 80,
                致命几率 = 80,
                被攻击时释放魔神附身 = 15
            },
            技能 = {
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "魔神附身", 熟练度 = 25000 },
                { 名称 = "兽王之力", 熟练度 = 25000 },
            },
            施法几率 = 5,
            是否消失 = false,
        }
        self:加入敌方(7, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 39954 + 转生 * 1200 + 等级 * 100,
            速度 = 2500,
            抗性 = {
                物理吸收 = 45,
                抗震慑 = 27,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                附加震慑攻击 = 50,
                连击率 = 75,
                连击次数 = 9,
                反击率 = 75,
                反击次数 = 3,
                抗风 = 60,
                抗火 = 60,
                抗水 = -20,
                抗雷 = -20
            },
            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 25000 },
                { 名称 = "乾坤借速", 熟练度 = 25000 },
            },
            施法几率 = 80,
            是否消失 = false,
        }
        self:加入敌方(8, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 19954 + 转生 * 1200 + 等级 * 100,
            速度 = 1580,
            抗性 = {
                物理吸收 = 69,
                抗震慑 = 41,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强风 = 200,
                加强雷 = 200,
                忽视抗风 = 100,
                忽视抗雷 = 100,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                风法反击 = 75,
                雷法反击 = 75,
            },
            技能 = {
                { 名称 = "袖里乾坤", 熟练度 = 25000 },
                { 名称 = "天诛地灭", 熟练度 = 25000 }
            },
            施法几率 = 100,
            是否消失 = false,
        }
        self:加入敌方(9, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "修罗小妖",
            外形 = 2004,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 19954 + 转生 * 1200 + 等级 * 100,
            速度 = -150,
            抗性 = {
                物理吸收 = 25,
                抗震慑 = 49,
                抗封印 = 120,
                抗混乱 = 110,
                抗昏睡 = 105,
                加强火 = 200,
                加强雷 = 200,
                忽视抗火 = 100,
                忽视抗雷 = 100,
                抗风 = -60,
                抗火 = -60,
                抗水 = 20,
                抗雷 = 20,
                雷法反击 = 75,
                火法反击 = 75
            },
            技能 = {
                { 名称 = "天诛地灭", 熟练度 = 25000 },
                { 名称 = "九阴纯火", 熟练度 = 25000 },
            },
            施法几率 = 100,
            是否消失 = false,

        }
        self:加入敌方(10, 生成战斗怪物(怪物属性))
    end
end

function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end

--===============================================
function 事件:完成(玩家, i)
    if 玩家.是否组队 then
        for _, v in 玩家:遍历队伍() do
            self:掉落包(v, i)
        end
    else
        self:掉落包(玩家, i)
    end
end

local _挑战 = {
    ['1'] = '神木护法',
    ['2'] = '离火护法',
    ['3'] = '赤金护法',
    ['4'] = '玄水护法',
    ['5'] = '穷奇',
}

local _广播 = {
    '#C【齐力擎天】#R%s#Y咬紧牙关，发出致命一击，神木护法难以支撑，扔出一个#G#m(%s)[%s]#m#n#Y夺路而逃。',
    '#C【齐力擎天】#R%s#Y咬紧牙关，发出致命一击，离火护法难以支撑，扔出一个#G#m(%s)[%s]#m#n#Y夺路而逃。',
    '#C【齐力擎天】#R%s#Y咬紧牙关，发出致命一击，赤金护法难以支撑，扔出一个#G#m(%s)[%s]#m#n#Y夺路而逃。',
    '#C【齐力擎天】#R%s#Y咬紧牙关，发出致命一击，玄水护法难以支撑，扔出一个#G#m(%s)[%s]#m#n#Y夺路而逃。',
    '#C【力战穷奇】#Y风云变色，人心鼓舞，天降珍奇#G#m(%s)[%s]#m#n#Y，落在力挫穷奇，名动三界的#R%s#Y囊中。',
}

function 事件:掉落包(玩家, i)
    if 玩家:取活动限制次数(_挑战[i]) >= 1 then
        return
    end
    玩家:增加活动限制次数(_挑战[i])

    local 经验 = 1342600

    if i == '5' then
        经验 = 2681300
    end

    玩家:添加任务经验(经验)
    玩家:添加法宝经验(500)

    local 掉落包 = 取掉落包('活动', '月光爱人')
    if 掉落包 then
        奖励掉落包物品(玩家, 掉落包[_挑战[i]], _广播[i])
    end
end

return 事件
