local 事件 = {
    名称 = '五灵同贺',
    类型 = '活动',
    是否打开 = true,
    是否可接任务 = true,
}

function 事件:事件初始化()
    -- 开启时间：周四早8点到晚10点
    if os.date('%w', os.time()) == '6' then
        print('星期六，开启五灵同贺活动')
        local year = tonumber(os.date('%Y', os.time()))
        local month = tonumber(os.date('%m', os.time()))
        local day = tonumber(os.date('%d', os.time()))
        self.开始时间 = os.time { year = year, month = month, day = day, hour = 08, min = 00, sec = 00 }
        self.结束时间 = os.time { year = year, month = month, day = day, hour = 22, min = 00, sec = 00 }
        self.是否结束 = false
    end
end

local _主怪信息 = {
    { 名称 = '麒麟', 模型 = 2105, 地图 = 1173, X = 451, Y = 161, 方向 = 2 },
    { 名称 = '凤凰', 模型 = 2071, 地图 = 1174, X = 18, Y = 152, 方向 = 2 },
    { 名称 = '龟', 模型 = 2064, 地图 = 1119, X = 49, Y = 26, 方向 = 1 },
    { 名称 = '龙', 模型 = 2070, 地图 = 1174, X = 182, Y = 144, 方向 = 1 },
    { 名称 = '白虎', 模型 = 2038, 地图 = 1110, X = 298, Y = 71, 方向 = 2 },
    { 名称 = '五灵', 模型 = 2070, 地图 = 1111, X = 116, Y = 64, 方向 = 2 },
}

function 事件:清除所有怪物()
    for i = 1, #_主怪信息 do
        local map = self:取地图(_主怪信息[i].地图)
        for k, v in map:遍历NPC() do
            if v.名称 == _主怪信息[i].名称 and v.称谓 == '五灵同贺' then
                v:删除()
            end
        end
    end
end

function 事件:更新()
    self:清除所有怪物()
    for k, v in pairs(_主怪信息) do
        local map = self:取地图(v.地图)
        local NPC = map:添加NPC {
            名称 = v.名称,
            外形 = v.模型,
            称谓 = '五灵同贺',
            方向 = v.方向,
            脚本 = 'scripts/event/活动6_福泽天下_五灵同贺.lua',
            X = v.X,
            Y = v.Y,
            来源 = self
        }
    end
    self:发送系统('#G麟凤五灵，王者之嘉瑞也。五灵，分别为：麒麟、凤凰、龟、龙、白虎。为贺盛世华诞，天庭特派五灵下凡，驻守人间不同角落等待英雄的挑战。')
end

function 事件:事件开始()
    self:更新()
    print('五灵同贺活动开始')
end

function 事件:事件结束()
    self.是否结束 = true
    self:清除所有怪物()
    print('五灵同贺活动结束')
end

--=======================================================
local 对话 = [[天上人间共贺国庆，五湖四海齐唱赞歌。我耐王者嘉瑞也。坐拥宝物无数。值此盛典时节，若能通过我的考验，宝物拱手奉上，准备好了么#55？
menu
1|让我们切磋切磋
2|路过路过
]]

function 事件:NPC对话(玩家, NPC)
    return 对话
end

function 事件:NPC菜单(玩家, i, NPC)
    if NPC and NPC:是否战斗中() then
        return "我正在战斗中"
    end
    if i == '1' then
        if not 玩家.是否队长 then
            return "3人或者3人以上挑战"
        end
        if 玩家:取队伍人数() < 3 then
            return "3人或者3人以上挑战"
        end

        local t = {}
        for _, v in 玩家:遍历队伍() do
            if v:判断等级是否低于(90) then
                table.insert(t, v.名称)
            end
        end

        if #t > 0 then
            return table.concat(t, '、 ') .. '#W低于90级,无法挑战该任务!'
        end

        for _, v in 玩家:遍历队伍() do
            if v:取活动限制次数("天降祥瑞") < 12 then
                table.insert(t, v.名称)
            end
        end

        if #t > 0 then
            return table.concat(t, '、 ') .. '挑战12次天降祥瑞任务胜利后，可以组队继续迎接五灵的挑战。'
        end

        if self.名称 == "五灵" then
            for _, v in 玩家:遍历队伍() do
                if v:取活动限制次数("麒麟") < 1 or v:取活动限制次数("凤凰") < 1 or v:取活动限制次数("龙")
                    < 1 or v:取活动限制次数("龟") < 1 or v:取活动限制次数("白虎") < 1 then
                    table.insert(t, v.名称)
                end
            end
            if #t > 0 then
                return table.concat(t, '、 ') .. '当凡间五灵，也就是麒麟、凤凰、龟、龙、白虎挑战全部胜利后，可以来天宫迎接五灵共鸣的挑战。'
            end
        end

        if i == '1' then
            local r = 玩家:进入战斗('scripts/event/活动6_福泽天下_五灵同贺.lua', NPC)
            if r then
                self:完成(玩家, NPC)
            end
        end
    end
end

function 事件:战斗初始化(玩家, NPC)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    if NPC.名称 == "麒麟" then
        怪物属性 = {
            名称 = "麒麟",
            外形 = NPC.外形,
            等级 = 等级,
            气血 = 1782541,
            魔法 = 80000,
            攻击 = 10541,
            速度 = 735,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强封印 = 15,
                加强昏睡 = 15,
                加强毒 = 5,
                加强毒伤害 = 500,
                忽视抗封 = 15,
                忽视抗睡 = 15,
                忽视抗毒 = 10,
            },

            技能 = {
                { 名称 = "断肠烈散", 熟练度 = 5000 + 转生 * 5000 },
                { 名称 = "鹤顶红粉", 熟练度 = 5000 + 转生 * 5000 },
                { 名称 = "万毒攻心", 熟练度 = 5000 + 转生 * 5000 },
                { 名称 = "作壁上观", 熟练度 = 5000 + 转生 * 5000 },

            },
            施法几率 = 60,
            是否消失 = false,

        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "甘露降",
            外形 = 2128,
            等级 = 等级,
            气血 = 1678425,
            魔法 = 80000,
            攻击 = 36845,
            速度 = 1398,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 50,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "含情脉脉", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "魔音摄心", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "销魂蚀骨", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 60,
            是否消失 = false,

        }
        self:加入敌方(2, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "日月光",
            外形 = 2130,
            等级 = 等级,
            气血 = 1329444,
            魔法 = 80000,
            伤害 = 28954,
            速度 = 1088,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 50,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "乾坤借速", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "魔音摄心", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 10000 },
            },
            施法几率 = 60,
            是否消失 = false,

        }
        self:加入敌方(3, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "钟律调",
            外形 = 2129,
            等级 = 等级,
            气血 = 1297454,
            魔法 = 80000,
            伤害 = 14584,
            速度 = 995,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "太乙生风", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "风雷涌动", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "袖里乾坤", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(4, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "孝道至",
            外形 = 47,
            等级 = 等级,
            气血 = 1648951,
            魔法 = 80000,
            伤害 = 1184,
            速度 = -120,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "三味真火", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "烈火骄阳", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "九阴纯火", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(5, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "越裳来",
            外形 = 3121,
            等级 = 等级,
            气血 = 1189545,
            魔法 = 80000,
            伤害 = 5894,
            速度 = 785,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "三味真火", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "烈火骄阳", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "九阴纯火", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(6, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "四夷化",
            外形 = 46,
            等级 = 等级,
            气血 = 1524785,
            魔法 = 81111,
            伤害 = 4100,
            速度 = 1012,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强封印 = 5,
                加强混乱 = 15,
                加强昏睡 = 15,
                忽视抗封 = 5,
                忽视抗睡 = 5,
                忽视抗混 = 5,
            },

            技能 = {
                { 名称 = "借刀杀人", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "失心狂乱", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "百日眠", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(7, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "瑞霞",
            外形 = 2150,
            等级 = 等级,
            气血 = 1554214,
            魔法 = 80000,
            伤害 = 65401,
            速度 = 236,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 60,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "断肠烈散", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "鹤顶红粉", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "万毒攻心", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "迷魂醉", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(8, 生成战斗怪物(怪物属性))
    elseif NPC.名称 == "凤凰" then
        怪物属性 = {
            名称 = "凤凰",
            外形 = 2071,
            等级 = 等级,
            气血 = 1782541,
            魔法 = 80000,
            攻击 = 10541,
            速度 = 1580,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 130,
                抗封印 = 130,
                抗昏睡 = 135,
                抗遗忘 = 60,
                加强火 = 50,
                忽视抗火 = 40,
                火系狂暴几率 = 20,
            },

            技能 = {
                { 名称 = "三味真火", 熟练度 = 10000 + 转生 * 5000 },
                { 名称 = "烈火骄阳", 熟练度 = 10000 + 转生 * 5000 },
                { 名称 = "九阴纯火", 熟练度 = 10000 + 转生 * 5000 },
            },
            施法几率 = 70,
            是否消失 = false,

        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "钟律调",
            外形 = 2129,
            等级 = 等级,
            气血 = 1554214,
            魔法 = 80000,
            伤害 = 65401,
            速度 = 1730,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 60,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 5000 },
                { 名称 = "魔神附身", 熟练度 = 10000 + 转生 * 5000 },
                { 名称 = "魔神附身", 熟练度 = 10000 + 转生 * 5000 },
                { 名称 = "兽王神力", 熟练度 = 10000 + 转生 * 5000 },

            },
            施法几率 = 10,
            是否消失 = false,

        }
        self:加入敌方(2, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "甘露降",
            外形 = 2128,
            等级 = 等级,
            气血 = 1678425,
            魔法 = 80000,
            攻击 = 36845,
            速度 = 1398,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 50,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "含情脉脉", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "魔音摄心", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "销魂蚀骨", 熟练度 = 10000 + 转生 * 10000 },
            },
            施法几率 = 10,
            是否消失 = false,

        }
        self:加入敌方(3, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "越裳来",
            外形 = 3121,
            等级 = 等级,
            气血 = 1554214,
            魔法 = 80000,
            伤害 = 65401,
            速度 = 236,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 60,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "鹤顶红粉", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "万毒攻心", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "迷魂醉", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "百日眠", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 70,
            是否消失 = false,

        }
        self:加入敌方(4, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "瑞云",
            外形 = 2150,
            等级 = 等级,
            气血 = 1678425,
            魔法 = 80000,
            攻击 = 36845,
            速度 = 1398,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 50,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "销魂蚀骨", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "魔神护体", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "含情脉脉", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 10,
            是否消失 = false,

        }
        self:加入敌方(5, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "四夷化",
            外形 = 46,
            等级 = 等级,
            气血 = 1678425,
            魔法 = 80000,
            攻击 = 36845,
            速度 = 1398,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 50,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "销魂蚀骨", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "兽王神力", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "魔神附身", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(6, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "孝道至",
            外形 = 47,
            等级 = 等级,
            气血 = 1648951,
            魔法 = 80000,
            伤害 = 1184,
            速度 = -120,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "三味真火", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "烈火骄阳", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "九阴纯火", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 90,
            是否消失 = false,

        }
        self:加入敌方(7, 生成战斗怪物(怪物属性))



        怪物属性 = {
            名称 = "日月光",
            外形 = 2130,
            等级 = 等级,
            气血 = 1329444,
            魔法 = 80000,
            伤害 = 28954,
            速度 = 1088,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 50,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "乾坤借速", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "魔音摄心", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 10000 },
            },
            施法几率 = 60,
            是否消失 = false,

        }
        self:加入敌方(8, 生成战斗怪物(怪物属性))


        怪物属性 = {
            名称 = "瑞霞",
            外形 = 2150,
            等级 = 等级,
            气血 = 1554214,
            魔法 = 80000,
            伤害 = 65401,
            速度 = 236,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 60,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "断肠烈散", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "鹤顶红粉", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "万毒攻心", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "迷魂醉", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(9, 生成战斗怪物(怪物属性))
    elseif NPC.名称 == "龟" then
        怪物属性 = {
            名称 = "龟",
            外形 = 2064,
            等级 = 等级,
            气血 = 1782541,
            魔法 = 80000,
            攻击 = 10541,
            速度 = 1580,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强封印 = 5,
                加强混乱 = 15,
                加强昏睡 = 15,
                忽视抗封 = 5,
                忽视抗睡 = 5,
                忽视抗混 = 5,
            },

            技能 = {
                { 名称 = "借刀杀人", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "失心狂乱", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "百日眠", 熟练度 = 10000 + 转生 * 10000 },
            },
            施法几率 = 80,
            是否消失 = false,

        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "四夷化",
            外形 = 46,
            等级 = 等级,
            气血 = 1678425,
            魔法 = 80000,
            伤害 = 65401,
            速度 = 1730,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 50,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "销魂蚀骨", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "兽王神力", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "魔神附身", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 10,
            是否消失 = false,

        }
        self:加入敌方(2, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "四夷化",
            外形 = 46,
            等级 = 等级,
            气血 = 1678425,
            魔法 = 80000,
            伤害 = 65401,
            速度 = 1398,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 50,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "销魂蚀骨", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "兽王神力", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "魔神附身", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 10,
            是否消失 = false,

        }
        self:加入敌方(3, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "四夷化",
            外形 = 46,
            等级 = 等级,
            气血 = 1678425,
            魔法 = 80000,
            伤害 = 65401,
            速度 = 1398,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 50,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "销魂蚀骨", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "兽王神力", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "魔神附身", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 10,
            是否消失 = false,

        }
        self:加入敌方(4, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "四夷化",
            外形 = 46,
            等级 = 等级,
            气血 = 1189545,
            魔法 = 80000,
            伤害 = 5894,
            速度 = 785,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "三味真火", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "烈火骄阳", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "九阴纯火", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(5, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "孝道至",
            外形 = 47,
            等级 = 等级,
            气血 = 1648951,
            魔法 = 80000,
            伤害 = 1184,
            速度 = -120,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "三味真火", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "烈火骄阳", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "九阴纯火", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(6, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "孝道至",
            外形 = 47,
            等级 = 等级,
            气血 = 1297454,
            魔法 = 80000,
            伤害 = 14584,
            速度 = 995,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "太乙生风", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "风雷涌动", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "袖里乾坤", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(7, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "孝道至",
            外形 = 47,
            等级 = 等级,
            气血 = 1678425,
            魔法 = 80000,
            攻击 = 36845,
            速度 = 1398,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 50,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "含情脉脉", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "魔音摄心", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "销魂蚀骨", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 10,
            是否消失 = false,

        }
        self:加入敌方(8, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "孝道至",
            外形 = 47,
            等级 = 等级,
            气血 = 1297454,
            魔法 = 80000,
            伤害 = 14584,
            速度 = 995,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "袖里乾坤", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "天诛地灭", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "九龙冰封", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 80,
            是否消失 = false,

        }
        self:加入敌方(9, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "孝道至",
            外形 = 47,
            等级 = 等级,
            气血 = 1678425,
            魔法 = 80000,
            攻击 = 36845,
            速度 = 1010,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 50,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "含情脉脉", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "魔音摄心", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "销魂蚀骨", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 10,
            是否消失 = false,

        }
        self:加入敌方(10, 生成战斗怪物(怪物属性))
    elseif NPC.名称 == "白虎" then
        怪物属性 = {
            名称 = "白虎",
            外形 = 2038,
            等级 = 等级,
            气血 = 1782541,
            魔法 = 80000,
            攻击 = 10541,
            速度 = 1580,
            抗性 = {
                物理吸收 = 85,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强封印 = 5,
                加强混乱 = 15,
                加强昏睡 = 15,
                忽视抗封 = 5,
                忽视抗睡 = 5,
                忽视抗混 = 5,
            },

            技能 = {
                { 名称 = "借刀杀人", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "失心狂乱", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "百日眠", 熟练度 = 10000 + 转生 * 10000 },
            },
            施法几率 = 80,
            是否消失 = false,

        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))


        怪物属性 = {
            名称 = "甘露降",
            外形 = 2128,
            等级 = 等级,
            气血 = 1554214,
            魔法 = 80000,
            伤害 = 65401,
            速度 = 236,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 60,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "断肠烈散", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "鹤顶红粉", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "万毒攻心", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "迷魂醉", 熟练度 = 10000 + 转生 * 10000 },
            },
            施法几率 = 90,
            是否消失 = false,

        }
        self:加入敌方(2, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "日月光",
            外形 = 2130,
            等级 = 等级,
            气血 = 1329444,
            魔法 = 80000,
            伤害 = 28954,
            速度 = 1088,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 50,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "乾坤借速", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "魔音摄心", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 10000 },
            },
            施法几率 = 60,
            是否消失 = false,

        }
        self:加入敌方(3, 生成战斗怪物(怪物属性))


        怪物属性 = {
            名称 = "钟律调",
            外形 = 2129,
            等级 = 等级,
            气血 = 1297454,
            魔法 = 80000,
            伤害 = 14584,
            速度 = 995,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "太乙生风", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "风雷涌动", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "袖里乾坤", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(4, 生成战斗怪物(怪物属性))


        怪物属性 = {
            名称 = "孝道至",
            外形 = 47,
            等级 = 等级,
            气血 = 1648951,
            魔法 = 80000,
            伤害 = 1184,
            速度 = -120,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "三味真火", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "烈火骄阳", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "九阴纯火", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 90,
            是否消失 = false,

        }
        self:加入敌方(5, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "越裳来",
            外形 = 3121,
            等级 = 等级,
            气血 = 1189545,
            魔法 = 80000,
            伤害 = 5894,
            速度 = 785,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "三味真火", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "烈火骄阳", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "九阴纯火", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(6, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "四夷化",
            外形 = 46,
            等级 = 等级,
            气血 = 1524785,
            魔法 = 81111,
            伤害 = 4100,
            速度 = 1012,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强封印 = 5,
                加强混乱 = 15,
                加强昏睡 = 15,
                忽视抗封 = 5,
                忽视抗睡 = 5,
                忽视抗混 = 5,
            },

            技能 = {
                { 名称 = "借刀杀人", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "失心狂乱", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "百日眠", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(7, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "瑞霞",
            外形 = 2150,
            等级 = 等级,
            气血 = 1554214,
            魔法 = 80000,
            伤害 = 65401,
            速度 = 236,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 60,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "断肠烈散", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "鹤顶红粉", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "万毒攻心", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "迷魂醉", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(8, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "斗极明",
            外形 = 2126,
            等级 = 等级,
            气血 = 1297454,
            魔法 = 80000,
            伤害 = 14584,
            速度 = 995,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "袖里乾坤", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "天诛地灭", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "九龙冰封", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 80,
            是否消失 = false,

        }
        self:加入敌方(9, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "瑞云",
            外形 = 2150,
            等级 = 等级,
            气血 = 1678425,
            魔法 = 80000,
            攻击 = 36845,
            速度 = 1398,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 50,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "销魂蚀骨", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "魔神护体", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "含情脉脉", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 10,
            是否消失 = false,

        }
        self:加入敌方(10, 生成战斗怪物(怪物属性))
    elseif NPC.名称 == "龙" then
        怪物属性 = {
            名称 = "龙",
            外形 = 2070,
            等级 = 等级,
            气血 = 1782541,
            魔法 = 80000,
            攻击 = 10541,
            速度 = 1580,
            抗性 = {
                物理吸收 = 85,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强封印 = 5,
                加强混乱 = 15,
                加强昏睡 = 15,
                忽视抗封 = 5,
                忽视抗睡 = 5,
                忽视抗混 = 5,
            },

            技能 = {
                { 名称 = "借刀杀人", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "失心狂乱", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "百日眠", 熟练度 = 10000 + 转生 * 10000 },
            },
            施法几率 = 80,
            是否消失 = false,

        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))


        怪物属性 = {
            名称 = "甘露降",
            外形 = 2128,
            等级 = 等级,
            气血 = 1554214,
            魔法 = 80000,
            伤害 = 65401,
            速度 = 236,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 60,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "断肠烈散", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "鹤顶红粉", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "万毒攻心", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "迷魂醉", 熟练度 = 10000 + 转生 * 10000 },
            },
            施法几率 = 90,
            是否消失 = false,

        }
        self:加入敌方(2, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "日月光",
            外形 = 2130,
            等级 = 等级,
            气血 = 1329444,
            魔法 = 80000,
            伤害 = 28954,
            速度 = 1088,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 50,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "乾坤借速", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "魔音摄心", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 10000 },
            },
            施法几率 = 60,
            是否消失 = false,

        }
        self:加入敌方(3, 生成战斗怪物(怪物属性))


        怪物属性 = {
            名称 = "钟律调",
            外形 = 2129,
            等级 = 等级,
            气血 = 1297454,
            魔法 = 80000,
            伤害 = 14584,
            速度 = 995,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "太乙生风", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "风雷涌动", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "袖里乾坤", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(4, 生成战斗怪物(怪物属性))


        怪物属性 = {
            名称 = "孝道至",
            外形 = 47,
            等级 = 等级,
            气血 = 1648951,
            魔法 = 80000,
            伤害 = 1184,
            速度 = -120,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "三味真火", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "烈火骄阳", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "九阴纯火", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 90,
            是否消失 = false,

        }
        self:加入敌方(5, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "越裳来",
            外形 = 3121,
            等级 = 等级,
            气血 = 1189545,
            魔法 = 80000,
            伤害 = 5894,
            速度 = 785,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "三味真火", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "烈火骄阳", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "九阴纯火", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(6, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "四夷化",
            外形 = 46,
            等级 = 等级,
            气血 = 1524785,
            魔法 = 81111,
            伤害 = 4100,
            速度 = 1012,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强封印 = 5,
                加强混乱 = 15,
                加强昏睡 = 15,
                忽视抗封 = 5,
                忽视抗睡 = 5,
                忽视抗混 = 5,
            },

            技能 = {
                { 名称 = "借刀杀人", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "失心狂乱", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "百日眠", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(7, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "瑞霞",
            外形 = 2150,
            等级 = 等级,
            气血 = 1554214,
            魔法 = 80000,
            伤害 = 65401,
            速度 = 236,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 60,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "断肠烈散", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "鹤顶红粉", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "万毒攻心", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "迷魂醉", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(8, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "斗极明",
            外形 = 2126,
            等级 = 等级,
            气血 = 1297454,
            魔法 = 80000,
            伤害 = 14584,
            速度 = 995,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "袖里乾坤", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "天诛地灭", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "九龙冰封", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 80,
            是否消失 = false,

        }
        self:加入敌方(9, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "瑞云",
            外形 = 2150,
            等级 = 等级,
            气血 = 1678425,
            魔法 = 80000,
            攻击 = 36845,
            速度 = 1398,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 50,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "销魂蚀骨", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "魔神护体", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "含情脉脉", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 10,
            是否消失 = false,

        }
        self:加入敌方(10, 生成战斗怪物(怪物属性))
    elseif NPC.名称 == "五灵" then
        怪物属性 = {
            名称 = "龙",
            外形 = 2070,
            等级 = 等级,
            气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
            魔法 = 20000 + 等级 * 501,
            攻击 = 19954 + 转生 * 1200 + 等级 * 100,
            速度 = 1870,
            抗性 = {
                物理吸收 = 10,
                抗震慑 = 60,
                抗混乱 = 110,
                抗封印 = 85,
                抗昏睡 = 95,
                加强封印 = 30,
                加强混乱 = 30,
                加强昏睡 = 30,
                忽视抗封 = 22,
                忽视抗睡 = 22,
                忽视抗混 = 22,
            },

            技能 = {
                { 名称 = "失心狂乱", 熟练度 = 25000 },
                { 名称 = "百日眠", 熟练度 = 25000 },
            },
            施法几率 = 70,
            是否消失 = false,

        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "凤凰",
            外形 = 2071,
            等级 = 等级,
            气血 = 1782541,
            魔法 = 80000,
            攻击 = 10541,
            速度 = 1580,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 130,
                抗封印 = 130,
                抗昏睡 = 135,
                抗遗忘 = 60,
                加强火 = 50,
                忽视抗火 = 40,
                火系狂暴几率 = 20,
            },

            技能 = {
                { 名称 = "三味真火", 熟练度 = 10000 + 转生 * 5000 },
                { 名称 = "烈火骄阳", 熟练度 = 10000 + 转生 * 5000 },
                { 名称 = "九阴纯火", 熟练度 = 10000 + 转生 * 5000 },
            },
            施法几率 = 70,
            是否消失 = false,

        }
        self:加入敌方(2, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "龟",
            外形 = 2064,
            等级 = 等级,
            气血 = 1782541,
            魔法 = 80000,
            攻击 = 10541,
            速度 = 1580,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强封印 = 5,
                加强混乱 = 15,
                加强昏睡 = 15,
                忽视抗封 = 5,
                忽视抗睡 = 5,
                忽视抗混 = 5,
            },

            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 5000 },
                { 名称 = "魔神附身", 熟练度 = 10000 + 转生 * 5000 },
                { 名称 = "魔神附身", 熟练度 = 10000 + 转生 * 5000 },
                { 名称 = "兽王神力", 熟练度 = 10000 + 转生 * 5000 },
            },
            施法几率 = 80,
            是否消失 = false,

        }
        self:加入敌方(3, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "白虎",
            外形 = 2038,
            等级 = 等级,
            气血 = 1782541,
            魔法 = 80000,
            攻击 = 10541,
            速度 = 1580,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 60,
                忽视防御几率 = 100,
                忽视防御程度 = 100,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "魔神附身", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "含情脉脉", 熟练度 = 10000 + 转生 * 10000 },
            },
            施法几率 = 10,
            是否消失 = false,

        }
        self:加入敌方(4, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "麒麟",
            外形 = 2105,
            等级 = 等级,
            气血 = 1782541,
            魔法 = 80000,
            攻击 = 10541,
            速度 = 735,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强封印 = 15,
                加强昏睡 = 15,
                加强毒 = 5,
                加强毒伤害 = 500,
                忽视抗封 = 15,
                忽视抗睡 = 15,
                忽视抗毒 = 10,
            },

            技能 = {
                { 名称 = "断肠烈散", 熟练度 = 5000 + 转生 * 5000 },
                { 名称 = "鹤顶红粉", 熟练度 = 5000 + 转生 * 5000 },
                { 名称 = "万毒攻心", 熟练度 = 5000 + 转生 * 5000 },
                { 名称 = "作壁上观", 熟练度 = 5000 + 转生 * 5000 },

            },
            施法几率 = 60,
            是否消失 = false,

        }
        self:加入敌方(5, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "四夷化",
            外形 = 46,
            等级 = 等级,
            气血 = 1297454,
            魔法 = 80000,
            伤害 = 14584,
            速度 = 995,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "袖里乾坤", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "天诛地灭", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "九龙冰封", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 80,
            是否消失 = false,

        }
        self:加入敌方(6, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "孝道至",
            外形 = 47,
            等级 = 等级,
            气血 = 1297454,
            魔法 = 80000,
            伤害 = 14584,
            速度 = 995,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "袖里乾坤", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "天诛地灭", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "九龙冰封", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 80,
            是否消失 = false,

        }
        self:加入敌方(7, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "日月光",
            外形 = 2130,
            等级 = 等级,
            气血 = 1329444,
            魔法 = 80000,
            伤害 = 28954,
            速度 = 1088,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 50,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "乾坤借速", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "魔音摄心", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "阎罗追命", 熟练度 = 10000 + 转生 * 10000 },
            },
            施法几率 = 60,
            是否消失 = false,

        }
        self:加入敌方(8, 生成战斗怪物(怪物属性))

        怪物属性 = {
            名称 = "瑞霞",
            外形 = 2150,
            等级 = 等级,
            气血 = 1554214,
            魔法 = 80000,
            伤害 = 65401,
            速度 = 236,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                连击率 = 60,
                连击次数 = 5,
                反击率 = 50,
                反击次数 = 1,
            },

            技能 = {
                { 名称 = "断肠烈散", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "鹤顶红粉", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "万毒攻心", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "迷魂醉", 熟练度 = 10000 + 转生 * 10000 },

            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(9, 生成战斗怪物(怪物属性))


        怪物属性 = {
            名称 = "越裳来",
            外形 = 3121,
            等级 = 等级,
            气血 = 1189545,
            魔法 = 80000,
            伤害 = 5894,
            速度 = 785,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 120,
                抗封印 = 120,
                抗昏睡 = 120,
                抗遗忘 = 60,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
                忽视抗雷 = 20,
                忽视抗风 = 20,
                忽视抗火 = 20,
                忽视抗水 = 20,
            },

            技能 = {
                { 名称 = "三味真火", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "烈火骄阳", 熟练度 = 10000 + 转生 * 10000 },
                { 名称 = "九阴纯火", 熟练度 = 10000 + 转生 * 10000 },


            },
            施法几率 = 50,
            是否消失 = false,

        }
        self:加入敌方(10, 生成战斗怪物(怪物属性))
    end
end

function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end

function 事件:完成(玩家, NPC)
    for k, v in 玩家:遍历队伍() do
        self:掉落包(v, NPC)
    end
end

local _广播 = {
    [1] = "祥瑞小神潇洒的当着#R%s#C的面掏出了自己的#G#m(%s)[%s]#m#C，拍了怕身上的尘土，说道：“想要你就说嘛，说了我就给你嘛，别把我的新衣服弄脏了#47",
    [2] = "百卉含英百花开，#R%s#C好运连连来，得了个#G#m(%s)[%s]#m#86",
    [3] = "太白金星冲着#R%s#C喊道：“承平天下，五灵同贺，#G#m(%s)[%s]#m#C掉头上的感觉爽不爽#86",
}

function 事件:掉落包(玩家, NPC)
    if 玩家:取活动限制次数(NPC.名称) >= 1 then
        return
    end
    玩家:增加活动限制次数(NPC.名称)

    local 掉落包 = 取掉落包('活动', '五灵同贺')
    local 经验 = 864000

    if 掉落包 then
        if NPC.名称 == '五灵' then
            local 经验 = 1069300
        end

        玩家:添加任务经验(经验)
        玩家:添加法宝经验(500)
        奖励掉落包物品(玩家, 掉落包[NPC.名称], _广播[math.random(1, 3)])
    end
end

return 事件
