local 事件 = {
    名称 = '混沌小妖',
    是否打开 = true,
}

function 事件:事件初始化()
    -- 开启时间：周日早8点到晚10点
    if os.date('%w', os.time()) == '7' then
        print('星期天，开启混沌小妖活动')
        local year = tonumber(os.date('%Y', os.time()))
        local month = tonumber(os.date('%m', os.time()))
        local day = tonumber(os.date('%d', os.time()))
        self.开始时间 = os.time { year = year, month = month, day = day, hour = 08, min = 00, sec = 00 }
        self.结束时间 = os.time { year = year, month = month, day = day, hour = 22, min = 00, sec = 00 }
        self.是否结束 = false
    end
end

local _地图 = { 1174, 1091, 1201, 101537, 101538 }

function 事件:清除所有怪物()
    for ii, vv in ipairs(_地图) do
        local map = self:取地图(vv)
        for k, v in map:遍历NPC() do
            if v.名称 == '混沌小妖' then
                v:删除()
            end
        end
    end
end

function 事件:更新()
    if self.是否结束 then
        return
    end
    local 地图组 = {}
    self.时间 = os.time() + 30 * 60
    for ii, vv in ipairs(_地图) do
        local map = self:取地图(vv)
        table.insert(地图组, map.名称)
        for k, v in map:遍历NPC() do
            if v.名称 == '混沌小妖' then
                v:删除()
            end
        end

        for _ = 1, 30 do
            local 方向 = math.random(1, 4)
            local X, Y = map:取随机坐标()
            local NPC = map:添加NPC {
                名称 = '混沌小妖',
                外形 = 12004,
                称谓 = '月光爱人',
                方向 = 方向,
                脚本 = 'scripts/event/活动7_月光爱人_混沌小妖.lua',
                时间 = self.时间,
                X = X,
                Y = Y,
                来源 = self
            }
        end
    end
    self:发送系统('#R修罗之祸愈演愈烈，魑魅魍魉横行三界，常常神出鬼没，伏击路人。还需侠客义士出手相救，前往#G%s#R扶危济难。', table.concat(地图组, '、'))
    return 1800
end

function 事件:事件开始()
    self:更新()
    self:定时(1800, self.更新)
    print('混沌小妖活动开始')
end

function 事件:事件结束()
    self.是否结束 = true
    self:清除所有怪物()
    print('混沌小妖活动结束')
end

--=======================================================
local 对话 = [[没想到我躲在这里，也会被你们发现，休想抓我回去。#4
menu
1|妖孽，受死吧
2|我认错人了
]]
function 事件:NPC对话(玩家, i)
    return 对话
end

function 事件:NPC菜单(玩家, i)
    if i == '1' then
        local r = 玩家:进入战斗('scripts/event/活动7_月光爱人_混沌小妖.lua', self)
        if r then
            self:完成(玩家)
            self:删除()
        end
    end
end

--===============================================
function 事件:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 12004,
        名称 = "混沌小妖",
        等级 = 等级,
        气血 = 652154 + 转生 * 300000 + 等级 * 10000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 21954 + 转生 * 1200 + 等级 * 100,
        速度 = 300 + 等级 * 3,
        抗性 = {
            物理吸收 = 20,
            抗水 = 47,
            抗雷 = 47,
            抗火 = 47,
            抗风 = 47,
            抗震慑 = 39,
            抗混乱 = 65,
            抗封印 = 85,
            抗昏睡 = 72
        },
        技能 = {
            { 名称 = "阎罗追命", 熟练度 = 25000 },
            { 名称 = "魔音摄心", 熟练度 = 25000 },
            { 名称 = "阎罗追命", 熟练度 = 25000 }
        },
        施法几率 = 50,
        是否消失 = false,

    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 12004,
        名称 = "混沌小妖",
        等级 = 等级,
        气血 = 552154 + 转生 * 300000 + 等级 * 10000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 554 + 转生 * 1200 + 等级 * 100,
        速度 = 80 + 等级 * 1,
        抗性 = {
            抗震慑 = 19,
            抗水 = -180,
            抗雷 = -30,
            抗火 = -30,
            抗风 = -180,
            抗混乱 = 52,
            抗封印 = 66,
            抗中毒 = 30,
            抗昏睡 = 65
        },
        技能 = {
            { 名称 = "雷神怒击", 熟练度 = 15000 },
            { 名称 = "电闪雷鸣", 熟练度 = 15000 },
        },
        施法几率 = 20,
        是否消失 = false,
    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 12004,
        名称 = "混沌小妖",
        等级 = 等级,
        气血 = 552154 + 转生 * 300000 + 等级 * 10000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 1954 + 转生 * 1200 + 等级 * 100,
        速度 = 170 + 等级 * 2,
        抗性 = {
            抗水 = -39.7,
            抗雷 = -139.7,
            抗火 = -139.7,
            抗风 = 139,
            抗震慑 = 31,
            抗混乱 = 52,
            抗封印 = 66,
            抗中毒 = 30,
            抗昏睡 = 65
        },

        技能 = {
            { 名称 = "谗言相加", 熟练度 = 15000 },
            { 名称 = "借刀杀人", 熟练度 = 15000 },

        },
        施法几率 = 20,
        是否消失 = false,

    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 12004,
        名称 = "混沌小妖",
        等级 = 等级,
        气血 = 552154 + 转生 * 300000 + 等级 * 10000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 1954 + 转生 * 1200 + 等级 * 100,
        速度 = 250 + 等级 * 2,
        抗性 = {
            抗水 = -139.7,
            抗雷 = -139.7,
            抗火 = -139.7,
            抗风 = 30,
            抗震慑 = 31,
            抗混乱 = 52,
            抗封印 = 66,
            抗中毒 = 30,
            抗昏睡 = 65
        },

        技能 = {
            { 名称 = "离魂咒", 熟练度 = 15000 },
            { 名称 = "迷魂醉", 熟练度 = 15000 },

        },
        施法几率 = 20,
        是否消失 = false,

    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 12004,
        名称 = "混沌小妖",
        等级 = 等级,
        气血 = 552154 + 转生 * 300000 + 等级 * 10000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 1954 + 转生 * 1200 + 等级 * 100,
        速度 = 30,
        抗性 = {
            抗震慑 = 19,
            抗水 = -30,
            抗雷 = -30,
            抗火 = -30,
            抗风 = -30,
            抗毒伤害 = -1000,
            抗混乱 = 52,
            抗封印 = 66,
            抗中毒 = 30,
            抗昏睡 = 65,
            狂暴几率 = 100,
            命中率 = 100,
            忽视防御程度 = 60,
            忽视防御几率 = 60
        },
        技能 = {
            { 名称 = "魔音摄心", 熟练度 = 15000 },
            { 名称 = "兽王之力", 熟练度 = 15000 },
        },
        施法几率 = 20,
        是否消失 = false,
    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 12004,
        名称 = "混沌小妖",
        等级 = 等级,
        气血 = 552154 + 转生 * 300000 + 等级 * 10000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 554 + 转生 * 1200 + 等级 * 100,
        速度 = 140 + 等级 * 2,
        抗性 = {
            抗震慑 = 19,
            抗水 = -180,
            抗雷 = -12,
            抗火 = -180,
            抗风 = -180,
            抗混乱 = 52,
            抗封印 = 66,
            抗中毒 = 30,
            抗昏睡 = 65
        },
        技能 = {
            { 名称 = "魔音摄心", 熟练度 = 15000 },
            { 名称 = "楚楚可怜", 熟练度 = 15000 },
        },
        施法几率 = 20,
        是否消失 = false,
    }
    self:加入敌方(6, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 12004,
        名称 = "混沌小妖",
        等级 = 等级,
        气血 = 552154 + 转生 * 300000 + 等级 * 10000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 1954 + 转生 * 1200 + 等级 * 100,
        速度 = 28 + 等级 * 1,
        抗性 = {
            抗震慑 = 19,
            抗水 = -180,
            抗雷 = -30,
            抗火 = -180,
            抗风 = -180,
            抗鬼火 = -180,
            抗毒伤害 = -1000,
            抗混乱 = 30,
            抗封印 = 30,
            抗中毒 = 30,
            抗昏睡 = 30
        },
        技能 = {
            { 名称 = "谗言相加", 熟练度 = 6895 },
            { 名称 = "离魂咒", 熟练度 = 6895 },
        },
        施法几率 = 20,
        是否消失 = false,

    }
    self:加入敌方(7, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 12004,
        名称 = "混沌小妖",
        等级 = 等级,
        气血 = 552154 + 转生 * 300000 + 等级 * 10000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 554 + 转生 * 1200 + 等级 * 100,
        速度 = 194 + 等级 * 3,
        抗性 = {
            抗震慑 = 19,
            抗水 = -180,
            抗雷 = -180,
            抗火 = -180,
            抗风 = -20,
            抗混乱 = 52,
            抗封印 = 66,
            抗中毒 = 30,
            抗昏睡 = 65
        },
        技能 = {
            { 名称 = "魔音摄心", 熟练度 = 15000 },
            { 名称 = "狮王之怒", 熟练度 = 15000 },
        },
        施法几率 = 20,
        是否消失 = false,
    }
    self:加入敌方(8, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 12004,
        名称 = "混沌小妖",
        等级 = 等级,
        气血 = 552154 + 转生 * 300000 + 等级 * 10000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 554 + 转生 * 1200 + 等级 * 100,
        速度 = 194 + 等级 * 3,
        抗性 = {
            抗震慑 = 19,
            抗水 = -180,
            抗雷 = -180,
            抗火 = -180,
            抗风 = -20,
            抗混乱 = 52,
            抗封印 = 66,
            抗中毒 = 30,
            抗昏睡 = 65
        },
        技能 = {
            { 名称 = "魔音摄心", 熟练度 = 15000 },
            { 名称 = "狮王之怒", 熟练度 = 15000 },
        },
        施法几率 = 20,
        是否消失 = false,
    }
    self:加入敌方(9, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 12004,
        名称 = "混沌小妖",
        等级 = 等级,
        气血 = 552154 + 转生 * 300000 + 等级 * 10000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 554 + 转生 * 1200 + 等级 * 100,
        速度 = 194 + 等级 * 3,
        抗性 = {
            抗震慑 = 19,
            抗水 = -180,
            抗雷 = -180,
            抗火 = -180,
            抗风 = -20,
            抗混乱 = 52,
            抗封印 = 66,
            抗中毒 = 30,
            抗昏睡 = 65
        },
        技能 = {
            { 名称 = "魔音摄心", 熟练度 = 15000 },
            { 名称 = "狮王之怒", 熟练度 = 15000 },
        },
        施法几率 = 20,
        是否消失 = false,
    }
    self:加入敌方(10, 生成战斗怪物(怪物属性))
end

function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end

--===============================================
function 事件:完成(玩家)
    if 玩家.是否组队 then
        for _, v in 玩家:遍历队伍() do
            self:掉落包(v)
        end
    else
        self:掉落包(玩家)
    end
end

local _广播 = '#C【扶危济难】#R%s#C击溃混沌小妖之后，见地上有个#G#m(%s)[%s]#m#n#C就顺手装在了自己的背.背..背包里#24'

function 事件:掉落包(玩家)
    if 玩家:取活动限制次数('混沌小妖') >= 60 then
        return
    end
    玩家:增加活动限制次数('混沌小妖')

    local 经验 = 463600
    玩家:添加任务经验(经验)
    玩家:添加法宝经验(500)

    local 掉落包 = 取掉落包('活动', '月光爱人')
    if 掉落包 then
        奖励掉落包物品(玩家, 掉落包['混沌小妖'], _广播)
    end
end


return 事件
