local 事件 = {
    名称 = '花灯报吉_天官',
    是否打开 = true,
}

function 事件:事件初始化()
    -- 开启时间：周日早8点到晚10点
    if os.date('%w', os.time()) == '7' then
        print('星期天，开启花灯报吉活动')
        local year = tonumber(os.date('%Y', os.time()))
        local month = tonumber(os.date('%m', os.time()))
        local day = tonumber(os.date('%d', os.time()))
        self.开始时间 = os.time { year = year, month = month, day = day, hour = 08, min = 00, sec = 00 }
        self.结束时间 = os.time { year = year, month = month, day = day, hour = 22, min = 00, sec = 00 }
        self.是否结束 = false
    end
end

local _地图 = { 1193, 1208 }

function 事件:清除所有怪物()
    for ii, vv in ipairs(_地图) do
        local map = self:取地图(vv)
        for k, v in map:遍历NPC() do
            if v.名称 == '赐福天官' then
                v:删除()
            end
        end
    end
end

function 事件:更新()
    if self.是否结束 then
        return
    end
    self.时间 = os.time() + 60 * 60
    self:清除所有怪物()
    local map = self:取地图(_地图[math.random(1, 2)])
    local 方向 = math.random(1, 4)
    local X, Y = map:取随机坐标()
    local NPC = map:添加NPC {
        名称 = '赐福天官',
        称谓 = '花灯报吉',
        外形 = 2126,
        方向 = 方向,
        脚本 = 'scripts/event/活动7_花灯报吉_天官.lua',
        时间 = self.时间,
        X = X,
        Y = Y,
        来源 = self
    }
    print(string.format('赐福天官坐标 地图：%s X：%s Y:%s', map.名称, X, Y))
    self:发送系统('#G玉帝见诸位不辞劳苦，特派天官下凡来#W东海渔村、长安城东#G犒劳各位，只要能找到天官并通过考验就能成功得到丰厚奖励哦#97')
    return 3600
end

function 事件:事件开始()
    self:更新()
    self:定时(3600, self.更新)
    print('花灯报吉_天官活动开始')
end

function 事件:事件结束()
    self:清除所有怪物()
    print('花灯报吉_天官活动结束')
end

--=======================================================
local 对话 = [[没想到我躲在这里，也会被你们发现，休想抓我回去。#4
menu
1|妖孽，受死吧
2|我认错人了
]]
function 事件:NPC对话(玩家, i)
    return 对话
end

function 事件:NPC菜单(玩家, i)
    if i == '1' then
        local r = 玩家:进入战斗('scripts/event/活动7_花灯报吉_天官.lua', self)
        if r then
            self:完成(玩家)
        end
    end
end

--===============================================

function 事件:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性

    怪物属性 = {
        名称 = "天官",
        外形 = 2126,
        等级 = 等级,
        气血 = 2552154 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = 1870,
        抗性 = {
            物理吸收 = 10,
            抗震慑 = 60,
            抗混乱 = 110,
            抗封印 = 85,
            抗昏睡 = 95,
            加强封印 = 30,
            加强混乱 = 30,
            加强昏睡 = 30,
            忽视抗封 = 22,
            忽视抗睡 = 22,
            忽视抗混 = 22,
        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 25000 },
            { 名称 = "百日眠", 熟练度 = 25000 },
        },
        施法几率 = 70,
        是否消失 = false,

    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))


    怪物属性 = {
        名称 = "人参娃娃",
        外形 = 3922,
        等级 = 等级,
        气血 = 1552154 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = 1590,
        抗性 = {
            物理吸收 = 60,
            抗震慑 = 10,
            抗风 = 20,
            抗火 = 60,
            抗水 = 20,
            抗雷 = 20,
            抗混乱 = 95,
            抗封印 = 85,
            抗昏睡 = 85,
            忽视防御几率 = 100,
            忽视防御程度 = 100,
            连击率 = 100,
            连击次数 = 5,
            反击率 = 100,
            反击次数 = 5,
            命中率 = 75,
            狂暴几率 = 100,
        },
        技能 = {
            { 名称 = "阎罗追命", 熟练度 = 25000 },
            { 名称 = "魔神附身", 熟练度 = 25000 },
            { 名称 = "乾坤借速", 熟练度 = 25000 },
        },
        施法几率 = 10,
        是否消失 = false,

    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))
    怪物属性 = {
        名称 = "采莲仙童",
        外形 = 47,
        等级 = 等级,
        气血 = 1552154 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = 1710,
        抗性 = {
            物理吸收 = 85,
            抗震慑 = 10,
            抗火 = 60,
            抗混乱 = 95,
            抗封印 = 85,
            抗昏睡 = 85,
            忽视防御几率 = 100,
            忽视防御程度 = 100,
            连击率 = 100,
            连击次数 = 3,
            反击率 = 100,
            反击次数 = 5,
            命中率 = 75,
            狂暴几率 = 100,
        },
        技能 = {
            { 名称 = "阎罗追命", 熟练度 = 25000 },
            { 名称 = "魔神附身", 熟练度 = 25000 },
            { 名称 = "含情脉脉", 熟练度 = 25000 },
        },
        施法几率 = 10,
        是否消失 = false,

    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))
    怪物属性 = {
        名称 = "梅花仙",
        外形 = 2100,
        等级 = 等级,
        气血 = 1552154 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = -60,
        抗性 = {
            物理吸收 = 60,
            抗震慑 = 10,
            抗火 = 60,
            抗混乱 = 95,
            抗封印 = 85,
            抗昏睡 = 85,
            加强雷 = 100,
            加强风 = 100,
            加强水 = 100,
            忽视抗雷 = 50,
            忽视抗风 = 50,
            忽视抗水 = 50,
            水系狂暴几率 = 30,
            雷系狂暴几率 = 30,
            风系狂暴几率 = 30,
        },
        技能 = {
            { 名称 = "天诛地灭", 熟练度 = 25000 },
            { 名称 = "九龙冰封", 熟练度 = 25000 },
        },
        施法几率 = 70,
        是否消失 = false,

    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))
    怪物属性 = {
        名称 = "桃花仙",
        外形 = 2096,
        等级 = 等级,
        气血 = 1552154 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = 1260,
        抗性 = {
            物理吸收 = 60,
            抗震慑 = 10,
            抗火 = 60,
            抗混乱 = 95,
            抗封印 = 85,
            抗昏睡 = 85,
            加强雷 = 100,
            加强风 = 100,
            加强水 = 100,
            忽视抗雷 = 50,
            忽视抗风 = 50,
            忽视抗水 = 50,
            水系狂暴几率 = 30,
            雷系狂暴几率 = 30,
            风系狂暴几率 = 30,
        },
        技能 = {
            { 名称 = "天诛地灭", 熟练度 = 25000 },
            { 名称 = "九龙冰封", 熟练度 = 25000 },
        },
        施法几率 = 70,
        是否消失 = false,

    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))
    怪物属性 = {
        名称 = "貔貅",
        外形 = 2041,
        等级 = 等级,
        气血 = 1552154 + 转生 * 500000 + 等级 * 20000,
        魔法 = 20000 + 等级 * 501,
        攻击 = 19954 + 转生 * 1200 + 等级 * 100,
        速度 = 10,
        抗性 = {
            物理吸收 = 60,
            抗震慑 = 10,
            抗火 = 60,
            抗混乱 = 85,
            抗封印 = 95,
            抗昏睡 = 95,
        },
        技能 = {
            { 名称 = "阎罗追命", 熟练度 = 25000 },
            { 名称 = "乾坤借速", 熟练度 = 25000 },
        },
        施法几率 = 70,
        是否消失 = false,

    }
    self:加入敌方(6, 生成战斗怪物(怪物属性))
end

function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end

--===============================================
function 事件:完成(玩家)
    if 玩家.是否组队 then
        for _, v in 玩家:遍历队伍() do
            self:掉落包(v)
        end
    else
        self:掉落包(玩家)
    end
end

local _广播 = '#R%s#C通过了天官的考验，得到了一个#G#m(%s)[%s]#m#n#112'

function 事件:掉落包(玩家)
    if 玩家:取活动限制次数('花灯报吉_天官') >= 5 then
        return
    end
    玩家:增加活动限制次数('花灯报吉_天官')

    local 经验 = 1069300
    玩家:添加任务经验(经验)
    玩家:添加法宝经验(500)

    local 掉落包 = 取掉落包('活动', '花灯报吉')
    if 掉落包 then
        奖励掉落包物品(玩家, 掉落包['天官'], _广播)
    end
end

return 事件
