-- @Author              : GGELUA
-- @Last Modified by    : GGELUA2
-- @Date                : 2024-09-24 11:14:52
-- @Last Modified time  : 2024-11-03 11:32:29

local 事件 = {
    名称 = '夺镖任务',
    类型 = '活动',
    是否打开 = true,
    是否可接任务 = true,
}

function 事件:事件初始化()
    if os.date('%w', os.time()) == '1' then
        print('星期一，开启夺镖活动')
        local year = tonumber(os.date('%Y', os.time()))
        local month = tonumber(os.date('%m', os.time()))
        local day = tonumber(os.date('%d', os.time()))
        self.开始时间 = os.time { year = year, month = month, day = day, hour = 08, min = 00, sec = 00 }
        self.结束时间 = os.time { year = year, month = month, day = day, hour = 22, min = 00, sec = 00 }
        self.是否结束 = false
    end
end

local _主怪信息 = {
    [1] = { 名称 = '长风镖局', 模型 = 3117, 数量 = 30 },
    [2] = { 名称 = '龙虎镖局', 模型 = 3015, 数量 = 30 },
    [3] = { 名称 = '鼎信镖局', 模型 = 2083, 数量 = 30 },
}

local _地图 = { 1193, 1110, 1194, 1173, 1091, 1092 }

function 事件:取怪物数量(地图, 名称)
    local 数量 = 0
    local map = self:取地图(地图)
    for k, v in map:遍历NPC() do
        if v.名称 == 名称 then
            数量 = 数量 + 1
        end
    end
    return 数量
end

function 事件:清除所有怪物()
    for ii, vv in ipairs(_地图) do
        local map = self:取地图(vv)
        for i = 1, #_主怪信息 do
            for k, v in map:遍历NPC() do
                if v.名称 == _主怪信息[i].名称 then
                    v:删除()
                end
            end
        end
    end
end

function 事件:更新()
    if self.是否结束 then
        return
    end
    local 地图组 = {}
    self.时间 = os.time() + 30 * 60
    for ii, vv in ipairs(_地图) do
        local map = self:取地图(vv)
        table.insert(地图组, map.名称)
        for i = 1, #_主怪信息 do
            -- 先清空
            for k, v in map:遍历NPC() do
                if v.名称 == _主怪信息[i].名称 and not v.战斗中 then
                    v:删除()
                end
            end

            local 刷新数量 = _主怪信息[i].数量
            for _ = 1, 刷新数量 do
                local 方向 = math.random(1, 4)
                local X, Y = map:取随机坐标()
                local NPC = map:添加NPC {
                    名称 = _主怪信息[i].名称,
                    外形 = _主怪信息[i].模型,
                    称谓 = '镖师',
                    方向 = 方向,
                    脚本 = 'scripts/event/活动1_夺镖任务.lua',
                    时间 = self.时间,
                    X = X,
                    Y = Y,
                    来源 = self
                }
            end
        end
    end
    self:发送系统('#G押运贪官镖银的车队正在路过#Y%s，#G请各位有志之士火速前往，夺取镖银。#90', table.concat(地图组, '、'))
    return 1800
end

function 事件:事件开始()
    self:更新()
    self:定时(1800, self.更新)
    print('夺镖任务活动开始')
end

function 事件:事件结束()
    self.是否结束 = true
    self:清除所有怪物()
    print('夺镖任务活动结束')
end

--=======================================================
local 对话 = [[
大胆，朝廷的镖你也敢抢？
menu
1|抢的就是你，打劫！
2|我认错人了
]]

local _战斗对话 = {
    "你们把遗失的镖银留下吧#15，我们是奉命抢劫。不留下东西,你们有可能活不了#17，我们也不能完成任务,为了你们能够活命我们能够完成任务，求求你们留下些好东西吧#89,让我们交差了事!#43一举两得的事情,你们何乐而不为呢?!#17",
    "呔一一此山是我开，此树是我载，若要从此过，留下买路钱!#43",
}


function 事件:判断变身卡(玩家)
    if 玩家.外形 ~= 2044 then
        return false
    end
    -- for k, v in 玩家:遍历队伍() do
    --     if not v.是否机器人 and v.外形 ~= 2044 then
    --         return false
    --     end
    -- end
    return true
end

function 事件:NPC对话(玩家, NPC)
    if 玩家:取队伍人数() < 3 then
        return '也不掂量掂量自己的把势，就这几个人就想来打劫！#99'
    end
    if not self:判断变身卡(玩家) then
        return '何方宵小，打劫也这么明目张胆吗#24！#R（提示：队伍中所有人变成强盗后才能劫镖。）'
    end
    return 对话
end

function 事件:NPC菜单(玩家, i, NPC)
    if NPC and NPC:是否战斗中() then
        return "我正在战斗中"
    end
    if i == '1' then
        if not NPC:是否战斗中() then
            NPC:进入战斗(true)
            玩家:最后对话(_战斗对话[math.random(2)], 玩家.原形 or 玩家.外形)
            local r = 玩家:进入战斗('scripts/event/活动1_夺镖任务.lua', NPC)
            NPC:进入战斗(false)
            if r then
                self:完成(玩家)
                NPC:删除()
            else
                return "也不掂量掂量自己的把势,这么几个人就想来打劫!#99"
            end
        else
            return "我正在战斗中"
        end
    end
end

function 事件:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        名称 = "总镖师",
        外形 = 2077,
        等级 = 110,
        气血 = 200000 + 转生 * 80000 + 等级 * math.random(800, 1000),
        魔法 = 26000 + 等级 * 35,
        攻击 = 2988,
        速度 = math.random(80, 100) + 转生 * 50 + 等级 * 2,
        抗性 = {
            抗混乱 = 80,
            抗封印 = 80,
            抗昏睡 = 80,
            抗遗忘 = 80,
            抗中毒= -120,
            抗风 = -300,
            抗火 = -300,
            抗水 = -300,
            抗雷 = -300,
            抗鬼火 = 10,
            抗物理 = 50,
            抗震慑 = 10,
            躲闪率 = 37.5,
            反震几率 = 75,
            反震程度 = 75,
            --加强
            加强混乱 = 20,
            忽视抗混 = 10,
            加强封印 = 20,
            忽视抗封 = 10,
            加强昏睡 = 20,
            忽视抗睡 = 10,
            加强毒 = 54,
            忽视抗毒 = 36,
            加强遗忘 = 10,
            忽视抗遗忘 = 10 ,
            加强风 = 50,
            加强火 = 50,
            加强水 = 50,
            加强雷 = 50,
            忽视抗风 = 30,
            忽视抗火 = 30,
            忽视抗水 = 30,
            忽视抗雷 = 30,
            加强鬼火 = 10,
            忽视抗鬼火 = 10,
            加强震慑 = 10,
            忽视抗震慑 = 5,
            连击率 = 75,
            连击次数 = 3,
            狂暴几率 = 50,
            致命几率 = 50,
            抗致命几率 = 0,
            忽视防御几率 = 50,
            忽视防御程度 = 50,
            反击率 = 75,
            反击次数 = 3,
        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 15000 },
            { 名称 = "谗言相加", 熟练度 = 15000 },
        },
        施法几率 = 50,
        是否消失 = false,
    }
    self:加入敌方(1, 生成战斗怪物(生成怪物抗性(怪物属性, '中等')))


    怪物属性 = {
        名称 = "副总镖师",
        外形 = math.random(6),
        等级 = 110,
        气血 = 150000 + 转生 * 50000 + 等级 * 1000,
        魔法 = 26000 + 等级 * 35,
        攻击 = 2988,
        速度 = math.random(50, 80) + 转生 * 50 + 等级 * 2,
        抗性 = {
        -- 抗性
        抗混乱 = 80,
        抗封印 = 80,
        抗昏睡 = 80,
        抗遗忘 = 80,
        抗中毒= -120,
        抗风 = -300,
        抗火 = -300,
        抗水 = -300,
        抗雷 = -300,
        抗鬼火 = 10,
        抗物理 = 50,
        抗震慑 = 10,
        躲闪率 = 37.5,
        反震几率 = 75,
        反震程度 = 75,
        -- 加强
        加强混乱 = 20,
        忽视抗混 = 10,
        加强封印 = 20,
        忽视抗封 = 10,
        加强昏睡 = 20,
        忽视抗睡 = 10,
        加强毒 = 54,
        忽视抗毒 = 36,
        加强遗忘 = 10,
        忽视抗遗忘 = 10 ,
        加强风 = 50,
        加强火 = 50,
        加强水 = 50,
        加强雷 = 50,
        忽视抗风 = 30,
        忽视抗火 = 30,
        忽视抗水 = 30,
        忽视抗雷 = 30,
        加强鬼火 = 10,
        忽视抗鬼火 = 10,
        加强震慑 = 10,
        忽视抗震慑 = 5,
        连击率 = 0,
        连击次数 = 0,
        狂暴几率 = 0,
        致命几率 = 0,
        抗致命几率 = 0,
        忽视防御几率 = 0,
        忽视防御程度 = 0,
        反击率 = 0,
        反击次数 = 0,
        },
        技能 = {
            { 名称 = "九龙冰封", 熟练度 = 13000 },
        },
        施法几率 = 50,
        是否消失 = false,
    }

    self:加入敌方(2, 生成战斗怪物(生成怪物抗性(怪物属性, '简单')))

    怪物属性 = {
        名称 = "镖师",
        外形 = 2048,
        等级 = 90,
        气血 = 120000 + 转生 * 30000 + 等级 * 1000,
        魔法 = 26000 + 等级 * 35,
        攻击 = 2988,
        速度 = math.random(50, 100) + 转生 * 50 + 等级 * 2,
        抗性 = {
            物理吸收 = 10,
            抗混乱 = 10,
            抗风 = 5,
            抗水 = 5,
            抗雷 = 5,
            抗火 = 5,
            抗鬼火 = 5,

            连击率 = 10,
            连击次数 = 3,
            狂暴几率 = 5,
            致命几率 = 5,
            抗致命几率 = 0,
            忽视防御几率 = 0,
            忽视防御程度 = 0,
            反击率 = 5,
            反击次数 = 1,
        },
        技能 = {
            { 名称 = "雷神怒击", 熟练度 = 6000 }

        },
        施法几率 = 50,
        是否消失 = false,
    }

    for i = 3, math.random(7, 10), 1 do
        self:加入敌方(i, 生成战斗怪物(生成怪物抗性(怪物属性, '简单')))
    end
end

function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end

function 事件:完成(玩家)
    for k, v in 玩家:遍历队伍() do
        self:掉落包(v)
    end
end

function 事件:掉落包(玩家)
    if 玩家:取活动限制次数('夺镖任务') >= 60 then
        return
    end
    玩家:增加活动限制次数('夺镖任务')

    local 经验 = 3500000
    玩家:添加经验(经验)
    玩家:添加参战召唤兽经验(经验 * 1.5)

    local 掉落包 = 取掉落包('活动', '夺镖任务')
    if 掉落包 then
        奖励掉落包物品(玩家, 掉落包)
    end
end

return 事件
