local 事件 = {
    名称 = '盛世华夏',
    类型 = '活动',
    是否打开 = true,
    是否可接任务 = true,
}

function 事件:事件初始化()
    if os.date('%w', os.time()) == '2' then
        print('星期二，开启盛世华夏活动')
        local year = tonumber(os.date('%Y', os.time()))
        local month = tonumber(os.date('%m', os.time()))
        local day = tonumber(os.date('%d', os.time()))
        self.开始时间 = os.time { year = year, month = month, day = day, hour = 08, min = 00, sec = 00 }
        self.结束时间 = os.time { year = year, month = month, day = day, hour = 22, min = 00, sec = 00 }
        self.是否结束 = false
    end
end

local _主怪信息 = {
    { 名称 = '百济王', 模型 = 2305, 数量 = 10 },
    { 名称 = '倭寇小头目', 模型 = 2182, 数量 = 20 },
    { 名称 = '倭寇小队长', 模型 = 2182, 数量 = 40 }
}

local _地图 = { 1193, 1194, 1173 }

function 事件:取怪物数量(地图, 名称)
    local 数量 = 0
    local map = self:取地图(地图)
    for k, v in map:遍历NPC() do
        if v.名称 == 名称 then
            数量 = 数量 + 1
        end
    end
    return 数量
end

function 事件:清除所有怪物()
    for ii, vv in ipairs(_地图) do
        local map = self:取地图(vv)
        for i = 1, #_主怪信息 do
            for k, v in map:遍历NPC() do
                if v.名称 == _主怪信息[i].名称 then
                    v:删除()
                end
            end
        end
    end
end

function 事件:更新()
    if self.是否结束 then
        return
    end
    self.时间 = os.time() + 30 * 60
    for ii, vv in ipairs(_地图) do
        local map = self:取地图(vv)
        for i = 1, #_主怪信息 do
            for k, v in map:遍历NPC() do
                if v.名称 == _主怪信息[i].名称 and not v.战斗中 then
                    v:删除()
                end
            end

            local 刷新数量 = _主怪信息[i].数量
            for _ = 1, 刷新数量 do
                local 方向 = math.random(1, 4)
                local X, Y = map:取随机坐标()
                local NPC = map:添加NPC {
                    名称 = _主怪信息[i].名称,
                    外形 = _主怪信息[i].模型,
                    称谓 = '倭寇',
                    方向 = 方向,
                    脚本 = 'scripts/event/活动3_盛世华夏.lua',
                    时间 = self.时间,
                    X = X,
                    Y = Y,
                    来源 = self
                }
            end
        end
    end
    self:发送系统('#Y【盛世华夏】#C唐王梦里见千百年来倭寇不死贼心反复肆意侵扰。醒来，深感倭寇之心昭然若揭，需大举歼灭方能攘外安内以绝后患。于是下旨：倭寇犯境我#Y五指山、长安东、大唐边境#C。人人得以诛之，诛灭者必当重赏。')
    return 1800
end

function 事件:事件开始()
    self:更新()
    self:定时(1800, self.更新)
    print('盛世华夏活动开始')
end

function 事件:事件结束()
    self.是否结束 = true
    self:清除所有怪物()
    print('盛世华夏活动结束')
end

function 事件:事件刷新()
end

--=======================================================
local 对话 = [[
没想到我躲在这里，也会被你们发现，休想抓我回去。#4
menu
1|妖孽，受死吧
2|我认错人了
]]

function 事件:NPC对话(玩家, NPC)
    return 对话
end

function 事件:NPC菜单(玩家, i, NPC)
    if NPC.战斗中 then
        return
    end
    if not NPC:是否战斗中() then
        if i == '1' then
            NPC:进入战斗(true)
            local r = 玩家:进入战斗('scripts/event/活动3_盛世华夏.lua', NPC)
            NPC:进入战斗(false)
            if r then
                self:完成(玩家, NPC)
                NPC:删除()
            end
        end
    else
        return "我正在战斗中"
    end
end

--===============================================

local _队长 = {
    {
        名称 = '倭寇小队长',
        外形 = 2182,
        等级 = 80,
        气血 = 262587,
        魔法 = 107000,
        攻击 = 5500,
        速度 = 530,
        抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 12 },
        技能 = { { 名称 = "失心狂乱", 熟练度 = 2000 }, { 名称 = "借刀杀人", 熟练度 = 2000 } },
    },
    { 名称 = '倭寇军师', 外形 = 2045, 等级 = 80, 气血 = 182587, 魔法 = 87000, 攻击 = 3500, 速度 = 400, 抗性 = { 抗混乱 = 20, 抗昏睡 = 20, 抗封印 = 20, 抗震慑 = 5 }, 技能 = { '天诛地灭', '袖里乾坤' }, 熟练度 = 1000, 施法几率 = 80 },
    { 名称 = '倭寇军师', 外形 = 2045, 等级 = 80, 气血 = 182587, 魔法 = 87000, 攻击 = 3500, 速度 = 400, 抗性 = { 抗混乱 = 20, 抗昏睡 = 20, 抗封印 = 20, 抗震慑 = 5 }, 技能 = { '九阴纯火', '九龙冰封' }, 熟练度 = 1000, 施法几率 = 80 },
    { 名称 = '倭寇喽啰', 外形 = 2087, 等级 = 80, 气血 = 122587, 魔法 = 87000, 攻击 = 5500, 速度 = 480, 抗性 = { 抗混乱 = 10, 抗昏睡 = 10, 抗封印 = 10 } },
    { 名称 = '倭寇喽啰', 外形 = 2087, 等级 = 80, 气血 = 122587, 魔法 = 87000, 攻击 = 5500, 速度 = 480, 抗性 = { 抗混乱 = 10, 抗昏睡 = 10, 抗封印 = 10 } },
    { 名称 = '倭寇喽啰', 外形 = 2020, 等级 = 80, 气血 = 122587, 魔法 = 87000, 攻击 = 5500, 速度 = 480, 抗性 = { 抗混乱 = 10, 抗昏睡 = 10, 抗封印 = 10 } },
    { 名称 = '倭寇喽啰', 外形 = 2046, 等级 = 80, 气血 = 122587, 魔法 = 87000, 攻击 = 5500, 速度 = 480, 抗性 = { 抗混乱 = 10, 抗昏睡 = 10, 抗封印 = 10 } },
}

local _头目 = {
    {
        名称 = '倭寇小头目',
        外形 = 2182,
        等级 = 100,
        气血 = 462587,
        魔法 = 207000,
        攻击 = 12500,
        速度 = 630,
        抗性 = { 抗混乱 = 50, 抗昏睡 = 50, 抗封印 = 50, 抗震慑 = 16 },
        技能 = { { 名称 = "失心狂乱", 熟练度 = 5000 }, { 名称 = "百日眠", 熟练度 = 5000 } },
    },
    { 名称 = '倭寇小队长', 外形 = 2182, 等级 = 100, 气血 = 382587, 魔法 = 287000, 攻击 = 13500, 速度 = 300, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 12 }, 技能 = { '失心狂乱', '借刀杀人' }, 熟练度 = 3000, 施法几率 = 80 },
    { 名称 = '倭寇小队长', 外形 = 2182, 等级 = 100, 气血 = 382587, 魔法 = 287000, 攻击 = 13500, 速度 = 300, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 12 }, 技能 = { '失心狂乱', '借刀杀人' }, 熟练度 = 3000, 施法几率 = 80 },
    { 名称 = '倭寇军师', 外形 = 2045, 等级 = 100, 气血 = 282587, 魔法 = 186000, 攻击 = 8500, 速度 = 480, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 8 }, 技能 = { '魔神附身', '乾坤借速' }, 熟练度 = 3000, 施法几率 = 50 },
    { 名称 = '倭寇军师', 外形 = 2045, 等级 = 100, 气血 = 282587, 魔法 = 186000, 攻击 = 8500, 速度 = 480, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 8 }, 技能 = { '阎罗追命', '含情脉脉' }, 熟练度 = 3000, 施法几率 = 50 },
    { 名称 = '倭寇喽啰', 外形 = 2087, 等级 = 100, 气血 = 182587, 魔法 = 12590, 攻击 = 14390, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8, 连击率 = 30, 连击次数 = 3 } },
    { 名称 = '倭寇喽啰', 外形 = 2087, 等级 = 100, 气血 = 182587, 魔法 = 12590, 攻击 = 14390, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8, 连击率 = 30, 连击次数 = 3 } },
    { 名称 = '倭寇喽啰', 外形 = 2020, 等级 = 100, 气血 = 182587, 魔法 = 12590, 攻击 = 14390, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8, 连击率 = 30, 连击次数 = 3 } },
    { 名称 = '倭寇喽啰', 外形 = 2046, 等级 = 100, 气血 = 182587, 魔法 = 12590, 攻击 = 14390, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8, 连击率 = 30, 连击次数 = 3 } },
    { 名称 = '倭寇喽啰', 外形 = 2046, 等级 = 100, 气血 = 182587, 魔法 = 12590, 攻击 = 14390, 速度 = 420, 抗性 = { 抗混乱 = 30, 抗昏睡 = 30, 抗封印 = 30, 抗震慑 = 8, 连击率 = 30, 连击次数 = 3 } },
}

local _将领 = {
    {
        名称 = '百济王',
        外形 = 2305,
        等级 = 120,
        气血 = 1662587,
        魔法 = 1207000,
        攻击 = 52500,
        速度 = 730,
        抗性 = {
            忽视防御几率 = 100,
            忽视防御程度 = 80,
            连击率 = 60,
            连击次数 = 3,
            反击率 = 50,
            反击次数 = 2,
            抗混乱 = 100,
            抗昏睡 = 80,
            抗封印 = 80,
            抗震慑 = 18,
        }
    },
    {
        名称 = '倭寇小头目',
        外形 = 2182,
        等级 = 120,
        气血 = 862587,
        魔法 = 207000,
        攻击 = 26500,
        速度 = 560,
        抗性 = { 抗混乱 = 50, 抗昏睡 = 50, 抗封印 = 50, 抗震慑 = 16 },
        技能 = { { 名称 = "失心狂乱", 熟练度 = 10000 }, { 名称 = "借刀杀人", 熟练度 = 10000 } },
    },
    {
        名称 = '倭寇小队长',
        外形 = 2182,
        等级 = 120,
        气血 = 822587,
        魔法 = 207000,
        攻击 = 22400,
        速度 = 500,
        抗性 = { 抗混乱 = 45, 抗昏睡 = 45, 抗封印 = 45, 抗震慑 = 14 },
        技能 = { { 名称 = "百日眠", 熟练度 = 10000 }, { 名称 = "迷魂醉", 熟练度 = 10000 } },
    },
    { 名称 = '倭寇军师', 外形 = 2045, 等级 = 120, 气血 = 482587, 魔法 = 386000, 攻击 = 18500, 速度 = 480, 抗性 = { 抗混乱 = 45, 抗昏睡 = 45, 抗封印 = 45, 抗震慑 = 12 }, 技能 = { '魔神附身', '乾坤借速' }, 熟练度 = 10000, 施法几率 = 50 },
    { 名称 = '倭寇军师', 外形 = 2045, 等级 = 120, 气血 = 482587, 魔法 = 386000, 攻击 = 18500, 速度 = 480, 抗性 = { 抗混乱 = 45, 抗昏睡 = 45, 抗封印 = 45, 抗震慑 = 12 }, 技能 = { '阎罗追命', '含情脉脉' }, 熟练度 = 10000, 施法几率 = 50 },
    { 名称 = '倭寇喽啰', 外形 = 2087, 等级 = 120, 气血 = 382587, 魔法 = 122590, 攻击 = 32390, 速度 = 440, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 8, 连击率 = 30, 连击次数 = 3 } },
    { 名称 = '倭寇喽啰', 外形 = 2087, 等级 = 120, 气血 = 382587, 魔法 = 122590, 攻击 = 32390, 速度 = 440, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 8, 连击率 = 30, 连击次数 = 3 } },
    { 名称 = '倭寇喽啰', 外形 = 2020, 等级 = 120, 气血 = 382587, 魔法 = 122590, 攻击 = 32390, 速度 = 440, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 8, 连击率 = 30, 连击次数 = 3 } },
    { 名称 = '倭寇喽啰', 外形 = 2046, 等级 = 120, 气血 = 382587, 魔法 = 122590, 攻击 = 32390, 速度 = 440, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 8, 连击率 = 30, 连击次数 = 3 } },
    { 名称 = '倭寇喽啰', 外形 = 2046, 等级 = 120, 气血 = 382587, 魔法 = 122590, 攻击 = 32390, 速度 = 440, 抗性 = { 抗混乱 = 40, 抗昏睡 = 40, 抗封印 = 40, 抗震慑 = 8, 连击率 = 30, 连击次数 = 3 } },
}

function 事件:战斗初始化(玩家, NPC)
    if NPC.名称 == '倭寇小队长' then
        for i, v in ipairs(_队长) do
            local r = 生成战斗怪物(v)
            self:加入敌方(i, r)
        end
    end
    if NPC.名称 == '倭寇小头目' then
        for i, v in ipairs(_头目) do
            local r = 生成战斗怪物(v)
            self:加入敌方(i, r)
        end
    end
    if NPC.名称 == '百济王' then
        for i, v in ipairs(_将领) do
            local r = 生成战斗怪物(v)
            self:加入敌方(i, r)
        end
    end
end

function 事件:战斗回合开始(dt)
end

function 事件:战斗结束(x, y)
end

function 事件:完成(玩家, NPC)
    for k, v in 玩家:遍历队伍() do
        self:掉落包(v, NPC)
    end
end

local _广播 = {
    [1] = "#R%s#C成功击杀来犯的倭寇，把倭寇打了个落花流水，倭寇落荒而逃。唐王下旨奖励#G#m(%s)[%s]#m#n#89",
    [2] = "#R%s#C成功击杀来犯得头目#Y百济王，#C给倭寇头目打了个落花流水，倭寇落荒而逃。并从倭寇的私藏种抢得#G#m(%s)[%s]#m#n#89",
}

function 事件:掉落包(玩家, NPC)
    if 玩家:取活动限制次数('盛世华夏') >= 60 then
        return
    end
    玩家:增加活动限制次数('盛世华夏')

    local 掉落包 = 取掉落包('活动', '盛世华夏')
    if 掉落包 then
        if NPC.名称 == '倭寇小队长' then
            local 经验 = 351024
            玩家:添加经验(经验)
            玩家:添加参战召唤兽经验(经验 * 1.5)

            奖励掉落包物品(玩家, 掉落包[1], _广播[1])
        elseif NPC.名称 == '倭寇小头目' then
            local 经验 = 651024
            玩家:添加经验(经验)
            玩家:添加参战召唤兽经验(经验 * 1.5)

            奖励掉落包物品(玩家, 掉落包[2], _广播[1])
        elseif NPC.名称 == '百济王' then
            local 经验 = 1261024
            玩家:添加经验(经验)
            玩家:添加参战召唤兽经验(经验 * 1.5)

            奖励掉落包物品(玩家, 掉落包[3], _广播[2])
        end
    end
end

return 事件
