local 战斗 = {}

function 战斗:战斗初始化(玩家, NPC)
    for i = 1, 1 do
        local r = 生成战斗怪物 {
            外形 = NPC.外形,
            名称 = NPC.名称,
            等级 = 90,
            气血 = 800000,
            魔法 = 560000,
            攻击 = 12800,
            速度 = 780,
            抗性 = {
                抗混乱 = 30,
                抗封印 = 30,
                抗昏睡 = 30,
                抗中毒 = 25,
                抗风 = 35,
                抗火 = 35,
                抗水 = 35,
                抗雷 = 35,
                加强混乱 = 8,
                加强封印 = 8,
                加强昏睡 = 8,
                忽视抗混 = 4,
                忽视抗印 = 4,
                忽视抗睡 = 4,
                抗震慑 = 10,
                物理吸收 = 50,
                躲闪率 = 25,
            },
            技能 = {
                { 名称 = "失心狂乱", 熟练度 = 3000 },
                -- { 名称 = "四面楚歌", 熟练度 = 3000 },
            },
            施法几率 = 100,
            是否消失 = true
        }
        self:加入敌方(i, r)
    end
    for i = 2, 5 do
        local r = 生成战斗怪物 {
            外形 = 2038,
            名称 = '白虎',
            攻击 = 27800,
            速度 = 650,
            气血 = 10000,
            是否消失 = true
        }
        self:加入敌方(i, r)
    end
end

function 战斗:战斗回合开始(dt)
end

function 战斗:战斗结束(s)
end

return 战斗
