local 战斗 = {}

function 战斗:战斗初始化(玩家, NPC)
    for i = 1, 1 do
        local r = 生成战斗怪物 {
            外形 = NPC.外形,
            名称 = NPC.名称,
            等级 = 90,
            气血 = 800000,
            魔法 = 560000,
            攻击 = 12800,
            速度 = 780,
            抗性 = {
                抗混乱 = 50,
                抗封印 = 50,
                抗昏睡 = 50,
                抗中毒 = 25,
                抗风 = 35,
                抗火 = 35,
                抗水 = 35,
                抗雷 = 35,
                加强水 = 10,
                忽视抗水 = 5,
                抗震慑 = 10,
                物理吸收 = 50,
                躲闪率 = 25,
            },
            技能 = {
                { 名称 = "九龙冰封", 熟练度 = 10000 },

            },
            施法几率 = 60,
            是否消失 = true
        }
        self:加入敌方(i, r)
    end
    for i = 2, 4 do
        local r = 生成战斗怪物 {
            外形 = 2013,
            名称 = '两角怪',
            等级 = 90,
            气血 = 800000,
            魔法 = 300000,
            攻击 = 12800,
            速度 = 620,
            抗性 = {
                抗混乱 = 40,
                抗封印 = 40,
                抗昏睡 = 40,
                抗中毒 = 20,
                抗风 = 35,
                抗火 = 35,
                抗水 = 35,
                抗雷 = 35,
                加强混乱 = 8,
                加强封印 = 8,
                加强昏睡 = 8,
                忽视抗混 = 4,
                忽视抗印 = 4,
                忽视抗睡 = 4,
                加强毒 = 30,
                忽视抗毒 = 15,
                抗震慑 = 10,
                物理吸收 = 55,
                躲闪率 = 25,
            },
            技能 = {
                { 名称 = "阎罗追命", 熟练度 = 10000 },
                { 名称 = "万毒攻心", 熟练度 = 10000 },
                { 名称 = "百日眠", 熟练度 = 10000 },
                { 名称 = "失心狂乱", 熟练度 = 10000 },
            },
            施法几率 = 60,
            是否消失 = true
        }
        self:加入敌方(i, r)
    end
end

function 战斗:战斗回合开始(dt)
end

function 战斗:战斗结束(s)
end

return 战斗
