local 物品 = {
    名称 = '久雨初晴',
    叠加 = 999,
    类别 = 10,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    绑定 = false
}

function 物品:初始化()
end

local 挂件 = { "水苍玉佩", "怀梦香囊", "黄琅如意", "落雪风铃", "流景扬辉", "霁月古镜", "伽蓝碎雨" }
local 戒指 = { "灵草戒指", "盘古之戒", "黑木戒指", "珊瑚瓣", "冥灵戒指", "血瓷戒指", "翠玉扳指" }
local 腰带 = { "流纨束带", "辟邪腰带", "辟寒犀带", "月影犀带", "黄琅腰带", "星辰之约", "祥云流带" }
local 面具_男 = { "昆仑奴面具", "杀手头巾", "粉墨人生", "行军眼罩", "龙纹", "黑曜石冠", "琅琊梦断" }
local 面具_女 = { "蝉翼纱巾", "梨花带雨", "花旦面具", "落梅妆", "鎏金额饰", "月牙梳", "半面妆" }
local 披风_男 = { "一口钟", "鱼袋斗篷", "紫鸯披风", "抹月披风", "天篷披风", "冰河披风", "流火披风" }
local 披风_女 = { "草莺斗篷", "翠云裘", "蓝鸳披风", "沙图什", "檐牙斗篷", "尺玉披肩", "红萼斗篷" }
local 护身符 = { "久雨初晴", "岁寒松柏", "梅花占魁", "鹍鸟化鹏", "福慧双修", "天地交泰", "红日当空" }

function 物品:使用(对象)
    if not self.参数 then
        self.参数 = 1
    end

    local 名称 = "一口钟"
    local 几率 = math.random(80)
    if 几率 <= 10 then
        名称 = 护身符[self.参数]
    elseif 几率 <= 20 then
        名称 = 护身符[self.参数]
    elseif 几率 <= 30 then
        名称 = 护身符[self.参数]
    elseif 几率 <= 40 then
        名称 = 护身符[self.参数]
    elseif 几率 <= 50 then
        名称 = 护身符[self.参数]
    elseif 几率 <= 60 then
        名称 = 护身符[self.参数]
    elseif 几率 <= 70 then
        名称 = 护身符[self.参数]
    else
        名称 = 护身符[self.参数]
    end
    local r = 生成装备 { 名称 = 名称, 禁止交易 = self.禁止交易 }
    if r then
        if 对象:添加物品({ r }) then
            self.数量 = self.数量 - 1
        end
    end
end

function 物品:取描述()
    return "#Y获得" .. self.参数 .. "级随机护身符佩饰"
end

return 物品
