local 物品 = {
    名称 = '守护自选卡',
    叠加 = 999,
    类别 = 10,
    类型 = 0,
    对象 = 1,
    条件 = 2,
    绑定 = false,
}

function 物品:初始化()

end


local _守护宝卷范围 = {'千年灵狐','龙门水将','护山大神','玉兔','蟹将军','百花之灵','渔见愁','霹雳手','狐不皈','避水金睛兽','火麒麟','桃花娘子','符咒女娲守护','女贼之灵','火神女娲守护','复活女娲守护','巡海夜叉','金身罗汉','净盘使者','黄巾力士'}
local _对话 = [[
请选择你想要的召唤兽！ 
menu
1|千年灵狐 2|龙门水将
3|护山大神 4|玉兔
5|蟹将军 6|百花之灵
7|渔见愁 8|霹雳手
9|狐不皈 10|避水金睛兽
11|火麒麟 12|桃花娘子
13|符咒女娲 14|女贼之灵
15|火神女娲 16|复活女娲
17|巡海夜叉 18|金身罗汉
19|净盘使者 20|黄巾力士
19|我在想想
]]








function 物品:使用(对象)
    local r = 对象:选择窗口(_对话)
    if r then
        for i, v in ipairs(_守护宝卷范围) do
            if r==tostring(i) then
                if 对象:添加召唤(生成召唤 { 名称 =v }) then
                    self.数量 = self.数量 - 1
                    break
                end
            end
        end
    end
end



return 物品