

local 取款 = 窗口层:创建我的窗口('取款', 0, 0, 263, 273)
local _操作类型 = 0
local _背景 = {
    取款 = 'gires/0x1F441D30.tcp',
    存款 = 'ui/ck.png',
}
取款:创建关闭按钮()
local _现金数额, _存款数额, _输入数额 = 0, 0, 0

function 取款:初始化()
    self:置精灵(__res:getspr('gires/0x1F441D30.tcp'))
    self:置坐标((引擎.宽度 - self.宽度) // 2, (引擎.高度 - self.高度) // 2)
end

function 取款:显示(x, y)
end

local 银子文本 = 取款:创建文本('银子文本', 96, 70, 136, 14)
local 存款文本 = 取款:创建文本('存款文本', 96, 125, 136, 14)
local 取款输入 = 取款:创建金额输入('取款输入', 96, 182, 136, 14)
取款输入:置颜色(255, 255, 255, 255)
function 取款输入:输入数值(v)
    _输入数额 = v
end

local 取出按钮 = 取款:创建小按钮('取出按钮', 108, 220, '取出')
function 取出按钮:左键弹起()
    if _输入数额 > _存款数额 then
        窗口层:提示窗口("#Y你没有那么多存款！")
        return
    end
    _现金数额, _存款数额 = __rpc:角色_钱庄取出(_输入数额)
    取款输入:置文本(0)

    银子文本:置文本(银两颜色(_现金数额))
    存款文本:置文本(银两颜色(_存款数额))
end

local 存入按钮 = 取款:创建小按钮('存入按钮', 108, 220, '存入')
function 存入按钮:左键弹起()
    if _输入数额 > _现金数额 then
        窗口层:提示窗口("#Y你没有那么多银两！")
        return
    end
    _现金数额, _存款数额 = __rpc:角色_钱庄存入(_输入数额)
    取款输入:置文本(0)
    银子文本:置文本(银两颜色(_现金数额))
    存款文本:置文本(银两颜色(_存款数额))

end

取出按钮:置可见(false)
存入按钮:置可见(false)

function 取款:置操作()
    取出按钮:置可见(_操作类型 == "取款")
    存入按钮:置可见(_操作类型 == "存款")
    取款输入:置文本(0)
    self:置精灵(__res:getspr(_背景[_操作类型]))
end

function 窗口层:打开取款(类型)
    取款:置可见(not 取款.是否可见)
    if not 取款.是否可见 then
        return
    end
    _现金数额, _存款数额 = __rpc:角色_取钱庄数据()
    银子文本:置文本(银两颜色(_现金数额))
    存款文本:置文本(银两颜色(_存款数额))
    _操作类型 = 类型
    取款:置操作()
end

return 取款
