local 皇宫挑战窗口 = 窗口层:创建我的窗口('皇宫挑战窗口', 0, 0, 375, 203)
local 银子 = 0
function 皇宫挑战窗口:初始化()
    __res.JMZ:取图像('决斗对象名称'):显示(30, 58)
    __res.JMZ:取图像('押注银两'):显示(30, 98)
    __res.F14:置颜色(157, 157, 157)

    __res.F14:置颜色(255, 255, 255)
    self:置精灵(__res:getspr('ui/hgdt.png'))

    self:置坐标((引擎.宽度 - self.宽度) // 2, (引擎.高度 - self.高度) // 2)
end

function 皇宫挑战窗口:显示(x, y)

end

皇宫挑战窗口:创建关闭按钮()

local 名称输入 = 皇宫挑战窗口:创建文本输入('决斗名称', 129, 65, 100, 18)
名称输入:置文字(__res.F16B:置颜色(255, 255, 255))
名称输入:置颜色(255, 255, 255, 255)
名称输入:置限制字数(14)

local 数量输入 = 皇宫挑战窗口:创建数字输入('银两输入', 129, 118, 135, 15)
数量输入:置颜色(255, 255, 255, 255)
function 数量输入:输入数值(n)
    银子 = n
end

local an = 皇宫挑战窗口:创建中按钮('确定按钮', 210, 155, "下战书", 100)
function an:左键弹起()
    皇宫挑战窗口:置可见(false)
    local r = __rpc:角色_下战书(名称输入:取文本(), 银子)
    if type(r) == 'string' then
        窗口层:提示窗口(r)
    end
end

function 窗口层:打开皇宫挑战(t, xy, p, i)
    皇宫挑战窗口:置可见(true)
    _p, _i = p, i
    皇宫挑战窗口:置坐标((引擎.宽度 - 皇宫挑战窗口.宽度) // 2, (引擎.高度 - 皇宫挑战窗口.高度
    ) // 2)
    皇宫挑战窗口.银两输入:置文本(0)
end

return 皇宫挑战窗口
