_种族 = 1
_性别 = 1
_外形 = 1
local _男人 = { 1, 2, 3, 40, 50 }
local _女人 = { 4, 5, 6, 41, 51 }
local _男魔 = { 7, 8, 9, 42, 52 }
local _女魔 = { 10, 11, 12, 43, 53 }
local _男仙 = { 13, 14, 15, 44, 54 }
local _女仙 = { 16, 17, 18, 45, 55 }
local _男鬼 = { 60, 61, 62 }
local _女鬼 = { 63, 64, 65 }
local _说明 = {
    [1] = "逍遥生#r【种族】人【性别】男#r【武器】扇或剑#r一袭白衫一把铁扇或一柄长剑,凭此三物而走遍江湖。与一般武夫不同的是,他们在快意恩仇之余,也喜欢舞文弄墨。",
    [2] = "剑侠客#r【种族】人【性别】男#r【武器】剑或锤#r潇洒倜傥，风度不凡。或手执长剑，或手握双锤，锄强扶弱，直指世间一切不平事。儿女情，英雄意，都付笑谈中。",
    [3] = "猛壮士#r【种族】人【性别】男#r【武器】斧头或拳套#r豪迈而不拘小节，讲义气重情谊，一身肝胆，不畏强暴，是响当当的好汉。外表虽然粗犷，但内心也有着细腻的一面。",
    [4] = "俏千金#r【种族】人【性别】女#r【武器】刀或枪#r出身于富贵之家，家门显赫，却不喜欢养尊处优；向往独立，渴望自由，因此而自习得一手好刀法及枪法，令人不敢小窥。",
    [5] = "飞燕女#r【种族】人【性别】女#r【武器】钩或鞭#r从小被异人带进深山修炼武艺，爱用钩和鞭子，喜欢大自然，身轻如燕，生性自然跳脱，活泼可爱，是个天生的乐观派。",
    [6] = "英女侠#r【种族】人【性别】女#r【武器】刀或棒#r名士之女，贤淑端庄，有着一股与生俱来的浩然正气。擅使短刀或棒杖，有爱心，路见不平必拔刀相助，是个巾帼不让须眉的女侠。",
    [40] = "飞剑侠#r【种族】人【性别】男#r【武器】剑或拳套#r行走江湖多年，现退隐江湖，已经不再过问江湖之事，一身绝世武功，能剑随意走，人剑合一。真是御剑游神州，世外逍遥侠。",
    [41] = "燕山雪#r【种族】人【性别】女#r【武器】剑或刀#r使得一手绝世剑法，武林中人不知其剑法从何而来，只知她出剑之处剑光如雪花，无处不在。是个十载燕山苦学艺，一朝功成闯江湖的侠义女子。",
    [50] = "纯阳子#r【种族】人【性别】男#r【武器】扇或书#r本风流倜傥一秀才，喜四处行走，行侠仗义。后因奇遇修行得道，跻身八仙，位列全真五祖。得正果后弃剑不用，羽扇轻挥，谈笑间惩恶扬善，令妖魔贼子闻风丧胆。",
    [51] = "红拂女#r【种族】人【性别】女#r【武器】鞭或剑#r此女为风尘三侠之一，以女流之身而修武入道，亦侠亦仙，属传说中的人物。其性情刁钻、武艺高强，见不得一点不平事，听不得一些是非语。手中长鞭有如龙蛇，矫灵异常，实为无知宵小的克星。",
    [7] = "巨魔王#r【种族】魔【性别】男#r【武器】刀或枪#r魔族之子，以庞大的身形及天生的神力而著称。钟情的武器是大刀和枪矛，挥舞起来虎虎有声，令对手不战而退。",
    [8] = "夺命妖#r【种族】魔【性别】男#r【武器】刀或幡#r有阴间“夺命杀手”之称。不喜欢硬打硬拼，刀走偏锋，专攻对手弱点；还有独门武器招魂幡，夺命勾魂，实是厉害非常。",
    [9] = "虎头怪#r【种族】魔【性别】男#r【武器】棒或枪#r足智多谋，力量与智慧的结合体。他们并不一味地依赖于与生俱来的魔族之力，而是尽可能多地拓展自己的潜能。拿手武器是棒杖和枪矛。",
    [10] = "狐美人#r【种族】魔【性别】女#r【武器】爪或鞭#r天生对动物有着特别的感情，爱与动物为伴；驯有一妖狐，使得一手好鞭法，好胜心强，喜欢追求各种刺激和挑战。",
    [11] = "骨精灵#r【种族】魔【性别】女#r【武器】棒或剑#r由不死白骨吸取天地养分多年所化而成的妖精，对世间的许多事物都抱有一颗好奇之心。爱好和平，但受侵犯时也会以棒杖或短剑来出击自卫",
    [12] = "小蛮妖#r【种族】魔【性别】女#r【武器】钩或刀#r刁蛮任性，性格泼辣，红色头饰和带刺的护腕使之显得与众不同。擅使单刀，刀法干脆利落；还有一双对钩，挥动起来也是得心应手。",
    [42] = "逆天魔#r【种族】魔【性别】男#r【武器】枪或斧#r吸取日月精华，潜心修行千年，终于练就魔功。手中一把夺魂枪犀利非凡。一出手石破天惊，鬼哭神嚎，连神佛都不敢等闲视之。",
    [43] = "媚灵狐#r【种族】魔【性别】女#r【武器】刀或环#r乃是千年灵狐，吸天地灵气，修得正果，已是妖中之仙。手中一把半月刀更是灵气逼人，能在无形间取人性命。",
    [52] = "混天魔#r【种族】魔【性别】男#r【武器】刀或斧#r天庭诞生之前就存在的混世魔王，因屡屡扰乱天地和谐曾被元始天尊封印了九万九千九百年。形体极为高大修长，身着亮银魔甲，手执六鬼锁元刀，加上冷竣的眼神，给人一种不寒而栗的感觉。",
    [53] = "九尾狐#r【种族】魔【性别】女#r【武器】爪或钩#r狐修千年得一尾，该妖共有九尾，乃灵狐之祖。其长相极为妖媚，有一笑倾城，二笑倾国之容。攻击时一改柔弱之相，幻化为银狐挥动巨爪将敌人瞬间撕为齑粉。",

    [13] = "神天兵#r【种族】仙【性别】男#r【武器】枪或锤#r昔日殷商守城将，一身殉国千古闻，玉帝感其刚烈，特拔擢为南天王座下天兵，性刚直，势威猛，气韵不凡。",
    [14] = "龙战将#r【种族】仙【性别】男#r【武器】棒或爪#r身经百战的天界神将，不怒自威，一支舞得出神入化的棒仗和一对无坚不摧的利爪均是挡者披靡，让不少敌人闻风丧胆。",
    [15] = "智圣仙#r【种族】仙【性别】男#r【武器】拂尘或剑#r修道多年的神仙，以一把随身携带、伤人于无形的浮尘和利剑为除敌的武器。最可怕还是他们睿智的头脑，不轻易为敌人的挑衅所动。",

    [16] = "舞天姬#r【种族】仙【性别】女#r【武器】飘带或棒#r美貌、优雅而高贵，讲究穿着和打扮。攻击时使用长棒或彩带，看似无力，但经她们的手施出时却让人不可轻视。",
    [17] = "精灵仙#r【种族】仙【性别】女#r【武器】拳套或环#r精灵调皮，爱恶作剧和开些善意的玩笑。性格好动，因圆刀的外形可爱而选择了它作为防身武器，又因孩子气而喜欢上了拳套。",
    [18] = "玄剑娥#r【种族】仙【性别】女#r【武器】枪或剑#r神将之后，自小习武，因此不像普通女仙般喜欢脂粉，而独钟于武学；尤其擅长枪矛和长剑。平时性格温和，但到了比武场则是判若两人。",

    [44] = "武尊神#r【种族】仙【性别】男#r【武器】枪或爪#r天神之子，自幼在天宫勤修仙术，虽未授神职，然仙力不亚大罗金仙，一身神功在天界早已传为嘉话，是未来仙界青睐的栋梁之材。",
    [45] = "玄天姬#r【种族】仙【性别】女#r【武器】飘带或环#r云鬓峨峨冰玉骨，悦目佳人倚修竹。沧海一梦惊鸿影，曾忆前生问情殊。",

    [54] = "紫薇神#r【种族】仙【性别】男#r【武器】剑或幡#r北极中天紫薇大帝，为斗部诸神之首，有着无上法力。身形端庄威武，一脸严肃之相。手中竖琴暗藏一剑，犀利无匹。剑出，天地暗，神鬼泣，风云为之变色。",



    [55] = "霓裳仙#r【种族】仙【性别】女#r【武器】飘带或灯笼#r玉皇大帝之女，娇柔之状，我见尤怜。因自幼挚爱纺织，遂采白云为布、积月光为丝、以彩虹染色织就霓裳。难以想象一位那么娟秀的女子，一双如此柔弱的纤手竟能释放出那么强大的法术。",

    [60] = "猎魂引#r【种族】鬼【性别】男#r【武器】枪或拳套#r一个无忧无虑的草根少年，生时打猎为生，死后依然喜欢和小动物一起生活在丛林里。",
    [61] = "无涯子#r【种族】鬼【性别】男#r【武器】幡或书#r生前是容貌俊秀，文采出众的皇子。",
    [62] = "祭剑魂#r【种族】鬼【性别】男#r【武器】刀或剑#r每一把神兵名剑都是有意识的。兵器饮血越多，这种意识就会越强烈，最后脱离剑体，化而为灵。",
    [63] = "夜溪灵#r【种族】鬼【性别】女#r【武器】灯笼或环#r幽冥地府阴阳河中水灯化成的小鬼仙。",
    [64] = "幽梦影#r【种族】鬼【性别】女#r【武器】环或飘带#r生于深宅大院，自幼受到良好的教育，才名四起，被人比作再世谢道韫。正值豆蔻年华，却被父母指婚嫁给纨绔子弟。心中另有所爱的她不愿成为政治婚姻的牺牲品，再几经反抗却无计可施之后，自尽抗婚。",
    [65] = "墨衣行#r【种族】鬼【性别】女#r【武器】鞭或钩#r生前是武艺高强，快意恩仇的江湖女子，在江湖恩怨中不幸殒命。他们漠视生死，独来独往，荡尽泉下不平事。",

}

_坐标组 = {
    { x = 15, y = 23 },
    { x = 90, y = 23 },
    { x = 15, y = 113 },
    { x = 90, y = 113 },
    { x = 15, y = 203 },
    { x = 90, y = 203 },
}
local 转生重选窗口 = 窗口层:创建我的窗口('转生重选窗口', 0, 0, 495, 419)
local function 创建头像组(r, t)
    local h = 0
    local l = 1
    for k, v in pairs(t) do
        h = h + 1
        if h > 2 then
            h = 1
            l = l + 1
        end
        local 按钮 = r:创建按钮('角色' .. k, 15 + h * 75 - 75, 23 + l * 90 - 90)
        function 按钮:初始化()
            self:置正常精灵(
                生成精灵(
                    67,
                    80,
                    function()
                        self:取拉伸图像_宽高('gires/main/border.bmp', 67, 80):显示(0, 0)
                        __res:getsf('photo/face/%s.tga', v):置拉伸(62, 75):显示(2, 2)

                    end
                )
            )
            self:置按下精灵(
                生成精灵(
                    67,
                    80,
                    function()
                        self:取拉伸图像_宽高('gires/main/border.bmp', 67, 80):显示(0, 0)
                        __res:getsf('photo/face/%s.tga', v):置拉伸(62, 75):显示(3, 3)

                    end
                )
            )
        end

        function 按钮:左键弹起()
            转生重选窗口:置模型(v)
            r.选中 = k
        end

    end
end

function 转生重选窗口:初始化()
    self:置精灵(__res:getspr('ui/zzz.png'))
    self:置坐标((引擎.宽度 - self.宽度) // 2, (引擎.高度 - self.高度) // 2)
    self.选中框 = self:取拉伸精灵_宽高("gires4/ty/hsxzk56.tcp", 67, 80)
end

function 转生重选窗口:可见事件(v)
    -- if v == false and co then
    --     coroutine.resume(co)
    -- end
end

local 标签控件 = 转生重选窗口:创建标签('标签控件', 0, 0, 495, 419)
local 人族按钮 = 标签控件:创建自定义小标签按钮('人族按钮', 34, 32, '人族', 80, 25)
local 魔族按钮 = 标签控件:创建自定义小标签按钮('魔族按钮', 34 + 85, 32, '魔族', 80, 25)
local 仙族按钮 = 标签控件:创建自定义小标签按钮('仙族按钮', 34 + 170, 32, '仙族', 80, 25)
local 鬼族按钮 = 标签控件:创建自定义小标签按钮('鬼族按钮', 34 + 255, 32, '鬼族', 80, 25)
function 鬼族按钮:初始化()
    鬼族按钮:置可见(false)
end

人族区域 = 标签控件:创建区域(人族按钮, 25, 56, 172, 342)

do
    local 标签控件 = 人族区域:创建标签('标签控件', 0, 0, 172, 342)
    local 男按钮 = 标签控件:创建单选按钮('男按钮', 14, 311)
    do
        function 男按钮:初始化()
            local tcp = __res:get('gires4/jdmh/yjan/dxk.tcp')
            self:置正常精灵(tcp:取精灵(1):置中心(0, 0))
            self:置按下精灵(tcp:取精灵(1):置中心(-1, -1))
            self:置选中正常精灵(tcp:取精灵(2):置中心(0, 0))
        end

        function 男按钮:左键弹起()
            if 男人区域.选中 then
                转生重选窗口:置模型(_男人[男人区域.选中])
            end
            _性别 = 1
        end

        人族区域:创建文本("男", 39, 314, 30, 14):置文本("男人")
    end

    local 女按钮 = 标签控件:创建单选按钮('女按钮', 93, 311)
    do
        function 女按钮:初始化()
            local tcp = __res:get('gires4/jdmh/yjan/dxk.tcp')
            self:置正常精灵(tcp:取精灵(1):置中心(0, 0))
            self:置按下精灵(tcp:取精灵(1):置中心(-1, -1))
            self:置选中正常精灵(tcp:取精灵(2):置中心(0, 0))
        end

        function 女按钮:左键弹起()
            if 女人区域.选中 then
                转生重选窗口:置模型(_女人[女人区域.选中])
            end
            _性别 = 2
        end

        人族区域:创建文本("女", 118, 314, 30, 14):置文本("女人")
    end

    男人区域 = 标签控件:创建区域(男按钮, 0, 0, 172, 342)
    do
        男人区域.选中 = 1
        创建头像组(男人区域, _男人)
        function 男人区域:前显示(x, y)
            if self.选中 then
                转生重选窗口.选中框:显示(x + _坐标组[self.选中].x, y + _坐标组[self.选中].y)
            end
        end

    end

    女人区域 = 标签控件:创建区域(女按钮, 0, 0, 172, 342)
    do
        女人区域.选中 = 1
        创建头像组(女人区域, _女人)
        function 女人区域:前显示(x, y)
            if self.选中 then
                转生重选窗口.选中框:显示(x + _坐标组[self.选中].x, y + _坐标组[self.选中].y)
            end
        end
    end
    男按钮:置选中(true)
end

local 魔族区域 = 标签控件:创建区域(魔族按钮, 25, 56, 172, 342)
do
    local 标签控件 = 魔族区域:创建标签('标签控件', 0, 0, 172, 342)
    local 男按钮 = 标签控件:创建单选按钮('男按钮', 14, 311)
    do
        function 男按钮:初始化()
            local tcp = __res:get('gires4/jdmh/yjan/dxk.tcp')
            self:置正常精灵(tcp:取精灵(1):置中心(0, 0))
            self:置按下精灵(tcp:取精灵(1):置中心(-1, -1))
            self:置选中正常精灵(tcp:取精灵(2):置中心(0, 0))
        end

        function 男按钮:左键弹起()
            if 男魔区域.选中 then
                转生重选窗口:置模型(_男魔[男魔区域.选中])
            end
            _性别 = 1
        end

        魔族区域:创建文本("男", 39, 314, 30, 14):置文本("男魔")
    end

    local 女按钮 = 标签控件:创建单选按钮('女按钮', 93, 311)
    do
        function 女按钮:初始化()
            local tcp = __res:get('gires4/jdmh/yjan/dxk.tcp')
            self:置正常精灵(tcp:取精灵(1):置中心(0, 0))
            self:置按下精灵(tcp:取精灵(1):置中心(-1, -1))
            self:置选中正常精灵(tcp:取精灵(2):置中心(0, 0))
        end

        function 女按钮:左键弹起()
            if 女魔区域.选中 then
                转生重选窗口:置模型(_女魔[女魔区域.选中])
            end
            _性别 = 2
        end

        魔族区域:创建文本("女", 118, 314, 30, 14):置文本("女魔")
    end
    男魔区域 = 标签控件:创建区域(男按钮, 0, 0, 172, 342)
    do

        男魔区域.选中 = 1
        创建头像组(男魔区域, _男魔)
        function 男魔区域:前显示(x, y)
            if self.选中 then
                转生重选窗口.选中框:显示(x + _坐标组[self.选中].x, y + _坐标组[self.选中].y)
            end
        end
    end

    女魔区域 = 标签控件:创建区域(女按钮, 0, 0, 172, 342)
    do
        女魔区域.选中 = 1
        创建头像组(女魔区域, _女魔)
        function 女魔区域:前显示(x, y)
            if self.选中 then
                转生重选窗口.选中框:显示(x + _坐标组[self.选中].x, y + _坐标组[self.选中].y)
            end
        end
    end

    男按钮:置选中(true)
end

local 仙族区域 = 标签控件:创建区域(仙族按钮, 25, 56, 172, 342)
do
    local 标签控件 = 仙族区域:创建标签('标签控件', 0, 0, 172, 342)
    local 男按钮 = 标签控件:创建单选按钮('男按钮', 14, 311)
    do
        function 男按钮:初始化()
            local tcp = __res:get('gires4/jdmh/yjan/dxk.tcp')
            self:置正常精灵(tcp:取精灵(1):置中心(0, 0))
            self:置按下精灵(tcp:取精灵(1):置中心(-1, -1))
            self:置选中正常精灵(tcp:取精灵(2):置中心(0, 0))
        end

        function 男按钮:左键弹起()
            if 男仙区域.选中 then
                转生重选窗口:置模型(_男仙[男仙区域.选中])
            end
            _性别 = 1
        end

        仙族区域:创建文本("男", 39, 314, 30, 14):置文本("男仙")
    end


    local 女按钮 = 标签控件:创建单选按钮('女按钮', 93, 311)
    do
        function 女按钮:初始化()
            local tcp = __res:get('gires4/jdmh/yjan/dxk.tcp')
            self:置正常精灵(tcp:取精灵(1):置中心(0, 0))
            self:置按下精灵(tcp:取精灵(1):置中心(-1, -1))
            self:置选中正常精灵(tcp:取精灵(2):置中心(0, 0))
        end

        function 女按钮:左键弹起()
            if 女仙区域.选中 then
                转生重选窗口:置模型(_女仙[女仙区域.选中])
            end
            _性别 = 2
        end

        仙族区域:创建文本("女", 118, 314, 30, 14):置文本("女仙")
    end
    男仙区域 = 标签控件:创建区域(男按钮, 0, 0, 172, 342)
    do
        男仙区域.选中 = 1
        创建头像组(男仙区域, _男仙)
        function 男仙区域:前显示(x, y)
            if self.选中 then
                转生重选窗口.选中框:显示(x + _坐标组[self.选中].x, y + _坐标组[self.选中].y)
            end
        end
    end

    女仙区域 = 标签控件:创建区域(女按钮, 0, 0, 172, 342)
    do
        女仙区域.选中 = 1
        local _女仙 = { 16, 17, 18, 45, 55 }
        创建头像组(女仙区域, _女仙)
        function 女仙区域:前显示(x, y)
            if self.选中 then
                转生重选窗口.选中框:显示(x + _坐标组[self.选中].x, y + _坐标组[self.选中].y)
            end
        end
    end

    男按钮:置选中(true)
end

local 鬼族区域 = 标签控件:创建区域(鬼族按钮, 25, 56, 172, 342)
do

    local 标签控件 = 鬼族区域:创建标签('标签控件', 0, 0, 172, 342)
    local 男按钮 = 标签控件:创建单选按钮('男按钮', 14, 311)
    do
        function 男按钮:初始化()
            local tcp = __res:get('gires4/jdmh/yjan/dxk.tcp')
            self:置正常精灵(tcp:取精灵(1):置中心(0, 0))
            self:置按下精灵(tcp:取精灵(1):置中心(-1, -1))
            self:置选中正常精灵(tcp:取精灵(2):置中心(0, 0))
        end

        function 男按钮:左键弹起()
            if 男鬼区域.选中 then
                转生重选窗口:置模型(_男鬼[男鬼区域.选中])
            end
            _性别 = 1
        end

        鬼族区域:创建文本("男", 39, 314, 30, 14):置文本("男鬼")
    end


    local 女按钮 = 标签控件:创建单选按钮('女按钮', 93, 311)
    do
        function 女按钮:初始化()
            local tcp = __res:get('gires4/jdmh/yjan/dxk.tcp')
            self:置正常精灵(tcp:取精灵(1):置中心(0, 0))
            self:置按下精灵(tcp:取精灵(1):置中心(-1, -1))
            self:置选中正常精灵(tcp:取精灵(2):置中心(0, 0))
        end

        function 女按钮:左键弹起()
            if 女鬼区域.选中 then
                转生重选窗口:置模型(_女鬼[女鬼区域.选中])
            end
            _性别 = 2
        end

        鬼族区域:创建文本("女", 118, 314, 30, 14):置文本("女鬼")
    end
    男鬼区域 = 标签控件:创建区域(男按钮, 0, 0, 172, 342)
    do
        男鬼区域.选中 = 1
        创建头像组(男鬼区域, _男鬼)
        function 男鬼区域:前显示(x, y)
            if self.选中 then
                转生重选窗口.选中框:显示(x + _坐标组[self.选中].x, y + _坐标组[self.选中].y)
            end
        end
    end

    女鬼区域 = 标签控件:创建区域(女按钮, 0, 0, 172, 342)
    do
        女鬼区域.选中 = 1
        创建头像组(女鬼区域, _女鬼)
        function 女鬼区域:前显示(x, y)
            if self.选中 then
                转生重选窗口.选中框:显示(x + _坐标组[self.选中].x, y + _坐标组[self.选中].y)
            end
        end
    end

    男按钮:置选中(true)
end

do
    local 文本 = 转生重选窗口:创建文本("武器", 210, 243, 14, 70)
    文本:置文本("武器预览")
    文本 = 转生重选窗口:创建文本("介绍文本", 215, 78, 232, 120)
    文本:置文本("逍遥生#r【种族】人【性别】男#r【武器】扇或剑#r一袭白衫一把铁扇或一柄长剑,凭此三物而走遍江湖。与一般武夫不同的是,他们在快意恩仇之余,也喜欢舞文弄墨。")
end
local 转种族按钮 = 转生重选窗口:创建中按钮("转种族按钮", 298, 357, "确  定")
function 转种族按钮:左键弹起()
    窗口层:刷新转生来世(_种族, _性别, _外形)
    self.父控件:置可见(false)
end

function 转生重选窗口:更新(dt)
    if self.动画1 then
        self.动画1:更新(dt)
    end
    if self.动画2 then
        self.动画2:更新(dt)
    end
end

function 转生重选窗口:显示(x, y)
    if self.动画1 then
        self.动画1:显示(x + 275, y + 300)
    end
    if self.动画2 then
        self.动画2:显示(x + 385, y + 300)
    end
end

function 转生重选窗口:置模型(n)
    self:清空()
    local a = 18
    if n > 18 and n < 60 then
        a = 0
    elseif n >= 60 then
        a = 6
    end
    转生重选窗口.动画1 = require('对象/基类/动作') { 外形 = n, 模型 = 'attack' }
    转生重选窗口.动画1:置循环(true)
    转生重选窗口.动画2 = require('对象/基类/动作') { 外形 = n + a, 模型 = 'attack' }
    转生重选窗口.动画2:置循环(true)
    self.介绍文本:置文本(_说明[n])
    _外形 = n
end

function 转生重选窗口:清空()
    self.动画1 = nil
    self.动画2 = nil
end

function 人族按钮:左键弹起()
    if 人族区域.标签控件.男按钮.是否选中 then
        转生重选窗口:置模型(_男人[男人区域.选中])
        _性别 = 1
    else
        转生重选窗口:置模型(_女人[女人区域.选中])
        _性别 = 2
    end
    _种族 = 1
end

function 魔族按钮:左键弹起()
    if 魔族区域.标签控件.男按钮.是否选中 then
        转生重选窗口:置模型(_男魔[男魔区域.选中])
        _性别 = 1
    else
        转生重选窗口:置模型(_女魔[女魔区域.选中])
        _性别 = 2
    end
    _种族 = 2
end

function 仙族按钮:左键弹起()
    if 仙族区域.标签控件.男按钮.是否选中 then
        转生重选窗口:置模型(_男仙[男仙区域.选中])
        _性别 = 1
    else
        转生重选窗口:置模型(_女仙[女仙区域.选中])
        _性别 = 2
    end
    _种族 = 3
end

function 鬼族按钮:左键弹起()
    if 鬼族区域.标签控件.男按钮.是否选中 then
        转生重选窗口:置模型(_男鬼[男鬼区域.选中])
        _性别 = 1
    else
        转生重选窗口:置模型(_女鬼[女鬼区域.选中])
        _性别 = 2
    end
    _种族 = 4
end

转生重选窗口:置模型(1)
转生重选窗口:创建关闭按钮()


local function 置角色数量(z)

    n = 4
    if z >= 2 then
        n = 5
    end
    for i = 1, 5 do
        if 男人区域['角色' .. i] then
            男人区域['角色' .. i]:置可见(i <= n)
        end

        if 女人区域['角色' .. i] then
            女人区域['角色' .. i]:置可见(i <= n)
        end
        if 男魔区域['角色' .. i] then
            男魔区域['角色' .. i]:置可见(i <= n)
        end
        if 女魔区域['角色' .. i] then
            女魔区域['角色' .. i]:置可见(i <= n)
        end

        if 男仙区域['角色' .. i] then
            男仙区域['角色' .. i]:置可见(i <= n)
        end
        if 女仙区域['角色' .. i] then
            女仙区域['角色' .. i]:置可见(i <= n)
        end
    end
end

function 窗口层:打开转生重选窗口(r)
    转生重选窗口:置可见(not 转生重选窗口.是否可见)
    if not 转生重选窗口.是否可见 then
        return
    end
    人族按钮:置选中(true)
    置角色数量(r)
end

return 转生重选窗口
