local 飞升窗口 = 窗口层:创建我的窗口('飞升窗口', 0, 0, 448, 367)
local _种族 = { "人", "魔", "仙", "鬼" }
local _来世种族, _来世性别, _来世外形, _转生 = 1, 1, 1, 0
local 修正 = {
    [1001] = {
        { 抗混乱 = 10.25, 抗封印 = 10.25, 抗昏睡 = 10.25 },
        { 抗混乱 = 15.37, 抗封印 = 15.37, 抗昏睡 = 15.37 },
        { 抗混乱 = 20.5, 抗封印 = 20.5, 抗昏睡 = 20.5 },
        { 抗混乱 = 20.5, 抗封印 = 20.5, 抗昏睡 = 20.5 },
    },
    [1002] = {
        { 抗中毒 = 13.83, 抗毒伤害 = 820, 抗封印 = 10.25, 抗昏睡 = 10.25 },
        { 抗中毒 = 20.83, 抗毒伤害 = 1230, 抗封印 = 15.37, 抗昏睡 = 15.37 },
        { 抗中毒 = 27.67, 抗毒伤害 = 1640, 抗封印 = 20.5, 抗昏睡 = 20.5 },
        { 抗中毒 = 27.67, 抗毒伤害 = 1640, 抗封印 = 20.5, 抗昏睡 = 20.5 },
    },
    [2001] = {
        { HP成长 = 0.082, MP成长 = 0.082, SP成长 = 0.061 },
        { HP成长 = 0.123, MP成长 = 0.123, SP成长 = 0.092 },
        { HP成长 = 0.164, MP成长 = 0.164, SP成长 = 0.123 },
        { HP成长 = 0.164, MP成长 = 0.164, SP成长 = 0.123 },
    },
    [2002] = {
        { HP成长 = 0.082, MP成长 = 0.082, 物理吸收 = 15.37, 抗震慑 = 9.21 },
        { HP成长 = 0.123, MP成长 = 0.123, 物理吸收 = 23.05, 抗震慑 = 13.82 },
        { HP成长 = 0.164, MP成长 = 0.164, 物理吸收 = 30.74, 抗震慑 = 18.42 },
        { HP成长 = 0.164, MP成长 = 0.164, 物理吸收 = 30.74, 抗震慑 = 18.42 },
    },
    [3001] = {
        { 抗水 = 13.83, 抗雷 = 13.83, 抗风 = 13.83 },
        { 抗水 = 20.75, 抗雷 = 20.75, 抗风 = 20.75 },
        { 抗水 = 27.67, 抗雷 = 27.67, 抗风 = 27.67 },
        { 抗水 = 27.67, 抗雷 = 27.67, 抗风 = 27.67 },
    },
    [3002] = {
        { 抗水 = 13.83, 抗雷 = 13.83, 抗火 = 13.83 },
        { 抗水 = 20.75, 抗雷 = 20.75, 抗火 = 20.75 },
        { 抗水 = 27.67, 抗雷 = 27.67, 抗火 = 27.67 },
        { 抗水 = 27.67, 抗雷 = 27.67, 抗火 = 27.67 },
    },
    [4001] = {
        { 抗鬼火 = 13.84, 抗遗忘 = 10.25, 抗三尸虫 = 2050 },
        { 抗鬼火 = 20.76, 抗遗忘 = 15.38, 抗三尸虫 = 3075 },
        { 抗鬼火 = 27.68, 抗遗忘 = 20.5, 抗三尸虫 = 4100 },
        { 抗鬼火 = 27.68, 抗遗忘 = 20.5, 抗三尸虫 = 4100 },
    },
    [4002] = {
        { 抗鬼火 = 13.84, 抗遗忘 = 10.25, 反震率 = 5.13, 反震程度 = 10.25 },
        { 抗鬼火 = 20.76, 抗遗忘 = 15.38, 反震率 = 7.69, 反震程度 = 15.38 },
        { 抗鬼火 = 27.68, 抗遗忘 = 20.5, 反震率 = 10.25, 反震程度 = 20.5 },
        { 抗鬼火 = 27.68, 抗遗忘 = 20.5, 反震率 = 10.25, 反震程度 = 20.5 },
    }
}
function 飞升窗口:初始化()
    self:置精灵(__res:getspr('ui/zs.png'))
    self:置坐标((引擎.宽度 - self.宽度) // 2, (引擎.高度 - self.高度) // 2)
end

function 飞升窗口:显示(x, y)
    if self.头像 then
        self.头像:显示(x + 22, y + 63)
    end
    if self.头像2 then
        self.头像2:显示(x + 231, y + 63)
    end
end

飞升窗口:创建关闭按钮()
function 飞升窗口:可见事件(v)
    if v == false and co then
        coroutine.resume(co)
    end
end

do
    for k, v in pairs {
        { name = "名称", x = 128, y = 63 },
        { name = "名称2", x = 336, y = 63 },
        { name = "种族", x = 128, y = 84 },
        { name = "种族2", x = 336, y = 84 },
        { name = "根骨", x = 128, y = 105 },
        { name = "根骨2", x = 336, y = 105 },
        { name = "灵性", x = 128, y = 125 },
        { name = "灵性2", x = 336, y = 125 },
        { name = "力量", x = 128, y = 146 },
        { name = "力量2", x = 336, y = 146 },
        { name = "敏捷", x = 128, y = 167 },
        { name = "敏捷2", x = 336, y = 167 },
    } do
        local 文本 = 飞升窗口:创建文本(v.name .. "文本", v.x, v.y, 90, 14):置文本("未知")
    end


    local 文本 = 飞升窗口:创建文本("抗性修正文本", 17, 213, 200, 38)
    文本 = 飞升窗口:创建文本("属性修正文本", 17, 285, 200, 38)
    文本 = 飞升窗口:创建文本("来世抗性文本", 233, 213, 200, 38)
    文本 = 飞升窗口:创建文本("来世属性文本", 233, 285, 200, 38)

    local 确定按钮 = 飞升窗口:创建小按钮("确定按钮", 147, 332, "确定")

    function 确定按钮:左键弹起()
        if co then
            coroutine.resume(co, _来世种族, _来世性别, _来世外形)
            self.父控件:置可见(false)
        end
    end

    local 取消按钮 = 飞升窗口:创建小按钮("取消按钮", 253, 332, "取消")
    local 重选按钮 = 飞升窗口:创建小按钮('重选按钮', 14, 334, '重选角色')
    function 重选按钮:初始化()
        self:置正常精灵(取按钮精灵2('ui/xx531.png', '重选角色'))
        self:置按下精灵(取按钮精灵2('ui/xx533.png', '重选角色', 1, 1))
        self:置经过精灵(取按钮精灵2('ui/xx532.png', '重选角色'))
    end

    function 重选按钮:左键弹起()
        窗口层:打开飞升重选窗口(_转生)
    end
end




function 飞升窗口:置头像(外形, 外形2)
    if 外形 then
        self.头像 = __res:getspr('photo/facebig/%d.tga', 外形):置拉伸(59, 81)
    end
    if 外形2 then
        self.头像2 = __res:getspr('photo/facebig/%d.tga', 外形2):置拉伸(59, 81)
    end
end

function 飞升窗口:取修正(t)
    if type(t) ~= "table" then
        return
    end
    local ts = {}
    for k, v in pairs(t) do
        table.insert(ts, { 类型 = k, 数值 = v })
    end
    local r = ''
    local fmt = ''
    local a = '%0.2f'
    local b = '%0.2f'
    for i = 1, #ts, 2 do
        if ts[i + 1] then
            fmt = '%s+%-5s  %s+%-5s#r'
            a = '%0.2f'
            if ts[i].类型 == "抗三尸虫" or ts[i].类型 == "抗毒伤害" then
                a = '%s'
            end
            b = '%0.2f'
            if ts[i + 1].类型 == "抗三尸虫" or ts[i + 1].类型 == "抗毒伤害" then
                b = '%s'
            end

            r = r .. fmt:format(ts[i].类型, string.format(a, ts[i].数值), ts[i + 1].类型,
                string.format(b, ts[i + 1].数值))
        else
            fmt = '%s+%-5s#r'
            a = '%0.2f'
            if ts[i].类型 == "抗三尸虫" or ts[i].类型 == "抗毒伤害" then
                a = '%s'
            end
            r = r .. fmt:format(ts[i].类型, string.format(a, ts[i].数值))
        end
    end
    return r
end

local _取门派抗性 = {
    方寸山 = "抗昏睡",
    化生寺 = "抗混乱",
    程府 = "抗封印",
    女儿村 = "抗毒伤害", --抗中毒伤害

    天宫 = "抗雷",
    龙宫 = "抗水",
    五庄观 = "抗风",
    普陀山 = "抗火",

    狮驼岭 = "SP成长",
    盘丝洞 = "物理吸收", --抗震慑
    地府 = "MP成长",
    魔王寨 = "HP成长",
}
local _基本信息 = {
    [1] = { 名称 = '逍遥生', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
    [2] = { 名称 = '剑侠客', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
    [3] = { 名称 = '猛壮士', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
    [4] = { 名称 = '俏千金', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
    [5] = { 名称 = '飞燕女', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
    [6] = { 名称 = '英女侠', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
    --魔
    [7] = { 名称 = '巨魔王', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
    [8] = { 名称 = '夺命妖', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
    [9] = { 名称 = '虎头怪', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
    [10] = { 名称 = '狐美人', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
    [11] = { 名称 = '骨精灵', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
    [12] = { 名称 = '小蛮妖', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
    --仙
    [13] = { 名称 = '神天兵', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
    [14] = { 名称 = '龙战将', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
    [15] = { 名称 = '智圣仙', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
    [16] = { 名称 = '舞天姬', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } },
    [17] = { 名称 = '精灵仙', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } },
    [18] = { 名称 = '玄剑娥', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } },
    --鬼+6
    [60] = { 名称 = '猎魂引', 性别 = 1, 种族 = 4, 门派 = { '白骨洞', '阴都', '三尸派' } },
    [61] = { 名称 = '无崖子', 性别 = 1, 种族 = 4, 门派 = { '白骨洞', '阴都', '三尸派' } },
    [62] = { 名称 = '剑祭魂', 性别 = 1, 种族 = 4, 门派 = { '白骨洞', '阴都', '三尸派' } },
    [63] = { 名称 = '夜灵溪', 性别 = 2, 种族 = 4, 门派 = { '白骨洞', '阴都', '兰若寺' } },
    [64] = { 名称 = '幽梦影', 性别 = 2, 种族 = 4, 门派 = { '白骨洞', '阴都', '兰若寺' } },
    [65] = { 名称 = '墨衣行', 性别 = 2, 种族 = 4, 门派 = { '白骨洞', '阴都', '兰若寺' } },
    ----1转
    [40] = { 名称 = '飞剑侠', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
    [41] = { 名称 = '燕山雪', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
    [42] = { 名称 = '逆天魔', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
    [43] = { 名称 = '媚灵狐', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
    [44] = { 名称 = '武尊神', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
    [45] = { 名称 = '玄天姬', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } },
    ---2转
    [50] = { 名称 = '纯阳子', 性别 = 1, 种族 = 1, 门派 = { '程府', '化生寺', '方寸山' } },
    [51] = { 名称 = '红拂女', 性别 = 2, 种族 = 1, 门派 = { '方寸山', '女儿村', '程府' } },
    [52] = { 名称 = '混天魔', 性别 = 1, 种族 = 2, 门派 = { '狮驼岭', '地府', '魔王寨' } },
    [53] = { 名称 = '九尾狐', 性别 = 2, 种族 = 2, 门派 = { '盘丝洞', '地府', '魔王寨' } },
    [54] = { 名称 = '紫薇神', 性别 = 1, 种族 = 3, 门派 = { '天宫', '五庄观', '龙宫' } },
    [55] = { 名称 = '霓裳仙', 性别 = 2, 种族 = 3, 门派 = { '天宫', '普陀山', '龙宫' } }

}

local _取门派序号 = {
    程府 = 1,
    化生寺 = 2,
    女儿村 = 2,
    方寸山 = 3,
    盘丝洞 = 1,
    狮驼岭 = 1,
    地府 = 2,
    魔王寨 = 2,
    天宫 = 1,
    五庄观 = 2,
    普陀山 = 2,
    龙宫 = 3,
}

local _取门派多抗性 = {
    物理吸收 = "抗震慑",
    抗毒伤害 = "抗中毒",
}

local function 门派转换(t)
    local list = {}
    if not _基本信息[_来世外形] then
        return list
    end
    for k, v in pairs(_基本信息[_来世外形].门派) do --来世
        for key, value in pairs(t) do --今世
            if key == v or _取门派序号[key] == _取门派序号[v] then
                list[v] = value
            end
        end
    end
    return list
end

local function 抗性转换(t)
    local list = {}
    list.种族 = _来世种族 * 1000 + _来世性别
    local kx
    for key, value in pairs(t) do
        kx = _取门派抗性[key]
        list[kx] = value
        if _取门派多抗性[kx] then
            list[_取门派多抗性[kx]] = value
        end
    end
    return list
end

function 飞升窗口:刷新飞生来世(种族, 性别, 外形)
    _来世种族, _来世性别, _来世外形 = 种族, 性别, 外形
    for k, v in pairs { "根骨2", "灵性2", "力量2", "敏捷2",

    } do
        飞升窗口[v .. "文本"]:置文本(180)
    end
    飞升窗口.种族2文本:置文本(_种族[_来世种族])
    飞升窗口:置头像(nil, _来世外形)
    local 临时记录 = {}
    if _转生记录 then
        for i, v in ipairs(_转生记录) do
            table.insert(临时记录, v)
        end
    end
    local t = __rpc:角色_取今世修正系数()
--这个修正 基本就是 3转的修正咯？？？
--？？？？
    -- if _来世种族 ~= _今世种族 or _来世性别 ~= _今世性别 then
    t = 门派转换(t)
    -- end
    table.insert(临时记录, 抗性转换(t))
    local kx = {}
    local sx = {}
    for a, b in pairs(临时记录) do
        if type(b) == "table" then
            for k, v in pairs(修正[b.种族][a]) do
                if b[k] then
                    if k == "HP成长" or k == "MP成长" or k == "SP成长" then
                        sx[k] = sx[k] and sx[k] + b[k] * v or 0 + b[k] * v
                    else
                        kx[k] = kx[k] and kx[k] + b[k] * v or 0 + b[k] * v
                    end
                end
            end
        else
            for k, v in pairs(修正[b][a]) do
                if k == "HP成长" or k == "MP成长" or k == "SP成长" then
                    sx[k] = sx[k] and sx[k] + v or 0 + v
                else
                    kx[k] = kx[k] and kx[k] + v or 0 + v
                end
            end
        end
    end

    self.来世抗性文本:置文本(飞升窗口:取修正(kx))
    self.来世属性文本:置文本(飞升窗口:取修正(sx))
end

function 窗口层:打开飞升窗口()
    飞升窗口:置可见(not 飞升窗口.是否可见)
    if not 飞升窗口.是否可见 then
        return
    end
    local t = __rpc:角色_取今生属性()
    _今世性别, _今世种族 = t.性别, t.种族
    t.名称2 = t.名称
    _转生 = t.转生
    _转生记录 = {}
    --置今生
    for k, v in pairs(t) do
        if type(v) ~= "table" and 飞升窗口[k .. "文本"] then
            if k == "种族" or k == "种族2" then
                飞升窗口[k .. "文本"]:置文本(_种族[v])
            else
                飞升窗口[k .. "文本"]:置文本(v)
            end
        end
    end
    飞升窗口:置头像(t.头像)
    local kx = {}
    local sx = {}
    for a, b in pairs(t.转生记录) do
        if type(b) == "table" then
            for k, v in pairs(修正[b.种族][a]) do
                if b[k] then
                    if k == "HP成长" or k == "MP成长" or k == "SP成长" then
                        sx[k] = sx[k] and sx[k] + b[k] * v or 0 + b[k] * v
                    else
                        kx[k] = kx[k] and kx[k] + b[k] * v or 0 + b[k] * v
                    end
                end
            end
        else
            for k, v in pairs(修正[b][a]) do
                if k == "HP成长" or k == "MP成长" or k == "SP成长" then
                    sx[k] = sx[k] and sx[k] + v or 0 + v
                else
                    kx[k] = kx[k] and kx[k] + v or 0 + v
                end
            end
        end
        table.insert(_转生记录, b)
    end
    飞升窗口.抗性修正文本:置文本(飞升窗口:取修正(kx))
    飞升窗口.属性修正文本:置文本(飞升窗口:取修正(sx))

    --置来世
    飞升窗口:刷新飞生来世(t.种族, t.性别, t.头像)
end

function 窗口层:刷新飞生来世(种族, 性别, 外形)
    if not 飞升窗口.是否可见 then
        return
    end
    飞升窗口:刷新飞生来世(种族, 性别, 外形)
end

function RPC:飞升窗口()
    co = coroutine.running()
    窗口层:打开飞升窗口()
    return coroutine.yield()
end

return 飞升窗口
