-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-26 07:12:31
-- @Last Modified time  : 2022-09-05 19:58:42

local 战斗 = {
    是否惩罚 = false --死亡
}



function 战斗:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 2128,
        名称 = "天龙女",
        等级 = 等级,
        气血 = 100000 + 转生 * 80000 + 等级 * 1000,
        魔法 = 26000 + 等级 * 35,
        攻击 = 2988,
        速度 = math.random(50, 100) + 转生 * 50 + 等级 * 1,
        抗性 = {
            抗震慑 = 5,
            抗混乱 = 60,
            抗封印 = 60,
            抗昏睡 = 60,
            抗水 = -32,
            抗雷 = -32,
            抗火 = -32,
            抗风 = -32,
                加强混乱 = 10,
                雷系狂暴几率 = 10,
                风系狂暴几率 = 10,
                水系狂暴几率 = 10,
                火系狂暴几率 = 10,
                加强雷 = 30,
                加强风 = 30,
                加强火 = 30,
                加强水 = 30,
            },
            技能 = {
                  { 名称 = "九龙冰封", 熟练度 = 10000 }
            },
            施法几率 = 100,
            是否消失 = false,
        }
    self:加入敌方(1, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 55,
        名称 = "飞天",
        等级 = 等级,
        气血 = 100000 + 转生 * 80000 + 等级 * 1000,
        魔法 = 26000 + 等级 * 35,
        攻击 = 2988,
        速度 = math.random(50, 100) + 转生 * 50 + 等级 * 1,
        抗性 = {
            抗震慑 = 5,
            抗混乱 = 60,
            抗封印 = 60,
            抗昏睡 = 60,
            抗水 = -32,
            抗雷 = -32,
            抗火 = -32,
            抗风 = -32,
        },
        技能 = {
               { 名称 = "日照光华", 熟练度 = 15000 }
        },
        施法几率 = 50,
        是否消失 = false,
    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 55,
        名称 = "飞天",
        等级 = 等级,
        气血 = 100000 + 转生 * 80000 + 等级 * 1000,
        魔法 = 26000 + 等级 * 35,
        攻击 = 2988,
        速度 = math.random(50, 100) + 转生 * 50 + 等级 * 1,
        抗性 = {
            抗震慑 = 5,
            抗混乱 = 60,
            抗封印 = 60,
            抗昏睡 = 60,
            抗水 = -32,
            抗雷 = -32,
            抗火 = -32,
            抗风 = -32,
        },
        技能 = {
              { 名称 = "龙腾水溅", 熟练度 = 15000 }
        },
        施法几率 = 50,
        是否消失 = false,
    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))


    怪物属性 = {
        外形 = 55,
        名称 = "飞天",
        等级 = 等级,
        气血 = 100000 + 转生 * 80000 + 等级 * 1000,
        魔法 = 26000 + 等级 * 35,
        攻击 = 2988,
        速度 = math.random(50, 100) + 转生 * 50 + 等级 * 1,
        抗性 = {
            抗震慑 = 5,
            抗混乱 = 60,
            抗封印 = 60,
            抗昏睡 = 60,
            抗水 = -32,
            抗雷 = -32,
            抗火 = -32,
            抗风 = -32,
        },
        技能 = {
               { 名称 = "天雷怒火", 熟练度 = 15000 }
        },
        施法几率 = 50,
        是否消失 = false,
    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 55,
        名称 = "飞天",
        等级 = 等级,
        气血 = 100000 + 转生 * 80000 + 等级 * 1000,
        魔法 = 26000 + 等级 * 35,
        攻击 = 2988,
        速度 = math.random(50, 100) + 转生 * 50 + 等级 * 1,
        抗性 = {
            抗震慑 = 5,
            抗混乱 = 60,
            抗封印 = 60,
            抗昏睡 = 60,
            抗水 = -32,
            抗雷 = -32,
            抗火 = -32,
            抗风 = -32,
        },
        技能 = {
               { 名称 = "天雷怒火", 熟练度 = 15000 }
        },
        
        施法几率 = 50,
        是否消失 = false,
    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 55,
        名称 = "飞天",
        等级 = 等级,
        气血 = 100000 + 转生 * 80000 + 等级 * 1000,
        魔法 = 26000 + 等级 * 35,
        攻击 = 2988,
        速度 = math.random(50, 100) + 转生 * 50 + 等级 * 1,
        抗性 = {
            抗震慑 = 5,
            抗混乱 = 60,
            抗封印 = 60,
            抗昏睡 = 60,
            抗水 = -32,
            抗雷 = -32,
            抗火 = -32,
            抗风 = -32,
        },
        技能 = {
               { 名称 = "天雷怒火", 熟练度 = 15000 }
        },
        
        内丹 = {
            { 技能 = "浩然正气", 转生 = 0, 等级 = 50 }
        },
        施法几率 = 50,
        是否消失 = false,
    }
    self:加入敌方(6, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 55,
        名称 = "飞天",
        等级 = 等级,
        气血 = 100000 + 转生 * 80000 + 等级 * 1000,
        魔法 = 26000 + 等级 * 35,
        攻击 = 2988,
        速度 = math.random(50, 100) + 转生 * 50 + 等级 * 1,
        抗性 = {
            抗震慑 = 5,
            抗混乱 = 60,
            抗封印 = 60,
            抗昏睡 = 60,
            抗水 = -32,
            抗雷 = -32,
            抗火 = -32,
            抗风 = -32,
        },
        技能 = {
               { 名称 = "天雷怒火", 熟练度 = 15000 }
        },
        
        内丹 = {
            { 技能 = "浩然正气", 转生 = 0, 等级 = 50 }
        },


        施法几率 = 50,
        是否消失 = false,
    }
    self:加入敌方(8, 生成战斗怪物(怪物属性))







end

--熟练度 l*100
function 战斗:战斗回合开始(v)

end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end
local function 掉落包(玩家)
    local 大闹积分 = 2500


end

function 战斗:战斗结束(s)
    if s then
        for k, v in self:遍历我方() do
            if v.是否玩家 then
                掉落包( v.对象.接口)
            end
        end
    end
end


return 战斗
