local 副本 = {
    名称 = '水陆大会',
    类型 = 1, --1全服
    -- 是否打开 = false,
}
function 副本:副本初始化()

end



local _广播 = {
    false, false, false,
    "#G%s#C在水陆中连胜3场大杀特杀",
    "#G%s#C在水陆中连胜4场所向披靡",
    "#G%s#C在水陆中连胜5场浑身是胆",
    "#G%s#C在水陆中连胜6场勇冠三军",
    "#G%s#C在水陆中连胜7场一骑当千",
    "#G%s#C在水陆中连胜8场万夫莫敌",
    "#G%s#C在水陆中连胜9场举世无双",
    "#G%s#C在水陆中连胜10场天下无敌",

}

-- function 副本:单场奖励包(玩家, v, n)
--     if v then
--         玩家.其它.帮战连胜 = 玩家.其它.帮战连胜 + 1
--         if 玩家.其它.帮战连胜 > 10 then
--             玩家.其它.帮战连胜 = 10
--         end
--         local 成就 = n * 20
--         local 经验 = n * 3333
--         玩家:添加经验(经验)
--         玩家:添加帮派成就(成就)

--     else
--         玩家.其它.帮战连胜 = 0
--     end
--     local txt = _广播[玩家.其它.帮战连胜]
--     if txt then
--         玩家:发送系统(txt, 玩家.名称)
--     end
-- end
function 副本:胜利奖励包(玩家)
    local 成就 = 1000
    local 经验 = 2000000
    local 积分 = 100
    玩家:添加经验(经验)
    玩家:添加帮派成就(成就)
    玩家:添加指定积分(积分, "水陆积分")
end
function 副本:失败奖励包(玩家)
    local 成就 = 1000
    local 经验 = 1000000
    local 积分 = 100
    玩家:添加经验(经验)
    玩家:添加帮派成就(成就)
    玩家:添加指定积分(积分, "水陆积分")
end


return 副本
