

local 攻略窗口 = 窗口层:创建我的窗口('攻略窗口', 0, 0, 500, 500)
local _攻略 = require("数据/攻略")
function 攻略窗口:初始化()
    self:置精灵(
        self:取老红木窗口(
            self.宽度,
            self.高度,
            '攻略',
            function()
                --  __res.JMZ:取图像('今日积分'):显示(30, 40)
                self:取拉伸图像_宽高('ui/lbdk.png', 150, 480):置区域(0, 18, 150, 480):显示(10, 30)
                self:取拉伸图像_宽高('ui/lbdk.png', 325, 460):显示(162, 30)
                -- self:取拉伸图像_宽高('gires/main/border.bmp', 100, 380):显示(3, 26)
                -- self:取拉伸图像_宽高('ui/lbdk.png', 150, 380):置区域(0, 18, 150, 380):显示(10, 30)
                -- self:取拉伸图像_宽高('gires4/jdmh/yjan/tmk2.tcp', 375, 60):显示(162, 30)
                --   self:取拉伸图像_宽高('ui/lbdk.png', 560, 240):显示(20, 90)
                --  __res.JMZ:取图像('任务名称'):显示(50, 92)
                --   __res.JMZ:取图像('完成次数'):显示(170, 92)
                --   __res.JMZ:取图像('酬勤积分'):显示(290, 92)
                --  __res:getsf('gires4/jdmh/yjan/dxk2.tcp'):显示(33, 476)
            end
        )
    )
    self:置坐标((引擎.宽度 - self.宽度) // 2, (引擎.高度 - self.高度) // 2)
end

function 攻略窗口:显示(x, y)
end

攻略窗口:创建关闭按钮()

local 活动列表 = 攻略窗口:创建列表("活动列表", 13, 33, 144, 454)
local 介绍文本 = 攻略窗口:创建我的文本("介绍文本", 169, 55, 290, 430)
local 介绍文本2 = 介绍文本:创建我的文本("介绍文本", 0, 0, 290, 1000)
do
    活动列表:置选中精灵宽度(121)
    function 活动列表:初始化()
        self:置文字(__res.F18:置颜色(255, 255, 255))
        self:添加("游戏上线")
        self:添加("种族介绍")
        self:添加("阵容搭配")
        self:添加("日常升级")
        self:添加("日常升级2")
        self:添加("转生飞升")
        self:添加("修正数据")
        self:添加("升级礼包")
        self:添加("召唤详解")
        self:添加("老版神兽")
        self:添加("人形神兽")
        self:添加("五常神兽")
        self:添加("老版神兽飞升")
        self:添加("关于召唤亲密")
        self:添加("大话币获取")
        self:添加("称谓任务")
        self:添加("NPC购买")
        self:添加("装备攻略")
        self:添加("活动攻略")
        self:添加("召唤兽攻略")
        self:添加("转生烧法")
        self:添加("法宝领取")
        self:添加("孩子养成")

    end

    活动列表:创建我的滑块()
end
function 活动列表:左键弹起(x, y, i, t)
    介绍文本._sy = 0
    介绍文本2:置文本(_攻略[t.名称])
end

function 窗口层:打开攻略窗口()
    攻略窗口:置可见(not 攻略窗口.是否可见)
    if not 攻略窗口.是否可见 then
        return
    end
end

return 攻略窗口
