

local 坐骑技能 = 窗口层:创建我的窗口('坐骑技能', 0, 0, 258, 347)
function 坐骑技能:初始化()
    self:置精灵(__res:getspr('gires/0x5A8AA272.tcp'))
    self:置坐标((引擎.宽度 - self.宽度) // 2, (引擎.高度 - self.高度) // 2)
end

function 坐骑技能:显示(x, y)
end

function 坐骑技能:刷新技能(t)
    if type(t) ~= "table" then
        return
    end
    _数据 = t

self.熟练度文本:置文本(_数据.熟练度)
self.技能说明:置文本(_数据.描述)

end

坐骑技能:创建关闭按钮(0, 1)
--====================================================================
local 技能列表 = 坐骑技能:创建列表('技能列表', 24, 39, 208, 58)
do
    function 技能列表:添加技能(i, t)
        local r = self:添加(t.名称)
        r:取精灵():置中心(0, -2)
        r:置高度(20)
        r.nid = t.nid
        r.描述 = t.描述
        r.熟练度=t.熟练度
    end

    function 技能列表:左键弹起(x, y, i, t)
        坐骑技能:刷新技能(t)
    end

    --====================================================================
    local 技能说明 = 坐骑技能:创建文本('技能说明', 24, 113, 208, 181)
    技能说明:置文字(__res.F16)


    --====================================================================
    local 文本 = 坐骑技能:创建文本('熟练度文本', 104, 313, 128, 15)
    文本:置文字(__res.F16)
    -- 文本:置文本('0')
end

function 窗口层:打开坐骑技能(nid)
    坐骑技能:置可见(not 坐骑技能.是否可见)
    if not 坐骑技能.是否可见 then
        return
    end

    local r = __rpc:坐骑_取技能列表(nid)
    技能列表:清空()
    if type(r) ~= "table" then
        return
    end
    for k, v in pairs(r) do
        技能列表:添加技能(k, v)
    end
end

return 坐骑技能
