

local 系统设置 = 窗口层:创建我的窗口('系统设置', 0, 0, 437, 393)
function 系统设置:初始化()
    self:置精灵(



        生成精灵(
            437,
            393,
            function()
                __res:getsf('gires/0xE6D75C85.tcp'):显示(0, 0)
                __res.JMZ:取图像("屏蔽玩家动画"):显示(300, 321)
                __res.JMZ:取图像("屏蔽玩家名称"):显示(5, 349 + 5)
                -- self:取拉伸图像_宽高('gires/main/message_box2.png', 530, 420):显示(0, 0)
            end
        )

    )
    self:置坐标((引擎.宽度 - self.宽度) // 2, (引擎.高度 - self.高度) // 2)
end

系统设置:创建关闭按钮()



local 音量滑块 = 系统设置:创建滑块('滑块', 156, 150, 215, 18)
local 滑块按钮 = 音量滑块:创建滑块按钮(0, 0, 215, 18)
滑块按钮:置正常精灵(__res:getspr('gires/0x94BCD6F0.tcp'))
滑块按钮:置经过精灵(__res:getspr('gires/0x94BCD6F0.tcp'))
滑块按钮:置按下精灵(__res:getspr('gires/0x94BCD6F0.tcp'))

function 音量滑块:滚动事件(x, y, v)
    if v == 0 then
        __设置.音乐音量 = v
        __设置.音效音量 = v
    else
        __设置.音乐音量 = v | 128
        __设置.音效音量 = v | 128
    end
    if __设置.音乐音量 & 128 == 128 then
        __res:置音乐音量(__设置.音乐音量 & 127)
    else
        __res:置音乐音量(0)
    end
    if __设置.音效音量 & 128 == 128 then
        __res:置音效音量(__设置.音效音量 & 127)
    else
        __res:置音效音量(0)
    end
    系统设置.音乐音量:置选中(__设置.音乐音量 & 128 == 128, false)
    系统设置.音效音量:置选中(__设置.音效音量 & 128 == 128, false)
    __rpc:角色_设置('音乐音量', __设置.音乐音量)
    __rpc:角色_设置('音效音量', __设置.音效音量)

end

-- local 音量滑块 = 系统设置:创建水平滚动条('音量滑块', 156, 150, 215, 18)
-- function 音量滑块:滚动事件(x, y, v)

-- end

for i, v in ipairs {
    --{ '全屏模式', 133, 43 },
    --{ '窗口模式', 268, 43 },
    --{ '场景特效', 268, 76 },
    { '音乐音量', 133, 109 },
    { '音效音量', 268, 109 },
    { '切磋开关', 133, 181 },
    { '拒绝陌生人信息', 268, 181 },
    { '消息接收', 133, 215 },
    --{ '游戏录像', 268, 215 },
    { '接受物品', 133, 249 },
    { '关闭当前聊天框', 268, 249 },
    { '好友开关', 133, 283 },
    --{ '卡牌', 268, 283 },
    { '接受组队', 133, 316 },
    { '屏蔽玩家动画', 268, 316 },
    { '屏蔽玩家名称', 133, 349 }
} do
    local 按钮 = 系统设置:创建我的多选按钮(table.unpack(v))
    function 按钮:选中事件(x)
        if v[1] == '音乐音量' then
            if x then
                x = __设置.音乐音量 | 128
                __res:置音乐音量(__设置.音乐音量 & 127)
            else
                x = __设置.音乐音量 & 127
                __res:置音乐音量(0)
            end
        elseif v[1] == '音效音量' then
            if x then
                x = __设置.音效音量 | 128
                __res:置音效音量(__设置.音效音量 & 127)
            else
                x = __设置.音效音量 & 127
                __res:置音效音量(0)
            end

        elseif v[1] == '屏蔽玩家动画' then
            if x then
                _G.__隐藏玩家 = 2
            else
                _G.__隐藏玩家 =nil
            end

        elseif v[1] == '屏蔽玩家名称' then
            _G.__隐藏名称=x
        end
        __设置[v[1]] = x
        __rpc:角色_设置(v[1], x)
    end
end


function 窗口层:打开系统()
    系统设置:置可见(not 系统设置.是否可见)
    if not 系统设置.是否可见 then
        return
    end
    系统设置.音乐音量:置选中(__设置.音乐音量 & 128 == 128, false)
    系统设置.音效音量:置选中(__设置.音效音量 & 128 == 128, false)
    音量滑块:置位置(__设置.音乐音量 & 127)

    for _, k in ipairs {
        '切磋开关', '拒绝陌生人信息', '消息接收', '接受物品', '关闭当前聊天框',
        '好友开关', '接受组队'
    } do
        系统设置[k]:置选中(__设置[k] ~= false, false)
    end
end

return 系统设置
