local 任务 = {
    名称 = '称谓14_三打白骨精',
    别名 = '(十四称)三打白骨精',
    类型 = '称谓剧情',
    是否可取消 = false
}

function 任务:任务初始化(玩家, ...)
    self.寻物 = { 青月灵草 = 0, 火凤之睛 = 0 }
end

function 任务:任务上线(玩家)
end

function 任务:任务更新(玩家, sec)
end

local _详情 = {
    '你可以完成第十四个称谓剧情任务了，任务领取人#Y五指山(253,48)#G#u#[1194|253|46|$五指山土地#]#u',
    '帮五指山土地探望#G#u#[101300|93|90|$白骨山土地#]#u#W。',
    '去山里找找妖精的踪迹，妖精幻化成了#G#u#[101300|212|75|$女子#]#u#W的模样。',
    '去山里找找妖精的踪迹，妖精幻化成了#G#u#[101300|75|58|$老妇人#]#u#W的模样。',
    '去山里找找妖精的踪迹，妖精幻化成了#G#u#[101300|141|55|$老头#]#u#W的模样。',
    '找不到妖精的踪迹，问问#G#u#[101300|93|90|$白骨山土地#]#u#W怎么回事。',
    '妖怪变化无穷，去找#G#u#[1111|53|44|$李靖#]#u#W借照妖镜来找出它的真身。',
    '照妖镜被狮驼岭的#G#u#[1131|52|4|$疯牛怪#]#u#W得到了，打败他拿回来吧。（ ALT+A疯牛怪进入战斗）',
    '拿到照妖镜了，去除妖吧，妖精幻化成#G#u#[101300|212|75|$女子#]#u#W的模样。#R（对话结束后进入战斗！）',
    '妖精逃掉了，再去搜寻它的踪迹，妖精幻化成了#G#u#[101300|75|58|$老妇人#]#u#W的模样。',
    '妖精逃掉了，再去搜寻它的踪迹，妖精幻化成了#G#u#[101300|141|55|$老头#]#u#W的模样。',
    '照妖镜失去了作用? ?回天宫问问#G#u#[1111|53|44|$李靖#]#u#W是怎么回事。',
    '妖怪妖法太强，需要借助#G#u#[1113|12|8|$太上老君#]#u#W的乾坤八卦镜才行。',
    '去给#G#u#[1113|12|8|$太上老君#]#u#W找青月灵草和火凤之睛这两种种配料吧。#Y(青月灵草和火凤之睛洛阳药店有售，找到2种药品后，请ALT+G给予太上老君。两种药品都给子后就可以向太上老君换取乾坤八卦镜了。)',
    '拿到了乾坤八卦镜，这下妖怪跑不掉了吧，妖精幻化成了#G#u#[101300|75|58|$老妇人#]#u#W的模样。#R（对话结束后进入战斗！！）',
    '妖精又逃掉了，再去山里搜寻它的踪迹妖精幻化成了#G#u#[101300|141|55|$老头#]#u#W的模样。 ',
    '妖精妖法居然这么强，再去问问#G#u#[1113|12|8|$太上老君#]#u#W。',
    '太上老君也没办法了，在天宫随便逛进吧。或许#G#u#[101474|24|65|$嫦娥#]#u#W那里有办法，去她那里看看。',
    '反正暂时也没头绪，就帮嫦娥仙子跑一趟找下#G#u#[1173|255|323|$猪八戒#]#u#W吧。#Y( ALT+G将嫦娥的饰物给予猪八戒）',
    '好事做到底，帮猪八戒把回信送去给#G#u#[101474|24|65|$嫦娥#]#u#W。#Y( ALT+G将八戒的书信给予嫦娥)',
    '清心玉明镜在手，妖怪还往哪里逃！！妖精幻化成了#G#u#[101300|141|55|$老头#]#u#W的模样。#R（对话结束后进入战斗！！！）',
    '这妖精似乎和白骨仙有些瓜葛去问问#G#u#[101300|93|90|$白骨山土地#]#u#W。',
    '原来这妖精竟然是白骨仙的姐妹，去找白骨仙#G#u#[1192|111|61|$小白#]#u#W寻找破解妖术的方法吧。',
    '得到了破解纯阴妖气的东西，去寻找粉骷骸#G#u#[101301|19|10|$自骨精#]#u#W吧。#R（对话结束后进入战斗！！！）'
}
function 任务:任务取详情(玩家)
    return _详情[self.进度 + 1]
end

local _台词 = {
    [1] = { 头像 = 3070, 结束 = false, 台词 = '上仙来得正好，小老儿我有一事相求，不知上仙可肯帮忙？' },
    [2] = { 头像 = 0, 结束 = false, 台词 = '什么事情呀？？' },
    [3] = { 头像 = 3070, 结束 = false, 台词 = '小老儿有一兄弟，在白骨山任土地小职。很久没见，心中甚是想念，但俗务缠身无暇探访。听说上仙西行修真，不知可否请上仙顺路探望，以慰小老儿的思亲之心。' },
    [4] = { 头像 = 0, 台词 = '嗯，思兄心切，这种忙我是一定会帮的，你就放心吧，我一定帮你把话带到！' },
    --0

    [5] = { 头像 = 0, 结束 = false, 台词 = '啊，你就是白骨山土地吗？？' },
    [6] = { 头像 = 3070, 结束 = false, 台词 = '小老儿正是，不知上仙有何吩咐？？' },
    [7] = { 头像 = 0, 结束 = false, 台词 = '那个……五指山土地是你兄弟是吧，他托我带话给你，说他非常想念你，另外叫我来看看你最近情况。' },
    [8] = { 头像 = 3070, 结束 = false, 台词 = '啊，原来是家兄……真是多谢上仙。' },
    [9] = { 头像 = 0, 结束 = false, 台词 = '嗯，那是小事，不过我看…衣衫褴褛，面黄肌瘦，做个土地，没这么惨吧。' },
    [10] = { 头像 = 3070, 结束 = false, 台词 = '唉，上仙有所不知，白骨山原也是富饶之处，但不知何时出了个妖怪，这妖怪惯会变化，妖法无边。自有此妖后，这山便行人绝迹，飞鸟遁踪，变成这般荒凉模样。' },
    [11] = { 头像 = 0, 台词 = '岂有此理，竟有这种事情，你等着，我去收了它，还你个清净之地。' },
    --1

    [12] = { 头像 = 3071, 台词 = '啊，你…你是什么人？？不是强盗吧？？奴家丈夫在山北凹里，带几个客子锄田。奴家是去送饭给他们的，不是妖精。' },
    --2

    [13] = { 头像 = 3069, 台词 = '你…你说什么？？…荒唐！老身一生吃斋礼佛，行善积德，怎么会是妖精！！' },
    --3

    [14] = { 头像 = 3030, 台词 = '妖…妖精！…什么话，老头子女婿在北山锄田，女儿刚去给它们送饭，老头子出来走走，竟然被你说成妖精。我看你才像妖精。' },
    --4

    [15] = { 头像 = 3070, 结束 = false, 台词 = '上仙，如何？？可有斩获？？' },
    [16] = { 头像 = 0, 结束 = false, 台词 = '嗯，这妖精果然有些道行，以我的辩识，也只能隐隐感觉那几人似乎不妥，缠着些妖气，但却看不真切。又怕会误伤无辜好人。' },
    [17] = { 头像 = 3070, 结束 = false, 台词 = '那…那可如何是好？？' },
    [18] = { 头像 = 0, 台词 = '嗯，我想想，对啦，天宫李天王那里有一面#R照妖镜#W，无论什么妖怪，都可以照出原形，等我去借到此镜来，妖怪就无所遁形了。' },
    --5

    [19] = { 头像 = 2294, 结束 = false, 台词 = '白骨山的妖精？？天庭早想除灭此妖了，但此妖妖法强大，一直没有合适的人选，既然你有心除去此妖，那就交给你办了。' },
    [20] = { 头像 = 0, 结束 = false, 台词 = '（……这样就给我个差使）既然如此，还请天王借照妖镜一用。' },
    [21] = { 头像 = 2294, 结束 = false, 台词 = '照妖镜吗？借给你是没问题，不过…前几天去下界除妖的时候，不小心把它失落在了#R狮驼岭#W，听说现在被#R疯牛怪#W得到了。本来准备这几天就去拿回来既然你要惜，那你就顺便跑一趟吧。' },
    [22] = { 头像 = 0, 台词 = '…… …… …… …… …… …… …… …… ……' },
    --6

    [23] = { 头像 = 0, 台词 = '想不到这疯牛怪这么横，废这老半天劲才搞定，这个李靖还真会派差事，不过好歹拿到了照妖镜，赶紧去白骨山吧。' },
    --7

    [24] = { 头像 = 3071, 结束 = false, 台词 = '奴家丈夫在山北凹里，带几个客子锄田。奴家是去送饭给他们的，不是妖精（哼哼，以你那点微蒲道行，能识破我这化身吗？）' },
    [25] = { 头像 = 0, 结束 = false, 台词 = '哼哼，妖精，照妖镜照得一清二楚，还想变到什么时候？？吃我一招！' },
    [26] = { 头像 = 3071, 结束 = false, 台词 = '可恶，居然被识破了！！我可不是好惹的！' },
    --战斗
    [27] = { 头像 = 3071, 结束 = false, 台词 = '算你行，哼，看我解尸法，你还能看出我的化身吗？？哈哈哈。' },
    [28] = { 头像 = 0, 台词 = '……居然被他逃走了！' },
    --8

    [29] = { 头像 = 3069, 结束 = false, 台词 = '妖…妖精！！…什么话，老身女婿在北山锄田，女儿刚去给它们送饭，老身出来走走，竟然被你说成妖精。我看你才像妖精。' },
    [30] = { 头像 = 0, 台词 = '嗯？？照妖镜怎么没动静了？' },
    --9

    [31] = { 头像 = 3030, 结束 = false, 台词 = '妖…妖精！！…什么话，老头子女媯在北山锄田，女儿刚去给它们送饭，老头子出来走走，竟然被你说成妖精。我看你才像妖精。' },
    [32] = { 头像 = 0, 台词 = '嗯？？照妖镜怎么没动静了？难道这妖精妖法真有这么强？？去问问李靖先。' },
    --10

    [33] = { 头像 = 2294, 结束 = false, 台词 = '只照出了妖精一个化身？？看来这妖精果然不是非凡之物。' },
    [34] = { 头像 = 0, 结束 = false, 台词 = '怎么说？？？' },
    [35] = { 头像 = 2294, 结束 = false, 台词 = '照妖镜只能照出一般妖精的本相，如果妖精法力高强，照妖镜就会失去效用。' },
    [36] = { 头像 = 0, 结束 = false, 台词 = '……原来照妖镜还不是百分之百有效啊。那你说怎么办？？' },
    [37] = { 头像 = 2294, 台词 = '不用担心，虽然照妖镜照不出妖精的本相，但只要你找太上老君，用他可以照出妖怪魂魄的#R乾坤八卦镜#W，就一定可以找出这个妖怪。' },
    --11

    [38] = { 头像 = 6535, 结束 = false, 台词 = '要找我拿乾坤八卦镜去除妖？？行啊，不过我有个条件！' },
    [39] = { 头像 = 0, 结束 = false, 台词 = '（就知道这老头儿准要刁难一番）说吧，什么条件？？' },
    [40] = { 头像 = 6535, 台词 = '上次你大闹天言，搅乱了时辰，搞得我辛辛苦苦炼制的丹药没有成形，现在我要重新炼制这些丹药，可是有几味配料找不到了，你只要给我找到#R青月灵草#W和#G火凤之眼#W这两味配料，我就把乾坤八卦镜給你。' },
    --12

    [41] = { 头像 = 6535, 结束 = false, 台词 = '你这么快就找齐了，好吧，等会儿就给你乾坤八卦镜。' },
    [42] = { 头像 = 0, 台词 = '（这死老头儿，不知我费了多少工夫）哼哼，这下乾坤八卦镜在手，我看那妖怪怎么逃！' },
    --13

    [43] = { 头像 = 3069, 结束 = false, 台词 = '你……你说什么？？……荒唐！老身一生吃斋礼佛，行善积德，怎么会是妖精！！（不施点手段，还当我没能耐，你以为那破照妖镜还能有用吗？）' },
    [44] = { 头像 = 0, 结束 = false, 台词 = '哼哼，妖精，任你妖法通天，还是逃不出我的手掌心，看打！！' },
    --战斗
    [45] = { 头像 = 3069, 结束 = false, 台词 = '怎…怎么可能！可恨，看我神通，解尸法！' },
    [46] = { 头像 = 0, 台词 = '又是这招！又被她跑掉了！' },
    --14

    [47] = { 头像 = 3030, 结束 = false, 台词 = '…妖精！…什么话，老头子女婿在北山锄田，女儿刚去给它们送饭，老头子出来走走，竟然被你说成妖精。我看你才像妖精。' },
    [48] = { 头像 = 0, 台词 = '真奇怪，居然乾坤八卦镜都没了反应，这妖精到底是什么成精，居然妖法这么强，再去问问太上老君那老头儿去。' },
    --15

    [49] = { 头像 = 6535, 结束 = false, 台词 = '你说什么？？乾坤八卦镜照不出妖怪的行踪，……这怎么可能。' },
    [50] = { 头像 = 0, 结束 = false, 台词 = '事实如此，老君头儿，怎么办？？' },
    [51] = { 头像 = 6535, 结束 = false, 台词 = '这……如果连乾坤八卦镜都无法找到妖精，那我也没法子了。' },
    [52] = { 头像 = 0, 台词 = '…… ……那怎么办…… ……' },
    --16

    [53] = { 头像 = 6520, 结束 = false, 台词 = '啊，是你，真巧，我正有事想拜托你。' },
    [54] = { 头像 = 0, 结束 = false, 台词 = '嫦娥姐姐？？有什么事情需要我帮忙吗？' },
    [55] = { 头像 = 6520, 结束 = false, 台词 = '是……那是……' },
    [56] = { 头像 = 0, 结束 = false, 台词 = '嫦娥姐姐怎么突然害羞起来了。' },
    [57] = { 头像 = 6520, 结束 = false, 台词 = '是…我想请你帮我把这个小东西…带给天蓬……' },
    [58] = { 头像 = 0, 结束 = false, 台词 = '这…是？？？' },
    [59] = { 头像 = 6520, 结束 = false, 台词 = '我…我想让天蓬…知道我的心……但是，我身在月宫，不能私下凡间所以……' },
    [60] = { 头像 = 0, 台词 = '嘻嘻，嫦娥姐姐这有什么好害羞的，你放心吧，我一定帮你带给那个猪头，嘻嘻。' },
    --17

    [61] = { 头像 = 2091, 结束 = false, 台词 = '这……这是嫦娥给我的？？？' },
    [62] = { 头像 = 0, 结束 = false, 台词 = '是啊，想不到你这猪头，居然还真能得到嫦娥仙子的心。' },
    [63] = { 头像 = 2091, 结束 = false, 台词 = '真…是…真是…你能帮我带封回信给她吗？？拜托你，只有你能帮我了。' },
    [64] = { 头像 = 0, 台词 = '受不了你，不用这么肉麻吧，冲着嫦娥仙子，我也会帮你们的啦。' },
    --18

    [65] = { 头像 = 6520, 结束 = false, 台词 = '天蓬的回信？？……真是太感谢了……' },
    [66] = { 头像 = 0, 结束 = false, 台词 = '哈哈，仙子不用多礼，我大功告成，也可以告辞了。' },
    [67] = { 头像 = 6520, 结束 = false, 台词 = '请…请等一下，我看你行色匆匆，是有什么要紧事办吗？' },
    [68] = { 头像 = 0, 结束 = false, 台词 = '是啊，白骨山有一个妖精，精于变化潜藏之术，我用照妖镜和乾坤八卦镜找了它两次，都被它逃掉了。现在正想其他的办法找它呢。' },
    [69] = { 头像 = 6520, 结束 = false, 台词 = '这样…那……请把这个东西拿去吧，也许…有些用……' },
    [70] = { 头像 = 0, 结束 = false, 台词 = '这是……？？' },
    [71] = { 头像 = 6520, 结束 = false, 台词 = '这是#R清心玉明镜#W。' },
    [72] = { 头像 = 0, 结束 = false, 台词 = '#R清心玉明镜#W？广寒宫至宝，可以照出生灵本心的清心玉明镜？？' },
    [73] = { 头像 = 6520, 结束 = false, 台词 = '是的，也许……它可以帮你找到妖怪的形迹。' },
    [74] = { 头像 = 0, 台词 = '对呀，我怎么没想到呢，找到本心，也就找到妖怪了嘛。真…是……太感谢你了仙子。' },
    --19

    [75] = { 头像 = 3030, 结束 = false, 台词 = '妖…妖精！！……什么话老头子女婿在北山锄田，女儿刚去给它们送饭，老头子出来走走，竟然被你说成妖精。我看你才像妖精。（哼，可恶，我就不信这次你还能看出我来）' },
    [76] = { 头像 = 0, 结束 = false, 台词 = '妖精，邪不胜正，随你变化多端，也逃不过这一次，看招！' },
    [77] = { 头像 = 3030, 结束 = false, 台词 = '这……居然还能找到我，我和你拼了！' },
    --战斗
    [78] = { 头像 = 3030, 结束 = false, 台词 = '（啊！！要不是白骨仙分走了我一半法力，哪会怕你这些小小修真仙，可恨的白骨仙，总有一天我要让你为此后悔。）我不是你的对手，可你也未必找得到我，哼！！' },
    [79] = { 头像 = 0, 台词 = '嗯，这妖精……居然知道白骨仙，怎么回事？？去问问土地去，他也许知道。' },
    --20

    [80] = { 头像 = 3070, 结束 = false, 台词 = '唉，是的，其实，这妖怪应该算是白骨仙的姐妹。' },
    [81] = { 头像 = 0, 结束 = false, 台词 = '啊……？？？……这是怎么回事？？' },
    [82] = { 头像 = 3070, 结束 = false, 台词 = '这白骨山中有个白骨洞，当年天地纯阴之气在洞中借白骨成形，化为白骨仙，同时还生出一个粉骷髅来。' },
    [83] = { 头像 = 0, 结束 = false, 台词 = '粉骷髅？？' },
    [84] = { 头像 = 3070, 结束 = false, 台词 = '对，这粉骷髅分走了白骨仙的阴气，但因为阴气微弱，因此在洞中受日月精华，数千年后才成人形。而这时……白骨仙早已经和孙悟空在三界之间闹得天翻地覆。' },
    [85] = { 头像 = 0, 结束 = false, 台词 = '原来是这样…难怪这妖精对白骨仙怨恨不已，那白骨洞在哪里？' },
    [86] = { 头像 = 3070, 结束 = false, 台词 = '那白骨洞自这妖精成形后便被妖精的纯阴妖气遮蔽起来，谁也不知所在。小老儿我想，要破除这妖气，需得去找白骨仙才行。' },
    [87] = { 头像 = 0, 台词 = '好，那我就再去凤巢走一趟。' },
    --21
    [88] = { 头像 = 2080, 结束 = false, 台词 = '是你，我感谢你解脱了孙悟空，这样哪怕我的肉身在这里受前熬，我的心里也好受得多。今天来找我有什么事吗？' },
    [89] = { 头像 = 0, 结束 = false, 台词 = '我今天来找你，是想问问你，知道粉骷髅吗？' },
    [90] = { 头像 = 2080, 结束 = false, 台词 = '啊……粉骷髅…你…' },
    [91] = { 头像 = 0, 结束 = false, 台词 = '是的，她在白骨山为害众生，我因为破不了她的纯阴妖气，所以来寻求你的帮助。' },
    [92] = { 头像 = 2080, 结束 = false, 台词 = '是因为我……她才变成妖的，如果当年我能多分给她一些纯阴之气，也许……她不会变成这样……' },
    [93] = { 头像 = 0, 结束 = false, 台词 = '但是……' },
    [94] = { 头像 = 2080, 台词 = '我明白…你是想知道怎么破解遮蔽白骨洞的纯阴妖气吧，这是我的头钗，上面附有我的纯阴妖气，你只要拿着它，就可以进到那洞中了。' },
    --22

    [95] = { 头像 = 2080, 台词 = '这头钗，是那个贱人，我知道了，一定是那个贱人给你的，让你来消灭我是吧。哼，那个贱人，果然…我不会让她如愿的，你别以为我怕了你，谁死谁活还不知道呢！！' },
    --战斗
}

function 任务:取对话(玩家)
    local r = _台词[self.对话进度]
    local 台词, 头像, 结束 = r.台词, r.头像, r.结束
    if 头像 == 0 then
        头像 = 玩家.原形
    end
    return 台词, 头像, 结束
end

function 任务:任务NPC对话(玩家, NPC)
    -- self.进度 = 8
    -- self.对话进度 = 23
    if not 玩家:剧情称谓是否存在(13) then
        return
    end

    NPC.队伍对话 = true
    if NPC.名称 == '五指山土地' then
        if self.进度 == 0 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 4 then
                self.进度 = 1
            end
        end
    elseif NPC.名称 == '白骨山土地' then
        if self.进度 == 1 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 11 then
                self.进度 = 2
            end
        elseif self.进度 == 5 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 18 then
                self.进度 = 6
            end
        elseif self.进度 == 21 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 87 then
                self.进度 = 22
            end
        end
    elseif NPC.名称 == '小白' then
        if self.进度 == 22 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 94 then
                local 添加物品 = 玩家:添加物品({ 生成物品 { 名称 = '白骨仙的头钗', 数量 = 1, 禁止交易 = true } })
                if 添加物品 then
                    self.进度 = 23
                else
                    NPC.台词 = '你背包满了，清理一下再来找我'
                    self.对话进度 = self.对话进度 - 1
                end
            end
        end
    elseif NPC.名称 == '女子' then
        if self.进度 == 2 then
            self.进度 = 3
            self.对话进度 = 12
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
        elseif self.进度 == 8 then
            if self.对话进度 >= 26 then
                self.对话进度 = 24
            end
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 26 then
                self:任务攻击事件(玩家, NPC)
            end
        elseif self.进度 == 9 then
            if self.对话进度 < 28 then
                self.对话进度 = self.对话进度 + 1
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            end
        end
    elseif NPC.名称 == '老妇人' then
        if self.进度 == 3 then
            self.进度 = 4
            self.对话进度 = 13
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
        elseif self.进度 == 9 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 30 then
                self.进度 = 10
            end
        elseif self.进度 == 14 then
            if self.对话进度 >= 44 then
                self.对话进度 = 42
            end
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 44 then
                self:任务攻击事件(玩家, NPC)
            end
        elseif self.进度 == 15 then
            if self.对话进度 < 46 then
                self.对话进度 = self.对话进度 + 1
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            end
        end
    elseif NPC.名称 == '老头' then
        if self.进度 == 4 then
            self.进度 = 5
            self.对话进度 = 14
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
        elseif self.进度 == 10 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 32 then
                self.进度 = 11
            end
        elseif self.进度 == 15 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 48 then
                self.进度 = 16
            end
        elseif self.进度 == 20 then
            if self.对话进度 >= 77 then
                self.对话进度 = 74
            end
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 77 then
                self:任务攻击事件(玩家, NPC)
            end
        elseif self.进度 == 21 then
            if self.对话进度 < 79 then
                self.对话进度 = self.对话进度 + 1
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            end
        end
    elseif NPC.名称 == '李靖' then
        if self.进度 == 6 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 22 then
                self.进度 = 7
            end
        elseif self.进度 == 11 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 37 then
                self.进度 = 12
            end
        end
    elseif NPC.名称 == '太上老君' then
        if self.进度 == 12 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 40 then
                self.进度 = 13
            end
        elseif self.进度 == 14 then
            if self.对话进度 < 42 then
                self.对话进度 = self.对话进度 + 1
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                if self.对话进度 == 42 then
                    local 添加物品 = 玩家:添加物品({ 生成物品 { 名称 = '乾坤八卦镜', 数量 = 1, 禁止交易 = true } })
                    if not 添加物品 then
                        NPC.台词 = '你背包满了，清理一下再来找我'
                        self.对话进度 = self.对话进度 - 1
                    end
                end
            end
        elseif self.进度 == 16 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 52 then
                self.进度 = 17
            end
        end
    elseif NPC.名称 == '嫦娥' then
        if self.进度 == 17 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 60 then
                local 添加物品 = 玩家:添加物品({ 生成物品 { 名称 = '嫦娥的饰物', 数量 = 1, 禁止交易 = true } })
                if 添加物品 then
                    self.进度 = 18
                else
                    NPC.台词 = '你背包满了，清理一下再来找我'
                    self.对话进度 = self.对话进度 - 1
                end
            end
        elseif self.进度 == 20 then
            if self.对话进度 < 74 then
                self.对话进度 = self.对话进度 + 1
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                if self.对话进度 == 71 then
                    local 添加物品 = 玩家:添加物品({ 生成物品 { 名称 = '清心玉明镜', 数量 = 1, 禁止交易 = true } })
                    if not 添加物品 then
                        NPC.台词 = '你背包满了，清理一下再来找我'
                        self.对话进度 = self.对话进度 - 1
                    end
                end
            end
        end
    elseif NPC.名称 == '猪八戒' then
        if self.进度 == 19 then
            if self.对话进度 < 64 then
                self.对话进度 = self.对话进度 + 1
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                if self.对话进度 == 64 then
                    local 添加物品 = 玩家:添加物品({ 生成物品 { 名称 = '八戒的情书', 数量 = 1, 禁止交易 = true } })
                    if not 添加物品 then
                        NPC.台词 = '你背包满了，清理一下再来找我'
                        self.对话进度 = self.对话进度 - 1
                    end
                end
            end
        end
    elseif NPC.名称 == '白骨精' then
        if self.进度 == 23 then
            self.对话进度 = 95
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            self:任务攻击事件(玩家, NPC)
        end
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
end

function 任务:完成(玩家)
    self.对话进度 = 95
    玩家:添加声望(2000)
    玩家:添加经验(980000)
    玩家:添加师贡(60000)
    玩家:常规提示('#Y你得到了980000点经验和60000两师贡。')
    玩家:常规提示('#Y你完成取经任务又一关，三打白骨精，你的声望增加了2000点。')
    local r = 玩家:取任务('引导_称谓剧情')
    if r then
        r:检测剧情称谓是否完成(玩家, 14, '白骨精')
    end
    self:删除()
end

function 任务:任务NPC给予(玩家, NPC, cash, items)
    NPC.队伍给予 = true
    if NPC.名称 == '太上老君' then
        if self.进度 == 13 then
            if items[1] and items[1].数量 >= 1 then
                if items[1].名称 == '青月灵草' then
                    items[1]:接受(1)
                    self.寻物.青月灵草 = 1
                    if self.寻物.火凤之睛 == 1 then
                        self.进度 = 14
                        self.对话进度 = 41
                        NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                    end
                elseif items[1].名称 == '火凤之睛' then
                    items[1]:接受(1)
                    self.寻物.火凤之睛 = 1
                    if self.寻物.青月灵草 == 1 then
                        self.进度 = 14
                        self.对话进度 = 41
                        NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                    end
                end
            end
        end
    elseif NPC.名称 == '猪八戒' then
        if self.进度 == 18 then
            if items[1] and items[1].名称 == '嫦娥的饰物' then
                if items[1].数量 >= 1 then
                    items[1]:接受(1)
                    self.进度 = 19
                    self.对话进度 = 61
                    NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                end
            end
        end
    elseif NPC.名称 == '嫦娥' then
        if self.进度 == 19 then
            if items[1] and items[1].名称 == '八戒的情书' then
                if items[1].数量 >= 1 then
                    items[1]:接受(1)
                    self.进度 = 20
                    self.对话进度 = 65
                    NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                end
            end
        end
    end
end

function 任务:击杀疯牛怪(玩家)
    if 玩家:添加物品({ 生成物品 { 名称 = '照妖镜', 数量 = 1, 禁止交易 = true } }) then
        self.进度 = 8
        self.对话进度 = 23
        玩家:添加经验(9800000)
        玩家:添加师贡(60000)
        玩家:常规提示('#Y你得到3300000点经验，75000两师贡和照妖镜。')
    end
end

function 任务:击杀女子(玩家)
    self.进度 = 9
    self.对话进度 = 27
    玩家:添加经验(4851000)
    玩家:添加师贡(10000)
    玩家:常规提示('#Y你得到4851000点经验，10000两师贡。')
end

function 任务:击杀老妇人(玩家)
    self.进度 = 15
    self.对话进度 = 45
    玩家:添加经验(4817400)
    玩家:添加师贡(10000)
    玩家:常规提示('#Y你得到4817400点经验，10000两师贡。')
end

function 任务:击杀老头(玩家)
    self.进度 = 21
    self.对话进度 = 78
    玩家:添加经验(51823)
    玩家:添加师贡(10000)
    玩家:常规提示('#Y你得到51823点经验，10000两师贡。')
end

function 任务:任务攻击事件(玩家, NPC)
    if NPC.名称 == '疯牛怪' then
        if self.进度 == 7 then
            local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓14_三打白骨精.lua', 1)
            if r then
                for _, v in 玩家:遍历队伍(玩家) do
                    local 任务 = v:取任务(self.名称)
                    if 任务 and 任务.进度 == 7 then
                        local 添加物品 = v:添加物品({ 生成物品 { 名称 = '照妖镜', 数量 = 1, 禁止交易 = true } })
                        if 添加物品 then
                            任务.进度 = 8
                            任务.对话进度 = 23
                            v:添加经验银子(3300000, 75000)
                            NPC.台词, NPC.头像, NPC.结束 = 任务:取对话(v)
                            v:最后对话(NPC.台词, NPC.头像, NPC.nid, NPC.结束)
                        end
                    end
                end
            end
        end
    elseif NPC.名称 == '女子' then
        if self.进度 == 8 then
            local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓14_三打白骨精.lua', 2)
            if r then
                if r then
                    for _, v in 玩家:遍历队伍(玩家) do
                        local 任务 = v:取任务(self.名称)
                        if 任务 and 任务.进度 == 8 then
                            任务.进度 = 9
                            任务.对话进度 = 27
                            NPC.台词, NPC.头像, NPC.结束 = 任务:取对话(v)
                            v:重新对话(NPC.nid, NPC.台词, NPC.头像, NPC.结束)
                        end
                    end
                end
            end
        end
    elseif NPC.名称 == '老妇人' then
        if self.进度 == 14 then
            local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓14_三打白骨精.lua', 3)
            if r then
                if r then
                    for _, v in 玩家:遍历队伍(玩家) do
                        local 任务 = v:取任务(self.名称)
                        if 任务 and 任务.进度 == 14 then
                            任务.进度 = 15
                            任务.对话进度 = 45
                            NPC.台词, NPC.头像, NPC.结束 = 任务:取对话(v)
                            v:重新对话(NPC.nid, NPC.台词, NPC.头像, NPC.结束)
                        end
                    end
                end
            end
        end
    elseif NPC.名称 == '老头' then
        if self.进度 == 20 then
            local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓14_三打白骨精.lua', 4)
            if r then
                if r then
                    for _, v in 玩家:遍历队伍(玩家) do
                        local 任务 = v:取任务(self.名称)
                        if 任务 and 任务.进度 == 20 then
                            任务.进度 = 21
                            任务.对话进度 = 78
                            NPC.台词, NPC.头像, NPC.结束 = 任务:取对话(v)
                            v:重新对话(NPC.nid, NPC.台词, NPC.头像, NPC.结束)
                        end
                    end
                end
            end
        end
    elseif NPC.名称 == '白骨精' then
        if self.进度 == 23 then
            local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓14_三打白骨精.lua', 5)
            if r then
                if r then
                    for _, v in 玩家:遍历队伍(玩家) do
                        local 任务 = v:取任务(self.名称)
                        if 任务 and 任务.进度 == 23 then
                            任务:完成(v)
                            任务.对话进度 = 95
                            v:添加经验银子(9800000, 60000)
                            NPC.台词, NPC.头像, NPC.结束 = 任务:取对话(v)
                            v:重新对话(NPC.nid, NPC.台词, NPC.头像, NPC.结束)
                        end
                    end
                end
            end
        end
    end
end

local _怪物 = {

    {
        名称 = "疯牛怪",
        等级 = 160,
        外形 = 2052,
        气血 = 1350000,
        魔法 = 12000,
        攻击 = 50000,
        速度 = 550,
        进度 = 7,
        是否消失 = false,
        抗性 = {
            抗震慑 = 30,
            抗混乱 = 100,
            抗封印 = 80,
            抗昏睡 = 100,
            物理吸收 = 70,

        },
        技能 = {

        }
    },

    {
        名称 = "白骨化身",
        等级 = 160,
        外形 = 2080,
        气血 = 720000,
        魔法 = 12000,
        攻击 = 40000,
        速度 = 600,
        进度 = 8,
        是否消失 = false,
        抗性 = {
            抗震慑 = 30,
            抗混乱 = 100,
            抗封印 = 80,
            抗昏睡 = 100,
            物理吸收 = 70,

        },
        技能 = {
            { 名称 = "含情脉脉", 熟练度 = 13000 },
            { 名称 = "万毒攻心", 熟练度 = 13000 },
        }
    },


    {
        名称 = "白骨化身",
        等级 = 160,
        外形 = 2080,
        气血 = 720000,
        魔法 = 12000,
        攻击 = 40000,
        速度 = 600,
        进度 = 14,
        是否消失 = false,
        抗性 = {
            抗震慑 = 30,
            抗混乱 = 100,
            抗封印 = 80,
            抗昏睡 = 100,
            物理吸收 = 70,

        },
        技能 = {
            { 名称 = "含情脉脉", 熟练度 = 13000 },
            { 名称 = "万毒攻心", 熟练度 = 13000 },
        }
    },

    {
        名称 = "白骨化身",
        等级 = 160,
        外形 = 2080,
        气血 = 720000,
        魔法 = 12000,
        攻击 = 40000,
        速度 = 600,
        进度 = 20,
        是否消失 = false,
        抗性 = {
            抗震慑 = 30,
            抗混乱 = 100,
            抗封印 = 80,
            抗昏睡 = 100,
            物理吸收 = 70,

        },
        技能 = {
            { 名称 = "含情脉脉", 熟练度 = 13000 },
            { 名称 = "万毒攻心", 熟练度 = 13000 },
        }
    },











    {
        名称 = "白骨真身",
        等级 = 160,
        外形 = 2080,
        气血 = 1550000,
        魔法 = 12000,
        攻击 = 40000,
        速度 = 600,
        进度 = 23,
        是否消失 = false,
        抗性 = {
            抗震慑 = 30,
            抗混乱 = 100,
            抗封印 = 80,
            抗昏睡 = 100,
            物理吸收 = 70,

        },
        技能 = {
            { 名称 = "含情脉脉", 熟练度 = 13000 },
            { 名称 = "万毒攻心", 熟练度 = 13000 },
        }
    },












}


local _小怪 = {

    [1] = {
        名称 = "牛妖",
        等级 = 160,
        外形 = 2066,
        气血 = 400000,
        魔法 = 12000,
        攻击 = 20000,
        速度 = 550,
        是否消失 = false,
        抗性 = {
            抗震慑 = 30,
            抗混乱 = 100,
            抗封印 = 80,
            抗昏睡 = 100,
            物理吸收 = 70,

        },
        技能 = {
            { 名称 = "魔神附身", 熟练度 = 13000 },
        }
    },


    [5] = {
        名称 = "怨毒之火",
        等级 = 160,
        外形 = 2103,
        气血 = 600000,
        魔法 = 12000,
        攻击 = 30000,
        速度 = 550,
        是否消失 = false,
        抗性 = {
            抗震慑 = 30,
            抗混乱 = 100,
            抗封印 = 80,
            抗昏睡 = 100,
            物理吸收 = 70,

        },
        技能 = {
            { 名称 = "天诛地灭", 熟练度 = 13000 },
            { 名称 = "九阴纯火", 熟练度 = 13000 },
        }
    },








}
local _数量 = { 7, 0, 0, 0, 9 }


function 任务:战斗初始化(玩家, i)
    local r = 生成战斗怪物(_怪物[i])
    self:加入敌方(1, r)
    if i == 1 or i == 5 then
        for n = 1, _数量[i], 1 do
            r = 生成战斗怪物(_小怪[i])
            self:加入敌方(n + 1, r)
        end
    end
end

function 任务:战斗回合开始(dt)
    -- local z = self:取对象(1)
    -- if z then
    --     z.物理吸收 = 99999999
    --     z.抗火 = 99999999
    --     z.攻击 = 99999999
    -- end
end

function 任务:战斗结束(s)
    if s then
        local zg = self:取对象(101)
        if zg then
            for _, v in self:遍历我方() do
                if v.是否玩家 then
                    local r = v.对象.接口:取任务("称谓14_三打白骨精")
                    if r then
                        if r.进度 == 7 and zg.进度 == 7 then
                            r:击杀疯牛怪(v.对象.接口)
                        elseif r.进度 == 8 and zg.进度 == 8 then
                            r:击杀女子(v.对象.接口)
                        elseif r.进度 == 14 and zg.进度 == 14 then
                            r:击杀老妇人(v.对象.接口)
                        elseif r.进度 == 20 and zg.进度 == 20 then
                            r:击杀老头(v.对象.接口)
                        elseif r.进度 == 23 and zg.进度 == 23 then
                            r:完成(v.对象.接口)
                        end
                    end
                end
            end
        end
    end
end

return 任务
