local 任务 = {
    名称 = '称谓13_偷吃人参果',
    别名 = '(十三称)偷吃人参果',
    类型 = '称谓剧情',
    是否可取消 = false
}

function 任务:任务初始化(玩家, ...)
    self.瞌睡 = { 清风 = 0, 明月 = 0 }
    self.归还 = { 清风 = 0, 明月 = 0 }
end

function 任务:任务上线(玩家)
end

function 任务:任务更新(玩家, sec)
end

local _详情 = {
    '你可以完成第十三个称谓剧情任务了，任务领取人#Y五庄观#G#u#[1146|80|60|$明月#]#u',
    '要了解人参果的秘密，去找#G#u#[1001|174|184|$袁天罡#]#u#W想想办法。',
    '去大唐边境捕捉一只毒蜂后再来找#G#u#[1001|174|184|$袁天罡#]#u#W，袁天罡会把你变成毒蜂的那个样子，这样你就可以偷听人参果的秘密了。',
    '变成蜜蜂，去偷听两个道童#G#u#[1146|73|65|$清风#]#u#W和#G#u#[1146|80|60|$明月#]#u#W说话。',
    '去找#G#u#[1111|14|15|$南天王#]#u#W要瞌睡虫。',
    '快去找南天王的化身--#G王五#Y（化身可能在四圣庄、万寿山、白骨山）',
    '到天宫找#G#u#[1111|14|15|$南天王#]#u#W要瞌睡虫。',
    '瞌睡虫到手了，金击子和丹盘有着落了。#Y（找到两个道童#G#u#[1146|73|65|$清风#]#u#Y和#G#u#[1146|80|60|$明月#]#u#Y，#Y分别对他们使用瞌睡虫，#R ALT+G给予瞌睡虫给他们。#Y）',
    '得到金击子和丹盘了，去找到#G#u#[101379|27|26|$人参果树#]#u#W拿人参果吧。',
    '奇怪，人参果怎么不见了，问问这里的#G#u#[1146|5|52|$人参果园土地#]#u#W。',
    '再找到#G#u#[101379|27|26|$人参果树#]#u#W试试拿次人参果。',
    '人参果到手了，嘿嘿，把金击子和丹盘还给#G#u#[1146|73|65|$清风#]#u#W和#G#u#[1146|80|60|$明月#]#u#W吧。#Y( ALT+G将金击子和丹盘分别给子清风、明月)',
    '可恶，两个小道重居然恶语相向，好，推倒#G#u#[101379|27|26|$人参果树#]#u#W，大家一拍两散。#R（与人参果树对话结束后直接进入战斗！）',
    '去问问#G#u#[1001|174|184|$袁天罡#]#u#W有没什么办法医治人参果树。',
    '去找#G#u#[1236|182|49|$灵兽仙#]#u#W打听下医治人参果树的法子。',
    '去看看#G#u#[1141|22|12|$观音姐姐#]#u#W有没办法医治人参果树。',
    '终于可以医治#G#u#[101379|27|26|$人参果树#]#u#W了，赶紧回五庄观吧。#Y(ALT+G将净瓶给予人参果树) ',
    '人参果树已经医好了，去找#G#u#[1147|21|17|$镇元大仙#]#u#W聊聊。'
}

function 任务:任务取详情(玩家)
    return _详情[self.进度 + 1]
end

local _台词 = {
    [1] = { 头像 = 3044, 结束 = false, 台词 = '喂，清风，听说过些日子有取经人来。中，师父要我们用人参果款待他是佛家，我们是道家，素无往来，为什么要这么厚重款待呢？' },
    [2] = { 头像 = 3044, 结束 = false, 台词 = '你不知道，我听师父说，那取经人乃是如来弟子金禅子转世，那金禅子前世在讲经会和师父有奉茶之谊，所以如此款待也不为过。' },
    [3] = { 头像 = 3044, 结束 = false, 台词 = '哦，是这样啊，我就说么，人参果如此珍贵之物，怎么会拿给一个外人享用。' },
    [4] = { 头像 = 3044, 结束 = false, 台词 = '嘘，有人来了……别让外人听去了这宝物的秘密。' },
    [5] = { 头像 = 0, 结束 = false, 台词 = '嗯？？这两个小道童刚才似乎在说什么人参果……听说那是道家至宝…且听听看……' },
    [6] = { 头像 = 0, 结束 = false, 台词 = '嗯，看来我在这里的话，那两个小道童是不会再说了，怎么办才好呢？？' },
    [7] = { 头像 = 0, 台词 = '对了，同为道家，去问问袁天罡那老头儿，看他知不知道。' },
    --0

    [8] = { 头像 = 3056, 结束 = false, 台词 = '什么，你…你想知道人参果的事…这…' },
    [9] = { 头像 = 0, 结束 = false, 台词 = '老头儿，同为道家修行之人，你可别说你不知道呀。' },
    [10] = { 头像 = 3056, 结束 = false, 台词 = '这…哎呀，实话告诉你吧，那人参果是镇元大仙之物，他是地仙之祖，神通广大，我可惹不起他，你要我告诉你人参果之事，免谈，免谈！' },
    [11] = { 头像 = 0, 结束 = false, 台词 = '喂，老头儿，解决孙悟空的事情，你可欠了我不少人情债哟，这样吧，我也不强要你告诉我，你帮我摆平那两个小道童就行了。' },
    [12] = { 头像 = 3056, 结束 = false, 台词 = '罢了罢了，就算还你个人情，你非五庄观之人，这样去听清风明月说话，当然不妥，如果变成野物……' },
    [13] = { 头像 = 0, 台词 = '对呀，我怎么没想到，老头儿，我真是服了你了，你等着，我这就去找个野物来，你就略施小法，把我变成那个样子吧，嘻嘻。' },
    --1

    [14] = { 头像 = 0, 结束 = false, 台词 = '怎么样，老头儿，变成蜜蜂，该没有问题了吧。' },
    [15] = { 头像 = 3056, 结束 = false, 台词 = '嗯好，我在你身上施下幻化之术，你就以蜜蜂之形去五庄观吧，呵呵，不过这幻化之术在你听完他们谈话之后就会自动除去，将来地仙问起来，我可不知道呦。' },
    [16] = { 头像 = 0, 台词 = '这老袁，这么怕事…' },
    --2

    [17] = { 头像 = 3044, 结束 = false, 台词 = '清风，这下没有外人在，说说也不打紧吧，那人参果还是，上次兰盆会时尝过一份，如果能吃到一个……' },
    [18] = { 头像 = 3044, 结束 = false, 台词 = '别胡思乱想，如果被师父知道，又会责罚你了，到时师兄可保不住你，你也不想想，那人参果三千年一开花，三千年一结果，还得一万年才能吃对我辈修行之人有莫大好处，是那么容易吃得到的么？' },
    [19] = { 头像 = 0, 结束 = false, 台词 = '哇塞，人参果功效这么好……在听听！' },
    [20] = { 头像 = 3044, 结束 = false, 台词 = '唉，所以说嘛，想想真是懊丧啊，那人参果和五行相克，遇金而落，遇木而枯，遇水而化，遇火而焦，遇土而入，只有用金击子和丹盘才能得下可是这两样东西虽然就在咱们身上，咱们却吃不到。' },
    [21] = { 头像 = 0, 结束 = false, 台词 = '取果用的金击子和丹盘在这两个小道童身上啊，有什么办法可以搞到呢？？' },
    [22] = { 头像 = 3044, 结束 = false, 台词 = '好啦好啦，别说啦，我辈修真之人，不可妄动这些嗔念。' },
    [23] = { 头像 = 0, 台词 = '嗯，对付这两个小道童，还是不能来硬的，对了，好象南天王那里有瞌睡虫这种东西，嘻嘻，大用场大用场。' },
    --3

    [24] = { 头像 = 0, 结束 = false, 台词 = '天王好久不见啦，近来可好？？' },
    [25] = { 头像 = 3063, 结束 = false, 台词 = '哦，是你呀，听说去灵山修行了，今日怎么有空到此呢？' },
    [26] = { 头像 = 0, 结束 = false, 台词 = '呵呵，今天我是冲着天王你的上后#R瞌睡虫#W来的。' },
    [27] = { 头像 = 3063, 结束 = false, 台词 = '瞌睡虫？？你又想干什么？？那是在天外天出现的怪虫，只要爬进七窍，就可以让人立刻昏睡不醒，哪怕大罗金仙，也没法避免，而且机敏非常，稍有异动就会逃窜无宗，本王侥幸凭变化之术捉得两只，可不能随便给人。' },
    [28] = { 头像 = 0, 结束 = false, 台词 = '这……（居然堵我的口，可恶啊），不会一点商量都没有吧？' },
    [29] = { 头像 = 3063, 结束 = false, 台词 = '绝对不行，没得商量。' },
    [30] = { 头像 = 0, 结束 = false, 台词 = '（看来不用点手段还不行）天王说凭变化之术捉得瞌睡虫的？' },
    [31] = { 头像 = 3063, 结束 = false, 台词 = '那当然，天宫变化之术，就算是杨戬，也未必胜得过本王。' },
    [32] = { 头像 = 0, 结束 = false, 台词 = '嘿嘿，我看不见得，还不要说孙悟空的火眼金睛，就是我最近修炼的辩识之术，也绝对可以轻松识破天王化身。' },
    [33] = { 头像 = 3063, 结束 = false, 台词 = '绝不可能！！' },
    [34] = { 头像 = 0, 结束 = false, 台词 = '天王要不要来和我比试一场？？' },
    [35] = { 头像 = 3063, 结束 = false, 台词 = '比试？？如何比试？？' },
    [36] = { 头像 = 0, 结束 = false, 台词 = '天王尽可以幻化分身，我们寻找为准，如果到时我找不出天王化身，就算我输了。' },
    [37] = { 头像 = 3063, 结束 = false, 台词 = '好，如果你能找出来，本王就算输！！' },
    [38] = { 头像 = 0, 结束 = false, 台词 = '嘿嘿，既然是赌赛，当然要个彩头，天王说是吧。' },
    [39] = { 头像 = 3063, 结束 = false, 台词 = '好，如果你能赢得了本王，瞌睡虫你就拿去！！但如果本王得胜，你就得承认本王变化之术为天宫魁首。' },
    [40] = { 头像 = 0, 台词 = '好，就这么办。（就算和他开开玩笑，不打紧吧）' },
    --4

    [41] = { 头像 = 0, 结束 = false, 台词 = '嘿嘿，天王，还是被我找到了哟。' },
    [42] = { 头像 = 3063, 台词 = '行了行了，算你赢行了吧！' },
    --5

    [43] = { 头像 = 3063, 台词 = '拿好了，给你两只瞌睡虫。' },
    --6

    [44] = { 头像 = 3044, 结束 = false, 台词 = '明月，我……我怎么突然觉得好困，呵欠~' },
    [45] = { 头像 = 0, 台词 = '哈哈，这瞌睡虫果然神效，看看这小道童身上有什么，哦，原来是金击子。' },
    [46] = { 头像 = 3044, 结束 = false, 台词 = '我怎么打起呵欠来了…好困啊…先睡一会儿…' },
    [47] = { 头像 = 0, 台词 = '连大罗金仙都无法避免，何况你了呢！' },
    --7

    [48] = { 头像 = 0, 结束 = false, 台词 = '哦，这就是人参果树？？不愧是地仙之树，枝繁叶茂，仙气萦绕啊。这树上结出的仙果必然是大助修行之物，嘻嘻，这就来享受一下。' },
    [49] = { 头像 = 3107, 结束 = false, 台词 = '你拿出金击子，敲下一个人参果，但那宝贝落在地上，跳了两跳，竟然钻入土中不见了。' },
    [50] = { 头像 = 0, 台词 = '嗯？？这是怎么回事？？人参果竟然不见了。问问这里的土地看。' },
    --8

    [51] = { 头像 = 3070, 结束 = false, 台词 = '啊，是上仙，土地恭迎来迟，上仙恕罪。' },
    [52] = { 头像 = 0, 结束 = false, 台词 = '土地公你太客气了，我有事请教你呢。' },
    [53] = { 头像 = 3070, 结束 = false, 台词 = '不知上仙有何事找土地老儿呢？' },
    [54] = { 头像 = 0, 结束 = false, 台词 = '我刚才在这树上敲下一个人参果，但是它竟然钻到土里不见了？？这是怎么回事？？' },
    [55] = { 头像 = 3070, 结束 = false, 台词 = '哦？上仙不知道吗？ 这人参果乃与地仙同生的异果，三千年一开花，三千年结果，还得再过一万年才能食用。因与五行相克，遇金而落，遇木而枯，遇水而化，遇火而焦，遇土而入，只有用玉石丹盘接住，以金击子敲击才能得下。' },
    [56] = { 头像 = 0, 台词 = '哎，对呀，我怎么这么糊涂，居然不用丹盘。嗯，再去试试看。' },
    --9

    [57] = { 头像 = 0, 结束 = false, 台词 = '好，再试试看，小心用丹盘接着，我敲……' },
    [58] = { 头像 = 3107, 结束 = false, 台词 = '一个人参果从树上坠下，落到丹盘里跳了两跳，不动了。你得到一个人参果。' },
    [59] = { 头像 = 0, 台词 = '嘻嘻，果然到手了，也不衽我这么麻烦跑几趟。嗯，既然搞到了人参果，那金击子和丹盘还是还回去吧。' },
    --11

    [60] = { 头像 = 3044, 结束 = false, 台词 = '啊，……这是我保管的金击子！！……怎么到你那里去了！！' },
    [61] = { 头像 = 3044, 结束 = false, 台词 = '…我怎么睡着了？？……丹盘怎么会在你那里？？' },
    [62] = { 头像 = 3044, 结束 = false, 台词 = '师……师兄…不好啦，我刚去查点，人参果少了两个。' },
    [63] = { 头像 = 3044, 结束 = false, 台词 = '糟糕，一定是这人施法迷量我们，偷了人参果。这下师父回来就惨啦…' },
    [64] = { 头像 = 0, 结束 = false, 台词 = '嘻嘻，区区两个果子嘛，有什么大不了？？' },
    [65] = { 头像 = 3044, 结束 = false, 台词 = '你……我把你这个害馋劳、偷嘴的偷果贼！你偷吃了我的仙果，就算是如来亲临，也脱不了关系，还在这卖弄口舌。' },
    [66] = { 头像 = 3044, 结束 = false, 台词 = '对，人参果是万年山家之物，你竟敢偷吃，还修行呢。像你这等修行之人，便是修万年，也修不到正果金身，偷果贼！！' },
    [67] = { 头像 = 0, 台词 = '（可恶，这两个小道审真是可恨，拿两个果子吃，居然敢这样出言辱骂，好！我去推倒那破树，大家一拍两散！）' },
    --12

    [68] = { 头像 = 0, 结束 = false, 台词 = '哼，就是这个破人参果树，居然害得我这么辛苦。好，两个小道童是吧，我就把这树推倒，让你们知道我的手段。' },
    [69] = { 头像 = 0, 台词 = '嗯？这树颇有灵气，似乎已经修成了通灵之身。哼，区区树灵，我还不放在眼里！！' },
    --战斗
    [70] = { 头像 = 0, 结束 = false, 台词 = '倒！！倒！！倒！！哼，推倒你这破树，看你两个小道童还敢不敢嚣张！' },
    [71] = { 头像 = 3070, 结束 = false, 台词 = '啊，……上仙，……你推倒了人参果树！！哎呀，你可闯大祸了……' },
    [72] = { 头像 = 0, 结束 = false, 台词 = '一棵破树，推倒它有什么大关系？？' },
    [73] = { 头像 = 3070, 结束 = false, 台词 = '这树可是和地仙之祖同生之物，两者素有灵犀，如今你推倒了人参果树，镇元大仙怎肯干休，他法力通天，就算是如来佛祖也要礼让三分。如…咳,你可闯大祸啦！！' },
    [74] = { 头像 = 3062, 结束 = false, 台词 = '什么人敢毁坏我的宝树！！' },
    [75] = { 头像 = 0, 结束 = false, 台词 = '哼，镇元老头，这树是我推倒的，如何？？如不是你座下童子无礼，我还未必费这番工夫。' },
    [76] = { 头像 = 3062, 结束 = false, 台词 = '混帐，捣毁我人参果树还敢猖狂，看老夫擒下你，送给如来发落。' },
    [77] = { 头像 = 0, 台词 = '哼哼，镇元大仙，你法力通天，他们怕你，我可不怕，就和你比比看，到底是谁法力高强。' },
    --战斗
    [78] = { 头像 = 3062, 结束 = false, 台词 = '好，你果然法力高强，不愧是轮回转世的修行。我也知道你的本事，也闻得你的英名，只是你今番越理欺心，纵有腾那，脱不得我手。我就和你讲到西天，见了你那佛祖，也少不得还我人参果树。' },
    [79] = { 头像 = 0, 结束 = false, 台词 = '哼，不就一棵人参果树么，给你医活还不成，何必如此大动干戈？？难道不怕犯了你千年的修行。' },
    [80] = { 头像 = 3062, 结束 = false, 台词 = '人参果树与我地仙同生，岂可等闲，你若有此神通，医得树活，我甘愿与你结为八拜之交。' },
    [81] = { 头像 = 0, 台词 = '好，咱们一言为定（话说回来，找谁帮忙呢？还是先去问问袁老头儿去。）' },
    --13

    [82] = { 头像 = 3056, 结束 = false, 台词 = '啊！！！……你居然推倒了人参果树，真……这好大的祸事啊！' },
    [83] = { 头像 = 0, 结束 = false, 台词 = '哎，这就别说了吧，我是问问你有什么办法医他的树没有？？' },
    [84] = { 头像 = 3056, 结束 = false, 台词 = '难，难，难，如果是普通的飞禽走兽，倒还好说，那人参果乃仙木之根，如何医治？没方，没方啊。' },
    [85] = { 头像 = 0, 结束 = false, 台词 = '那怎么办？？老头儿，你好歹给我想个招出来，不然我可就告诉镇元偷听说话是你的主意。' },
    [86] = { 头像 = 3056, 台词 = '啊？你这…早知道就不该帮你。洛阳的灵兽仙好象统管天下生灵，人参果虽是仙木，到底也还是万物生灵，你去问问他有没法子。他如果还没法子，我也不知道了。' },
    --14

    [87] = { 头像 = 3062, 结束 = false, 台词 = '医治人参果树？？咳，你怎么闯下这等大祸，那人参果偷吃尚且有罪，何况推倒。' },
    [88] = { 头像 = 0, 结束 = false, 台词 = '医灵兽仙你可有法子吗？？' },
    [89] = { 头像 = 3062, 结束 = false, 台词 = '那人参果树是地仙之根，我一阶兽仙能有什么法子！' },
    [90] = { 头像 = 0, 结束 = false, 台词 = '那…那可如何是好？？' },
    [91] = { 头像 = 3062, 结束 = false, 台词 = '你且别慌，我没法子，不一定别人也没法子，观音菩萨是大神通之人，为何你去问问他看？' },
    [92] = { 头像 = 0, 台词 = '对呀，我怎么忘了观音姐姐，她一定有办法救人参果树的，好，我这就去找观音姐姐去。' },
    --15

    [93] = { 头像 = 3059, 结束 = false, 台词 = '嗯，这事我已经知道了,这下你可尝到苦头了吧，以后可要切记不得再意气用事' },
    [94] = { 头像 = 0, 结束 = false, 台词 = '（有门，观音姐姐看起来有法子哦）观音姐姐有办法医治那人参果树吗？' },
    [95] = { 头像 = 3059, 结束 = false, 台词 = '我这净瓶里的甘露，善治得仙树灵苗。你把#R净瓶#W拿去，便可救那人参果树。以后可得多加注意，别再出乱子啦。' },
    [96] = { 头像 = 0, 台词 = '啊，是，谨遵观音姐姐教诲。（太好了！！）' },
    --16

    [97] = { 头像 = 3107, 结束 = false, 台词 = '观音的净瓶甘露果然神奇，只用三滴，便见人参果树又是青枝绿叶浓郁葱翠人参果挂于其上，迎风舒展。' },
    [98] = { 头像 = 0, 台词 = '……太神奇了,果然治好了，这下可以理直气壮去找镇元那老头儿啦。' },
    --17

    [99] = { 头像 = 3062, 结束 = false, 台词 = '承蒙辛苦，去请得观音菩萨净瓶甘露，救了我这果树。镇元足感盛情。' },
    [100] = { 头像 = 0, 结束 = false, 台词 = '哎……算了算了，说起来也是我不对，这里给你赔不是了。' },
    [101] = { 头像 = 3062, 结束 = false, 台词 = '知错能改，善莫大焉，既然你已经治好了果树。镇元甘愿与你结为八拜之交。' },
    [102] = { 头像 = 0, 台词 = '太好了，所谓不打不相识，这是我的荣幸。' }
}

function 任务:取对话(玩家)
    local r = _台词[self.对话进度]
    local 台词, 头像, 结束 = r.台词, r.头像, r.结束
    if 头像 == 0 then
        头像 = 玩家.原形
    end
    return 台词, 头像, 结束
end

function 任务:任务NPC对话(玩家, NPC)
    -- self.进度 = 12
    -- self.对话进度 = 68
    if not 玩家:剧情称谓是否存在(12) then
        return
    end
    NPC.队伍对话 = true
    if NPC.名称 == '明月' or NPC.名称 == '清风' then
        if self.进度 == 0 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 7 then
                self.进度 = 1
            end
        elseif self.进度 == 3 then
            if 玩家.外形 == 2033 then
                self.对话进度 = self.对话进度 + 1
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                if self.对话进度 == 23 then
                    self:清除变身(玩家)
                    self.进度 = 4
                end
            end
        elseif self.进度 == 7 then
            if self.对话进度 == 44 or self.对话进度 == 46 then
                self.对话进度 = self.对话进度 + 1
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            end
            if self.瞌睡.清风 == 1 and self.瞌睡.明月 == 1 then
                self.进度 = 8
                self.对话进度 = 47
            end
        elseif self.进度 == 12 then
            if self.对话进度 < 67 then
                self.对话进度 = self.对话进度 + 1
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            end
        end
    elseif NPC.名称 == '袁天罡' then
        if self.进度 == 1 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 13 then
                self.进度 = 2
            end
        elseif self.进度 == 2 then
            if self:检查毒蜂(玩家) then
                self.对话进度 = self.对话进度 + 1
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                if self.对话进度 == 16 then
                    self:变身毒蜂(玩家)
                    self.进度 = 3
                end
            end
        elseif self.进度 == 13 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 86 then
                self.进度 = 14
            end
        end
    elseif NPC.名称 == '南天王' then
        if self.进度 == 4 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 40 then
                self.进度 = 5
            end
        elseif self.进度 == 6 then
            local 添加物品 = 玩家:添加物品({ 生成物品 { 名称 = '瞌睡虫', 数量 = 2, 禁止交易 = true } })
            if 添加物品 then
                self.进度 = 7
                self.对话进度 = 43
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            else
                NPC.台词 = '你背包满了，清理一下再来找我'
            end
        end
    elseif NPC.名称 == '王五' then
        if self.进度 == 5 then
            -- 必须是四圣庄、万寿山、白骨山刷出来的王五
            if 玩家.地图 == 101295 or 玩家.地图 == 101299 or 玩家.地图 == 101300 then
                self.对话进度 = self.对话进度 + 1
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                if self.对话进度 == 42 then
                    self.进度 = 6
                end
            end
        end
    elseif NPC.名称 == '人参果树' then
        if self.进度 == 8 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 50 then
                self.进度 = 9
            end
        elseif self.进度 == 10 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 59 then
                local 添加物品 = 玩家:添加物品({ 生成物品 { 名称 = '人参果', 数量 = 1, 禁止交易 = true } })
                if 添加物品 then
                    self.进度 = 11
                else
                    NPC.台词 = '你背包满了，清理一下再来试试'
                    self.对话进度 = self.对话进度 - 1
                end
            end
        elseif self.进度 == 12 then
            if self.对话进度 == 67 then
                self.对话进度 = 68
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            elseif self.对话进度 == 68 then
                self.对话进度 = 69
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            elseif self.对话进度 == 69 then
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                self:任务攻击事件(玩家, NPC)
            elseif self.对话进度 >= 70 and self.对话进度 < 77 then
                self.对话进度 = self.对话进度 + 1
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            elseif self.对话进度 == 77 then
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                self:任务攻击事件(玩家, NPC)
            end
        elseif self.进度 == 13 then
            if self.对话进度 < 81 then
                self.对话进度 = self.对话进度 + 1
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            end
        elseif self.进度 == 17 then
            if self.对话进度 == 97 then
                self.对话进度 = 98
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            end
        end
    elseif NPC.名称 == '人参果园土地' then
        if self.进度 == 9 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 56 then
                self.进度 = 10
            end
        end
    elseif NPC.名称 == '灵兽仙' then
        if self.进度 == 14 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 92 then
                self.进度 = 15
            end
        end
    elseif NPC.名称 == '观音姐姐' then
        if self.进度 == 15 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 96 then
                local 添加物品 = 玩家:添加物品({ 生成物品 { 名称 = '净瓶', 数量 = 1, 禁止交易 = true } })
                if 添加物品 then
                    self.进度 = 16
                else
                    NPC.台词 = '你背包满了，清理一下再来找我'
                    self.对话进度 = self.对话进度 - 1
                end
            end
        end
    elseif NPC.名称 == '镇元大仙' then
        if self.进度 == 17 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 102 then
                self:完成(玩家)
            end
        end
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
end

function 任务:检查毒蜂(玩家)
    for k, v in 玩家:遍历召唤() do
        if v.外形 == 2033 then
            return true
        end
    end
end

local _毒蜂 = {
    { name = '毒蜂', 皮肤 = 9041, 外形 = 2033, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', -2 }, { '力量', 3 }, { '速度', 4 }, { '加强毒', 4 } }, 等级 = 23, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 70, 0, 30, 0 } },
    { name = '毒蜂', 皮肤 = 9041, 外形 = 2033, 分类 = '强法', 价格 = 65000, 属性 = { { '气血', -2 }, { '力量', 3 }, { '速度', 4 }, { '躲闪率', 4 } }, 等级 = 23, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 70, 0, 30, 0 } },
    { name = '毒蜂', 皮肤 = 9041, 外形 = 2033, 分类 = '抗性', 价格 = 65000, 属性 = { { '气血', -2 }, { '力量', 3 }, { '速度', 4 }, { '抗风', 1 }, { '抗中毒', 6 } }, 等级 = 23, 亲和力 = 9, 种类 = '兽', 五行 = { 0, 70, 0, 30, 0 } },
}

function 任务:变身毒蜂(玩家)
    local r = 生成任务 { 名称 = '变身卡', 外形 = 2033 }
    r:添加任务(玩家)
end

function 任务:清除变身(玩家)
    local r = 玩家:取任务('变身卡')
    if r then
        r:删除()
    end
    玩家:刷新外形()
end

function 任务:完成(玩家)
    玩家:添加声望(200)
    玩家:常规提示('#Y你完成取经任务又一关，偷吃人参果，你的声望增加了200点。')
    local r = 玩家:取任务('引导_称谓剧情')
    if r then
        r:检测剧情称谓是否完成(玩家, 13, '偷吃')
    end
    self:删除()
end

function 任务:任务NPC给予(玩家, NPC, cash, items)
    NPC.队伍给予 = true
    if NPC.名称 == '清风' then
        if self.进度 == 7 and self.瞌睡.清风 == 0 then
            if items[1] and items[1].名称 == '瞌睡虫' then
                local 添加物品 = 玩家:添加物品({ 生成物品 { 名称 = '金击子', 数量 = 1, 禁止交易 = true } })
                if 添加物品 then
                    items[1]:接受(1)
                    self.瞌睡.清风 = 1
                    self.对话进度 = 44
                    NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                end
            end
        elseif self.进度 == 11 and self.归还.清风 == 0 then
            if items[1] and items[1].名称 == '金击子' then
                items[1]:接受(1)
                self.归还.清风 = 1
                if self.归还.清风 == 1 and self.归还.明月 == 1 then
                    self.进度 = 12
                    self.对话进度 = 60
                    NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                end
            end
        end
    elseif NPC.名称 == '明月' then
        if self.进度 == 7 and self.瞌睡.明月 == 0 then
            if items[1] and items[1].名称 == '瞌睡虫' then
                local 添加物品 = 玩家:添加物品({ 生成物品 { 名称 = '丹盘', 数量 = 1, 禁止交易 = true } })
                if 添加物品 then
                    items[1]:接受(1)
                    self.瞌睡.明月 = 1
                    self.对话进度 = 46
                    NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                end
            end
        elseif self.进度 == 11 and self.归还.明月 == 0 then
            if items[1] and items[1].名称 == '丹盘' then
                items[1]:接受(1)
                self.归还.明月 = 1
                if self.归还.清风 == 1 and self.归还.明月 == 1 then
                    self.进度 = 12
                    self.对话进度 = 60
                    NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                    return
                end
                NPC.台词 = '你什么时候取走的'
            end
        end
    elseif NPC.名称 == '人参果树' then
        if self.进度 == 16 then
            if items[1] and items[1].名称 == '净瓶' then
                items[1]:接受(1)
                self.进度 = 17
                self.对话进度 = 97
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            end
        end
    end
end

function 任务:任务攻击事件(玩家, NPC)
    if NPC.名称 == '人参果树' then
        if self.进度 == 12 and self.对话进度 == 69 then
            local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓13_偷吃人参果.lua', 1)

            if r then
                for _, v in 玩家:遍历队伍(玩家) do
                    local 任务 = v:取任务(self.名称)
                    if 任务 and 任务.进度 == 12 then
                        任务.对话进度 = 70
                        NPC.台词, NPC.头像, NPC.结束 = 任务:取对话(玩家)
                        v:最后对话(NPC.台词, NPC.头像, NPC.nid, NPC.结束)
                    end
                end
            end
        elseif self.进度 == 12 and self.对话进度 == 77 then
            local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓13_偷吃人参果.lua', 2)

            if r then
                for _, v in 玩家:遍历队伍(玩家) do
                    local 任务 = v:取任务(self.名称)
                    if 任务 and 任务.进度 == 12 then
                        任务.进度 = 13
                        任务.对话进度 = 78
                        NPC.台词, NPC.头像, NPC.结束 = 任务:取对话(v)
                        v:最后对话(NPC.台词, NPC.头像, NPC.nid, NPC.结束)
                    end
                end
            end
        end
    end
end

local _怪物 = {

    {
        名称 = "人参果树灵",
        等级 = 150,
        外形 = 2095,
        气血 = 1100000,
        魔法 = 12000,
        攻击 = 40000,
        速度 = 550,
        是否消失 = false,
        抗性 = {
            抗震慑 = 30,
            抗混乱 = 100,
            抗封印 = 80,
            抗昏睡 = 100,
            物理吸收 = 70,

        },
        技能 = {

        }
    },

    {
        名称 = "镇元大仙",
        等级 = 150,
        外形 = 0033,
        气血 = 1200000,
        魔法 = 12000,
        攻击 = 20000,
        速度 = 550,
        是否消失 = false,
        抗性 = {
            抗震慑 = 30,
            物理吸收 = 50,
            抗水 = 50,
            抗火 = 50,
            抗雷 = 50,
            抗风 = 50,

        },
        技能 = {
            { 名称 = "电闪雷鸣", 熟练度 = 13000 },
            { 名称 = "天诛地灭", 熟练度 = 13000 },
        }
    },


}


local _小怪 = {

    {
        名称 = "树枝",
        等级 = 150,
        外形 = 2010,
        气血 = 400000,
        魔法 = 12000,
        攻击 = 20000,
        速度 = 550,
        是否消失 = false,
        抗性 = {
            抗震慑 = 30,
            抗混乱 = 100,
            抗封印 = 80,
            抗昏睡 = 100,
            物理吸收 = 70,

        },
        技能 = {

        }
    },


    {
        名称 = "金刚仙",
        等级 = 150,
        外形 = 2098,
        气血 = 400000,
        魔法 = 12000,
        攻击 = 50000,
        速度 = 550,
        是否消失 = false,
        抗性 = {
            抗震慑 = 30,
            抗混乱 = 100,
            抗封印 = 80,
            抗昏睡 = 100,
            物理吸收 = 70,

        },
        技能 = {
            { 名称 = "电闪雷鸣", 熟练度 = 13000 },
            { 名称 = "天诛地灭", 熟练度 = 13000 },
        }
    },








}
local _数量 = { 5, 9 }


function 任务:战斗初始化(玩家, i)
    local r = 生成战斗怪物(_怪物[i])
    self:加入敌方(1, r)
    for n = 1, _数量[i], 1 do
        r = 生成战斗怪物(_小怪[i])
        self:加入敌方(n + 1, r)
    end
end

function 任务:战斗回合开始(dt)
end

function 任务:战斗结束(s)
end

return 任务
