local 任务 = {
    名称 = '称谓10_九生九死',
    别名 = '(十称)九生九死',
    类型 = '称谓剧情',
    是否可取消 = false
}

function 任务:任务初始化(玩家, ...)
end

function 任务:任务上线(玩家)
end

function 任务:任务更新(玩家, sec)
end

local _详情 = {
    '将金箍交给#G#u#[1183|25|55|$孙悟空#]#u#W，劝他走上取经之路。(请将金箍ALT+A给予孙悟空)',
    '和#G#u#[1183|25|55|$孙悟空#]#u#W聊聊关于九生九死的考验。',
    '去蟠桃园找#G#u#[1217|39|178|$鸿蒙老祖#]#u#W接受九生九死的考验。#Y（温馨提示：战斗考验请做好准备。）',
    '你通过了九生九死的考验，回去找#G#u#[1183|25|55|$孙悟空#]#u#W聊聊。'
}
function 任务:任务取详情(玩家)
    return _详情[self.进度 + 1]
end

local _台词 = {
    [1] = { 头像 = 2090, 台词 = '我听说你找到了我的金箍，如果你想了解#R九生九死的考验#W，就把它给我吧。' },
    --0
    [2] = { 头像 = 2090, 结束 = false, 台词 = '嘿嘿嘿，我当然知道，要想恢复我真正的力量，必须要戴上金箍，可一戴上这鬼玩意儿，就不能再留念尘世间的情欲……如来这个老小子，又设这种圈套让我钻。' },
    [3] = { 头像 = 0, 结束 = false, 台词 = '可是，观音姐姐也说了，这是唯一的解决之道。' },
    [4] = { 头像 = 2090, 结束 = false, 台词 = '什么唯一，那个女人不过是害怕惹事上身而已……这样吧，除非你能像我样通过九生九死的考验，我就答应你戴上这个金箍再保唐僧！' },
    [5] = { 头像 = 0, 结束 = false, 台词 = '一言为定，我也正想看看那个考验有多厉害，见证一下自己的实力呢。但是要怎么才能接受九生九死的考验呢？' },
    [6] = { 头像 = 2090, 结束 = false, 台词 = '你去#R蟠桃园#W找一个叫做#R鸿蒙老祖#W的仙人，他从三界创造之时就在那里了，他会给你考验的。' },
    [7] = { 头像 = 0, 台词 = '好的，我去试试这所谓的九生九死考验到底是什么！' },
    --1
    [8] = { 头像 = 2090, 结束 = false, 台词 = '一万多年来，除了我以外，你是第二个能够通过九生九死之考验的人，也许我真的应该相信你。' },
    [9] = { 头像 = 0, 结束 = false, 台词 = '你愿意戴上这金箍，保护取经人了吗？' },
    [10] = { 头像 = 2090, 结束 = false, 台词 = '我答应你，如果取经人准备好了，我会保护他去西天。但，这并不是悔悟，我只想去亲自见一见佛祖，问他一个问题。' },
    [11] = { 头像 = 0, 结束 = false, 台词 = '你想问什么？' },
    [12] = { 头像 = 2090, 结束 = false, 台词 = '我想知道：为什么出身不同的人不能相爱，为什么相爱不能相守，为什么当初的一见钟情两小无猜，需要一万年的痛苦折磨来作为代偿，为什么一万年的痛苦折磨，换来的只是悔恨和欺骗。' },
    [13] = { 头像 = 0, 结束 = false, 台词 = '…… …… ……' },
    [14] = { 头像 = 2090, 台词 = '如果天与地都不能与我公道，那我就不怕与天地为敌，与佛祖为敌。就算成为最后的大魔王，也无所畏惧，小心一点，也许我见佛的那一天，就是灭佛的那一天。' },
    --2
}

local _菜单 = [[
这一万年来除了孙悟空以外从没有人通过这九生九死之考验，你真要尝试吗？
menu
1|是，我要尝试
99|不，我再想想
]]

function 任务:取对话(玩家)
    local r = _台词[self.对话进度]
    local 台词, 头像, 结束 = r.台词, r.头像, r.结束
    if 头像 == 0 then
        头像 = 玩家.原形
    end
    return 台词, 头像, 结束
end

function 任务:任务NPC对话(玩家, NPC)
    if not 玩家:剧情称谓是否存在(9) then
        return
    end

    NPC.队伍对话 = true
    if NPC.名称 == '孙悟空' then
        if self.进度 == 0 then
            self.对话进度 = 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
        elseif self.进度 == 1 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 7 then
                self.进度 = 2
            end
        elseif self.进度 == 3 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 14 then
                self:完成(玩家)
            end
        end
    elseif NPC.名称 == '鸿蒙老祖' then
        if self.进度 == 2 then
            NPC.台词 = _菜单
        end
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if not 玩家:剧情称谓是否存在(9) then
        return
    end

    NPC.队伍菜单 = true
    if NPC.名称 == '鸿蒙老祖' then
        if self.进度 == 2 then
            if i == '1' then
                self:任务攻击事件(玩家, NPC)
            end
        end
    end
end

function 任务:完成挑战(玩家)
    self.进度 = 3
    玩家:添加经验(5520000)
    玩家:添加师贡(27000)
    玩家:常规提示('#Y你得到5520000点经验和27000两师贡')
end

function 任务:完成(玩家)
    玩家:添加声望(60000)
    玩家:常规提示('#Y你终于让孙悟空回心转意踏上了取经之路，大圣归位，你完成了这几乎不可能的任务，三界都将感谢你所做出的贡献，获得60000的声望。')
    local r = 玩家:取任务('引导_称谓剧情')
    if r then
        r:检测剧情称谓是否完成(玩家, 10, '九生九死')
    end
    self:删除()
end

function 任务:任务NPC给予(玩家, NPC, cash, items)
    NPC.队伍给予 = true
    if NPC.名称 == '孙悟空' then
        if self.进度 == 0 then
            if items[1] and items[1].名称 == '金箍' then --
                if items[1].数量 >= 1 then
                    items[1]:接受(1)
                    self.进度 = 1
                    self.对话进度 = 2
                    NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                end
            end
        end
    end
end

function 任务:任务攻击事件(玩家, NPC)
    if NPC.名称 == '鸿蒙老祖' then
        if self.进度 == 2 then
            for i = 1, 9, 1 do
                local r = 玩家:进入战斗('scripts/task/称谓剧情/称谓10_九生九死.lua', i)
                if not r then
                    break
                end
            end
        end
    end
end

local _怪物 = {
    {
        名称 = "独眼巨人",
        等级 = 110,
        外形 = 2018,
        气血 = 500000,
        魔法 = 12000,
        攻击 = 32000,
        速度 = 350,
        是否消失 = false,
        抗性 = {
            抗混乱 = 30,
            抗封印 = 15,
            抗昏睡 = 30,
            物理吸收 = 50,

        },
        技能 = {
            { 名称 = "雷神怒击", 熟练度 = 1000 },

        }
    },

    {
        名称 = "夜叉",
        等级 = 110,
        外形 = 2072,
        气血 = 500000,
        魔法 = 200000,
        攻击 = 33000,
        速度 = 350,
        是否消失 = false,
        抗性 = {
            抗混乱 = 30,
            抗封印 = 15,
            抗昏睡 = 30,
            物理吸收 = 50,

        },
        技能 = {
            { 名称 = "楚楚可怜", 熟练度 = 1000 },

        }
    },

    {
        名称 = "地狱战神",
        等级 = 110,
        外形 = 2074,
        气血 = 500000,
        魔法 = 12000,
        攻击 = 34000,
        速度 = 350,
        是否消失 = false,
        抗性 = {
            抗混乱 = 30,
            抗封印 = 15,
            抗昏睡 = 30,
            物理吸收 = 50,

        },
        技能 = {
            { 名称 = "太乙生风", 熟练度 = 1000 },

        }
    },

    {
        名称 = "巨灵神",
        等级 = 110,
        外形 = 2068,
        气血 = 5400000,
        魔法 = 12000,
        攻击 = 35000,
        速度 = 350,
        是否消失 = false,
        抗性 = {
            抗混乱 = 30,
            抗封印 = 15,
            抗昏睡 = 30,
            物理吸收 = 50,

        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 1000 },

        }
    },

    {
        名称 = "龙太子",
        等级 = 110,
        外形 = 2287,
        气血 = 560000,
        魔法 = 12000,
        攻击 = 36000,
        速度 = 350,
        是否消失 = false,
        抗性 = {
            抗混乱 = 30,
            抗封印 = 15,
            抗昏睡 = 30,
            物理吸收 = 50,

        },
        技能 = {

        }
    },

    {
        名称 = "复活女娲",
        等级 = 110,
        外形 = 2288,
        气血 = 700000,
        魔法 = 12000,
        攻击 = 40000,
        速度 = 350,
        是否消失 = false,
        抗性 = {
            抗混乱 = 30,
            抗封印 = 15,
            抗昏睡 = 30,
            物理吸收 = 50,

        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 1000 },

        }
    },

    {
        名称 = "符咒女娲",
        等级 = 110,
        外形 = 2292,
        气血 = 700000,
        魔法 = 12000,
        攻击 = 40000,
        速度 = 350,
        是否消失 = false,
        抗性 = {
            抗混乱 = 30,
            抗封印 = 15,
            抗昏睡 = 30,
            物理吸收 = 50,

        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 1000 },

        }
    },

    {
        名称 = "火神女娲",
        等级 = 110,
        外形 = 2291,
        气血 = 700000,
        魔法 = 12000,
        攻击 = 40000,
        速度 = 350,
        是否消失 = false,
        抗性 = {
            抗混乱 = 30,
            抗封印 = 15,
            抗昏睡 = 30,
            物理吸收 = 50,

        },
        技能 = {
            { 名称 = "三味真火", 熟练度 = 1000 },
            { 名称 = "谗言相加", 熟练度 = 10000 },


        }
    },
    {
        名称 = "战神女娲",
        等级 = 110,
        外形 = 2289,
        气血 = 700000,
        魔法 = 12000,
        攻击 = 40000,
        速度 = 350,
        是否消失 = false,
        抗性 = {
            抗混乱 = 30,
            抗封印 = 15,
            抗昏睡 = 30,
            物理吸收 = 70,
            连击率 = 40,
            连击次数 = 3,
            反击率 = 40,
            反击次数 = 3,

        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 1000 },
            { 名称 = "狮王之怒", 熟练度 = 1000 },

        }
    },



}

local _小怪 = {

    {
        名称 = "凤凰",
        等级 = 100,
        外形 = 2071,
        气血 = 300000,
        魔法 = 12000,
        攻击 = 20000,
        速度 = 350,
        是否消失 = false,
        抗性 = {
            抗混乱 = 30,
            抗封印 = 15,
            抗昏睡 = 30,
            物理吸收 = 50,

        },
        技能 = {
            { 名称 = "天诛地灭", 熟练度 = 1000 }
        }
    },

    {
        名称 = "神灵",
        等级 = 100,
        外形 = 2068,
        气血 = 300000,
        魔法 = 12000,
        攻击 = 20000,
        速度 = 350,
        是否消失 = false,
        抗性 = {
            抗混乱 = 30,
            抗封印 = 15,
            抗昏睡 = 30,
            物理吸收 = 50,

        },
        技能 = {
            { 名称 = "天诛地灭", 熟练度 = 1000 }
        }
    },

    {
        名称 = "蛟龙",
        等级 = 100,
        外形 = 2070,
        气血 = 300000,
        魔法 = 12000,
        攻击 = 20000,
        速度 = 350,
        是否消失 = false,
        抗性 = {
            抗混乱 = 30,
            抗封印 = 15,
            抗昏睡 = 30,
            物理吸收 = 50,

        },
        技能 = {
            { 名称 = "天诛地灭", 熟练度 = 1000 }
        }
    },
    {
        名称 = "老虎",
        等级 = 100,
        外形 = 2028,
        气血 = 300000,
        魔法 = 12000,
        攻击 = 20000,
        速度 = 350,
        是否消失 = false,
        抗性 = {
            抗混乱 = 30,
            抗封印 = 15,
            抗昏睡 = 30,
            物理吸收 = 50,
            连击率 = 40,
            连击次数 = 3,

        },
        技能 = {

        }
    },
    {
        名称 = "猴精",
        等级 = 100,
        外形 = 2060,
        气血 = 300000,
        魔法 = 12000,
        攻击 = 20000,
        速度 = 350,
        是否消失 = false,
        抗性 = {
            抗混乱 = 30,
            抗封印 = 15,
            抗昏睡 = 30,
            物理吸收 = 50,
            连击率 = 40,
            连击次数 = 3,

        },
        技能 = {

        }
    },

}





function 任务:战斗初始化(玩家, i)
    local r = 生成战斗怪物(_怪物[i])
    self:加入敌方(1, r)
    local 数量 = 玩家:取队伍人数()
    数量 = 数量 * 2
    if 数量 > 9 then
        数量 = 9
    end
    for n = 2, 数量, 1 do
        r = 生成战斗怪物(_小怪[math.random(5)])
        self:加入敌方(n, r)
    end
end

function 任务:战斗回合开始(dt)

end

function 任务:战斗结束(s)
    if s then
        local zg = self:取对象(101)
        if zg and zg.名称 == "战神女娲" then
            for _, v in self:遍历我方() do
                if v.是否玩家 then
                    local r = v.对象.接口:取任务("称谓10_九生九死")
                    if r and r.进度 == 2 then
                        r:完成挑战(v.对象.接口)
                    end
                end
            end
        end
    end
end

return 任务
