local 任务 = {
    名称 = '称谓7_玄天神鞭',
    别名 = '(七称)玄天神鞭',
    类型 = '称谓剧情',
    是否可取消 = false
}

function 任务:任务初始化(玩家, ...)
end

function 任务:任务上线(玩家)
end

function 任务:任务更新(玩家, sec)
end

local _详情 = {
    '前往#Y北俱芦洲#W找#G#u#[1174|138|139|$沙铁匠#]#u#W谈谈。',
    '去天宫问问#G#u#[1111|55|41|$李靖#]#u#W玄天铁鞭落到了那里。',
    '去狮驼岭打败#G#u#[1131|22|20|$多头神魔#]#u#W。#R（ ALT+A攻击多头神魔）',
    '解决多头神魔，回去#G#u#[1111|55|41|$李靖#]#u#W那复命。',
    '将玄天铁鞭交给#G#u#[1174|138|139|$沙铁匠#]#u#W。( 请将玄天铁鞭ALT+G给予沙铁匠)',
    '玄天铁鞭已经找回，#G#u#[1174|138|139|$沙铁匠#]#u#W有话跟你说。',
}
function 任务:任务取详情(玩家)
    return _详情[self.进度 + 1]
end

local _台词 = {
    [1] = { 头像 = 3012, 结束 = false, 台词 = '你知不知道，这世界上有一种叫做#R玄天铁鞭#W的宝贝，用它打造出来的装备能够破除仙人的金身。' },
    [2] = { 头像 = 0, 结束 = false, 台词 = '还有这么厉害的东东？' },
    [3] = { 头像 = 3012, 结束 = false, 台词 = '这是所有铁匠都在梦寐以求的东西，为了这件宝贝，我把自己的铁匠铺交给了龙天兵，而我在世界上游历不断的寻找，我终于打听到那件宝贝可能在天宫#R托塔天王#W手里的消息，不过，我是个凡人，没有办法到天言去，但我无论如何也想见那玄天铁鞭一眼。我知道你是这个世界上最神通广大的人，你能帮忙我借来一看吗？' },
    [4] = { 头像 = 0, 台词 = '好，我就帮你完成这个心愿！' },
    --0
    [5] = { 头像 = 2294, 结束 = false, 台词 = '玄天铁鞭是33层兜率天最大的秘宝，是唯一能破山人万年不破之金身的法宝。本来是不可以给你的，不过看你上次在征讨牛魔王的战役里表现不错，这样吧，#R狮驼岭的多头神魔#W触犯天条我正好要找人惩罚他，天宫目前又抽不出人手，你就先去把多头神魔给解决了再说吧。' },
    [6] = { 头像 = 0, 台词 = '晕，你是利用我当苦力吧？' },
    --1
    [7] = { 头像 = 2294, 结束 = false, 台词 = '干的不错，作为奖励，玄天铁鞭就借你一用吧！' },
    [8] = { 头像 = 0, 台词 = '多谢多谢。' },
    --3
    [9] = { 头像 = 3012, 结束 = false, 台词 = '这是真的玄天铁鞭！我终于见到了！' },
    [10] = { 头像 = 0, 结束 = false, 台词 = '哈哈，这下你满足了吧？' },
    [11] = { 头像 = 3012, 台词 = '谢谢你，这件我亲手打出来的装备就送给你吧！' },
    --5
}

function 任务:取对话(玩家)
    local r = _台词[self.对话进度]
    local 台词, 头像, 结束 = r.台词, r.头像, r.结束
    if 头像 == 0 then
        头像 = 玩家.原形
    end
    return 台词, 头像, 结束
end

function 任务:任务NPC对话(玩家, NPC)
    if not 玩家:剧情称谓是否存在(6) then
        return
    end

    NPC.队伍对话 = true
    if NPC.名称 == '沙铁匠' then
        if self.进度 == 0 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 4 then
                self.进度 = 1
            end
        elseif self.进度 == 5 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 11 then
                self:完成(玩家)
            end
        end
    elseif NPC.名称 == '李靖' then
        if self.进度 == 1 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 6 then
                self.进度 = 2
            end
        elseif self.进度 == 3 then
            if self.对话进度 >= 8 then
                self.对话进度 = 6
            end
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 8 then
                local 添加物品 = 玩家:添加物品({ 生成物品 { 名称 = '玄天铁鞭', 数量 = 1, 禁止交易 = true } })
                if 添加物品 then
                    self.进度 = 4
                else
                    玩家:提示窗口('#Y你的背包满了，无法获得任务物品！')
                end
            end
        end
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
end

function 任务:击杀多头神魔(玩家)
    self.进度 = 3
    玩家:添加经验(1800000)
    玩家:添加师贡(65425)
    玩家:常规提示('#R你打败了多头神魔，获得1800000经验和65425师贡。')
end

local _衣服 = { '烈焰甲', '霓裳羽衣' }
function 任务:完成(玩家)
    local name = _衣服[玩家.性别]
    if 玩家:添加物品({ 生成装备 { 名称 = name } }) then
        玩家:添加声望(1000)
        玩家:常规提示('#Y你帮助凡人见到了三界的密宝玄天铁鞭，你在个世界的声望获得了提升，你得到了1000点声望。')
        local r = 玩家:取任务('引导_称谓剧情')
        if r then
            r:检测剧情称谓是否完成(玩家, 7, '神鞭')
        end
        self:删除()
    end
end

function 任务:任务NPC给予(玩家, NPC, cash, items)
    NPC.队伍给予 = true
    if NPC.名称 == '沙铁匠' then
        if self.进度 == 4 then
            if items[1] and items[1].名称 == '玄天铁鞭' then --
                if items[1].数量 >= 1 then
                    items[1]:接受(1)
                    self.进度 = 5
                    self.对话进度 = 9
                    NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                end
            end
        end
    end
end

function 任务:任务攻击事件(玩家, NPC)
    if NPC.名称 == '多头神魔' then
        if self.进度 == 2 then
            玩家:进入战斗('scripts/task/称谓剧情/称谓7_玄天神鞭.lua')
        end
    end
end

local _怪物 = {
    {
        名称 = "多头神魔",
        等级 = 90,
        外形 = 2089,
        气血 = 320000,
        魔法 = 100001,
        攻击 = 6800,
        速度 = 150,
        抗性 = {
            抗混乱 = 60,
            抗封印 = 40,
            抗昏睡 = 50,

        },
        技能 = {
            { 名称 = "雷霆霹雳", 熟练度 = 6000 },
            { 名称 = "日照光华", 熟练度 = 6000 },
            { 名称 = "雷神怒击", 熟练度 = 6000 },

        }
    },
    {
        名称 = "精怪",
        等级 = 80,
        外形 = 2019,
        气血 = 320000,
        魔法 = 100001,
        攻击 = 6800,
        速度 = 150,
        抗性 = {
            抗混乱 = 70,
            抗封印 = 50,
            抗昏睡 = 60,
        },
        技能 = {
            抗混乱 = 70,
            抗封印 = 40,
            抗昏睡 = 50,
        }
    },
    {
        名称 = "山妖",
        等级 = 80,
        外形 = 2025,
        气血 = 320000,
        魔法 = 100001,
        攻击 = 6800,
        速度 = 150,
        抗性 = {
            抗混乱 = 70,
            抗封印 = 40,
            抗昏睡 = 50,

        },
        技能 = {

        }
    },
    {
        名称 = "鼠怪",
        等级 = 70,
        外形 = 2021,
        气血 = 320000,
        魔法 = 100001,
        攻击 = 6800,
        速度 = 150,
        抗性 = {
            抗混乱 = 70,
            抗封印 = 40,
            抗昏睡 = 50,

        },
        技能 = {

        }
    },
}


function 任务:战斗初始化(玩家)
    local r = 生成战斗怪物(_怪物[1])
    self:加入敌方(1, r)
    local n = math.random(2, 8)
    for i = 1, n, 1 do
        r = 生成战斗怪物(_怪物[math.random(2, 4)])
        self:加入敌方(i + 1, r)
    end
end

function 任务:战斗回合开始(dt)
end

function 任务:战斗结束(s)
    if s then
        for k, v in self:遍历我方() do
            if v.是否玩家 then
                local r = v.对象.接口:取任务("称谓7_玄天神鞭")
                if r and r.进度 == 2 then
                    r:击杀多头神魔(v.对象.接口)
                end
            end
        end
    end
end

return 任务
