local 任务 = {
    名称 = '称谓11_佛家宝物',
    别名 = '(十一称)佛家宝物',
    类型 = '称谓剧情',
    是否可取消 = false
}

function 任务:任务初始化(玩家, ...)
    self.寻人 = {
        王母娘娘 = 0,
        二郎神 = 0,
        哪吒 = 0,
        李靖 = 0,
        千里眼 = 0,
        南天王 = 0,
        仙女 = 0,
        太上老君 = 0,
        嫦娥 = 0
    }
    self.寻物 = { 九环锡杖 = 0, 锦斓袈裟 = 0 }
    if not self.进度 then
        self.进度 = 1
    end
end

function 任务:任务上线(玩家)
    if not self.进度 then
        self.进度 = 1
    end
    if not self.寻人 then
        self.寻人 = {
            王母娘娘 = 0,
            二郎神 = 0,
            哪吒 = 0,
            李靖 = 0,
            千里眼 = 0,
            南天王 = 0,
            仙女 = 0,
            太上老君 = 0,
            嫦娥 = 0
        }
    end
    if not self.寻物 then
        self.寻物 = { 九环锡杖 = 0, 锦斓袈裟 = 0 }
    end
    --self:删除()
end

function 任务:任务更新(玩家, sec)
end

local _详情 = {
    '你可以完成十一个称谓剧情任务了，任务领取人#Y皇宫#G#u#[1044|65|35|$李世民#]#u',
    '去请#G#u#[1043|21|13|$玄奘#]#u#W大师出任水陆大会的主持。',
    '去找#G#u#[1112|65|49|$玉皇大帝#]#u#W要一套配得上玄奘大师身份的衣物来。',
    '去问问天宫众人有无给玄奘大师的衣物。需要寻找#G#u#[1112|79|48|$王母娘娘#]#u#W，#G#u#[1112|30|35|$哪吒#]#u#W，#G#u#[1112|39|40|$杨戬#]#u#W，#G#u#[1111|55|41|$李靖#]#u#W，#G#u#[1111|19|10|$千里眼#]#u#W，#G#u#[1111|13|14|$南天王#]#u#W，#G#u#[1111|16|37|$仙女#]#u#W，#G#u#[1113|12|10|$太上老君#]#u#W，#G#u#[101474|24|65|$嫦娥#]#u#W。',
    '再跟#G#u#[1112|65|49|$玉皇大帝#]#u#W聊聊吧。',
    '去找#G#u#[1141|19|11|$观音姐姐#]#u#W要如来赐子的宝物。',
    '打败#G#u#[1140|29|18|$玉狐仙#]#u#W，帮观音姐姐把佛家宝物拿回来。#Y(ALT+A玉狐仙进入战斗)',
    '拿回了佛家宝物跟#G#u#[1141|19|11|$观音姐姐#]#u#W复命吧。',
    '把宝物带给#G#u#[1043|21|13|$玄奘#]#u#W大师吧。（ALT+G将宝物给予玄奘）需要的宝物是#G九环锡杖#W和#G锦斓袈裟#W。'
}
function 任务:任务取详情(玩家)
    return _详情[self.进度 + 1]
end

local _台词 = {
    [1] = { 头像 = 3037, 结束 = false, 台词 = '爱卿来得正好，如今大乱已了，朕不日准备举行水陆大会，爱卿是修仙之人可否为朕去请玄奘法师出任主持？' },
    [2] = { 头像 = 0, 台词 = '这点小事，就交给我吧。' },
    --0
    [3] = { 头像 = 3048, 结束 = false, 台词 = '陛下准备举办水陆大会？？可是贫僧只懂小乘佛法，要谈天，说地，度鬼，需得我佛如来的三藏大乘真经才行。' },
    [4] = { 头像 = 0, 结束 = false, 台词 = '啊，这么说来你又不准备去啦？？' },
    [5] = { 头像 = 3048, 结束 = false, 台词 = '不然，世人为善之心日稀，为佛之人，岂能不尽引渡之职，贫僧愿先主持水陆大会，再前往灵山，向我佛如未求取真经。' },
    [6] = { 头像 = 0, 结束 = false, 台词 = '呵呵，果然不愧是玄奖，佛法精深，胸怀广阔。' },
    [7] = { 头像 = 3048, 结束 = false, 台词 = '惭愧惭愧，折杀贫憎了。' },
    [8] = { 头像 = 0, 结束 = false, 台词 = '啊，不过话又说回来，玄奘大师，我看你衣衫破旧，这样去主持水陆大会，恐怕不好吧。' },
    [9] = { 头像 = 3048, 结束 = false, 台词 = '这……贫僧只为精研佛法，衣衫鞋帽，都是身外之物，也无需着相。' },
    [10] = { 头像 = 0, 台词 = '话是这样说，不过象大师这样修为精深之人，又怎能没有套好衣呢，呵呵这事包在我身上，我去找王帝那老头儿要一套来。' },
    --1
    [11] = { 头像 = 3066, 结束 = false, 台词 = '什么？？要在天宫给玄奘法师找一套佛衣？这……' },
    [12] = { 头像 = 0, 结束 = false, 台词 = '玉帝，你不会是想说你没有吧。天宫众宝云集，怎么可能会找不出一套佛衣。' },
    [13] = { 头像 = 3066, 结束 = false, 台词 = '这……不瞒你说，如果是要找仙家宝物，天宫也许还可以拿出几件，可是玄奘法师所需是佛家之物，天宫怎么会有。' },
    [14] = { 头像 = 0, 结束 = false, 台词 = '听起来倒象有几分道理…' },
    [15] = { 头像 = 3066, 结束 = false, 台词 = '你如果不信，尽可去找天宫众仙询问，如果有，朕愿双手幸上。' },
    [16] = { 头像 = 0, 台词 = '嗯，那好，我去问问看。' },
    --2
    [17] = { 头像 = 0, 台词 = '要在天宫找佛衣，这…恐怕难以如愿。' },
    [18] = { 头像 = 0, 台词 = '佛衣？？……佛家之物，天宫可没有。' },
    [19] = { 头像 = 0, 台词 = '佛衣？？……佛家之物，天宫可没有。' },
    [20] = { 头像 = 0, 台词 = '听说我佛如来为取经人准备了两件宝物，命观音交托，你何不去问问观音。' },
    [21] = { 头像 = 0, 台词 = '听说我佛如来为取经人准备了两件宝物，命观音交托，你何不去问问观音。' },
    [22] = { 头像 = 0, 台词 = '佛家宝物为何天宫会有。' },
    [23] = { 头像 = 0, 台词 = '要在天宫找佛衣，这…恐怕难以如愿。' },
    [24] = { 头像 = 0, 台词 = '听说我佛如来为取经人准备了两件宝物，命观音交托，你何不去问问观音。' },
    [25] = { 头像 = 0, 台词 = '要在天宫找佛衣，这…恐怕难以如愿。' },
    --3
    [26] = { 头像 = 0, 结束 = false, 台词 = '嗯，问来问去，好象真的是没有。' },
    [27] = { 头像 = 3066, 结束 = false, 台词 = '怎么样，朕没有骗你吧，听说西天如来佛祖已经为取经人准备了两件宝物，命观音文托，你何不去问问观音。' },
    [28] = { 头像 = 0, 台词 = '说得也是，那好，就去观音姐姐那问问看。' },
    --4
    [29] = { 头像 = 3059, 结束 = false, 台词 = '咦，你来得正好，我有一事，想请你帮忙。' },
    [30] = { 头像 = 0, 结束 = false, 台词 = '哦，观音姐姐无上法力，居然要找我帮忙，是什么事情啊？' },
    [31] = { 头像 = 3059, 结束 = false, 台词 = '我佛如来为取经人准备了两件宝物，九环锡杖和锦斓袈裟，可是前几天被在山下修行的王狐仙偷去了。她和我一山修行，我实在不好出手，正好你来这里，可否帮我去找他讨回。' },
    [32] = { 头像 = 0, 结束 = false, 台词 = '哈哈，是这事啊，我正是来为玄奘大师寻找佛衣宝物，观音姐姐你放心，这事就包在我身上了。' },
    [33] = { 头像 = 3059, 台词 = '玉狐仙法力不弱，千万小心。' },
    --5
    [34] = { 头像 = 3059, 台词 = '不错，正是这九环锡杖和锦斓袈裟，既然你已经拿到了他们，就赶紧给取经人送去吧。' },
    --6
    [35] = { 头像 = 3048, 结束 = false, 台词 = '啊，这是……我佛如来所赠的九环锡杖和锦斓袈裟。贫僧定不负所托，尽心竭力，主持水陆大会，西行求取真经，度我世人。' },
    [36] = { 头像 = 0, 台词 = '嘿嘿，玄奘大师，有孙悟空帮忙，我想你一定能做到的。' }
}

function 任务:取对话(玩家)
    local r = _台词[self.对话进度]
    local 台词, 头像, 结束 = r.台词, r.头像, r.结束
    if 头像 == 0 then
        头像 = 玩家.原形
    end
    return 台词, 头像, 结束
end

function 任务:任务NPC对话(玩家, NPC)
    if not 玩家:剧情称谓是否存在(10) then
        return
    end

    NPC.队伍对话 = true
    if NPC.名称 == '李世民' then
        if self.进度 == 0 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 2 then
                self.进度 = 1
                玩家:添加经验(43230)
            end
        end
    elseif NPC.名称 == '玄奘' then
        if self.进度 == 1 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 10 then
                self.进度 = 2
            end
        elseif self.进度 == 9 then
            self.对话进度 = 36
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            self:完成(玩家)
        end
    elseif NPC.名称 == '玉皇大帝' then
        if self.进度 == 2 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 16 then
                self.进度 = 3
            end
        elseif self.进度 == 4 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 28 then
                self.进度 = 5
            end
        end
    elseif NPC.名称 == '观音姐姐' then
        if self.进度 == 5 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 33 then
                self.进度 = 6
            end
        elseif self.进度 == 7 then
            self.对话进度 = 34
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            self.进度 = 8
        end
    elseif NPC.名称 == '王母娘娘' then
        if self.进度 == 3 and self.寻人.王母娘娘 == 0 then
            self.寻人.王母娘娘 = 1
            NPC.台词 = _台词[17].台词
            self:寻人检查(玩家)
        end
    elseif NPC.名称 == '二郎神' then
        if self.进度 == 3 and self.寻人.二郎神 == 0 then
            self.寻人.二郎神 = 1
            NPC.台词 = _台词[18].台词
            self:寻人检查(玩家)
        end
    elseif NPC.名称 == '哪吒' then
        if self.进度 == 3 and self.寻人.哪吒 == 0 then
            self.寻人.哪吒 = 1
            NPC.台词 = _台词[19].台词
            self:寻人检查(玩家)
        end
    elseif NPC.名称 == '李靖' then
        if self.进度 == 3 and self.寻人.李靖 == 0 then
            self.寻人.李靖 = 1
            NPC.台词 = _台词[20].台词
            self:寻人检查(玩家)
        end
    elseif NPC.名称 == '千里眼' then
        if self.进度 == 3 and self.寻人.千里眼 == 0 then
            self.寻人.千里眼 = 1
            NPC.台词 = _台词[21].台词
            self:寻人检查(玩家)
        end
    elseif NPC.名称 == '南天王' then
        if self.进度 == 3 and self.寻人.南天王 == 0 then
            self.寻人.南天王 = 1
            NPC.台词 = _台词[22].台词
            self:寻人检查(玩家)
        end
    elseif NPC.名称 == '仙女' then
        if self.进度 == 3 and self.寻人.仙女 == 0 then
            self.寻人.仙女 = 1
            NPC.台词 = _台词[23].台词
            self:寻人检查(玩家)
        end
    elseif NPC.名称 == '太上老君' then
        if self.进度 == 3 and self.寻人.太上老君 == 0 then
            self.寻人.太上老君 = 1
            NPC.台词 = _台词[24].台词
            self:寻人检查(玩家)
        end
    elseif NPC.名称 == '嫦娥' then
        if self.进度 == 3 and self.寻人.嫦娥 == 0 then
            self.寻人.嫦娥 = 1
            NPC.台词 = _台词[25].台词
            self:寻人检查(玩家)
        end
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
end

function 任务:寻人检查(玩家)
    for _, v in pairs(self.寻人) do
        if v == 0 then
            return
        end
    end
    self.进度 = 4
    self.对话进度 = 25
end

function 任务:击杀玉狐仙(玩家)
    if 玩家:添加物品({ 生成物品 { 名称 = '锦斓袈裟', 数量 = 1, 禁止交易 = true }, 生成物品 { 名称 = '九环锡杖', 数量 = 1, 禁止交易 = true } }) then
        self.进度 = 7
        玩家:添加经验(6300000)
        玩家:添加师贡(50000)
        玩家:常规提示('#Y你获得了6300000点经验，50000两师贡，锦斓袈裟和九环锡杖。')
    else
        玩家:常规提示('#Y你身上的包裹已经满了 清理好预留两个包裹位置再来试试吧！')
    end
end

function 任务:完成(玩家)
    玩家:添加声望(50)
    玩家:常规提示('#Y你帮助玄奘我到佛衣宝物，你的声望增加了50点。')
    local r = 玩家:取任务('引导_称谓剧情')
    if r then
        r:检测剧情称谓是否完成(玩家, 11, '宝物')
    end
    self:删除()
end

function 任务:任务NPC给予(玩家, NPC, cash, items)
    if NPC.名称 == '玄奘' then
        if self.进度 == 8 then
            if items[1] and (items[1].名称 == '锦斓袈裟' or items[1].名称 == '九环锡杖') then --
                if self.寻物[items[1].名称] == 0 then
                    if items[1].数量 >= 1 then
                        items[1]:接受(1)
                        self.寻物[items[1].名称] = 1
                    end
                end
                if self.寻物.锦斓袈裟 == 1 and self.寻物.九环锡杖 == 1 then
                    self.进度 = 9
                    self.对话进度 = 35
                    NPC.队伍给予 = true
                    NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                    return
                end
                NPC.台词 = '物品集齐了吗'
            end
        end
    end
end

function 任务:任务攻击事件(玩家, NPC)
    if NPC.名称 == '玉狐仙' then
        if self.进度 == 6 and self.对话进度 == 33 then
            玩家:进入战斗('scripts/task/称谓剧情/称谓11_佛家宝物.lua')
        end
    end
end

local _怪物 = {

    {
        名称 = "玉狐仙",
        等级 = 130,
        外形 = 2059,
        气血 = 1070000,
        魔法 = 12000,
        攻击 = 40000,
        速度 = 450,
        是否消失 = false,
        抗性 = {
            抗混乱 = 110,
            抗封印 = 100,
            抗昏睡 = 100,
            物理吸收 = 50,

        },
        技能 = {

        }
    },

    {
        名称 = "狐狸精",
        等级 = 110,
        外形 = 2059,
        气血 = 260000,
        魔法 = 12000,
        攻击 = 40000,
        速度 = 450,
        是否消失 = false,
        抗性 = {
            抗混乱 = 110,
            抗封印 = 100,
            抗昏睡 = 100,
            物理吸收 = 50,

        },
        技能 = {
            { 名称 = "烈火骄阳", 熟练度 = 11000 },
            { 名称 = "九阴纯火", 熟练度 = 11000 }
        }
    },

}

function 任务:战斗初始化(玩家)
    local r = 生成战斗怪物(_怪物[1])
    self:加入敌方(1, r)
    for n = 2, 6, 1 do
        r = 生成战斗怪物(_怪物[2])
        self:加入敌方(n, r)
    end
end

function 任务:战斗回合开始(dt)
end

function 任务:战斗结束(s)
    if s then
        for _, v in self:遍历我方() do
            if v.是否玩家 then
                local r = v.对象.接口:取任务("称谓11_佛家宝物")
                if r and r.进度 == 6 then
                    r:击杀玉狐仙(v.对象.接口)
                end
            end
        end
    end
end

return 任务
