local 任务 = {
    名称 = '领取称谓',
    别名 = '领取称谓',
    类型 = '称谓剧情',
    是否可取消 = false
}

function 任务:任务初始化(玩家, ...)
end

function 任务:任务上线(玩家)
    --self:删除()
end

function 任务:任务更新(玩家, sec)
    if not self.cw then
        self.cw = 1
    end
end

local _详情 = {
    '你可以去找#G金銮殿#Y（64,42）#R李世民#W领取#Y%s#W的称谓了',
    '你可以去找#G长安城#Y（86,3）#R九头魔#W领取#Y%s#W的称谓了',
    '你可以去找#G长安城#Y（144,133）#R太白金星#W领取#Y%s#W的称谓了',
    '你可以去找#G长安城#Y（227,17）#R阴长生#W领取#Y%s#W的称谓了'
}

local _称谓表 = {
    { '武林新丁', '江湖小虾', '后起之秀', '武林高手', '风尘奇侠', '无双隐士', '世外高人', '江湖侠隐', '无敌圣者', '三界贤君', '夕阳武士', '神通广大', '变化无穷', '火眼金睛' },
    { '古灵精怪', '魅力精灵', '魔幻使者', '妖之奇葩', '天神煞星', '万兽妖灵', '混世魔王', '三界妖仙', '魔神至尊', '齐天妖王', '夕阳武士', '神通广大', '变化无穷', '火眼金睛' },
    { '仙灵小童', '逍遥之仙', '陆地飞仙', '无极天师', '神机真人', '降魔金仙', '金身尊者', '天外飞仙', '万圣天尊', '九天圣佛', '夕阳武士', '神通广大', '变化无穷', '火眼金睛' },
    { '阴曹小鬼', '飘渺之魂', '幽冥鬼士', '勾魂使者', '催命判官', '阴阳无常', '阎罗鬼王', '冥灵鬼仙', '九幽神君', '阴都大帝', '夕阳武士', '神通广大', '变化无穷', '火眼金睛' }
}
local _领取人 = { '李世民', '九头魔', '太白金星', '阴长生' }
local _台词 = {
    [[
据说，你行走四方做了不少好事，平民们很感激，我愿意嘉奖你的功绩，你愿意现在就获得嘉奖吗?
menu
1|我就是找你来领头衔的啦。
 99|我只是路过，脸没洗牙也还没有刷呢。
]]
}

function 任务:任务取详情(玩家)
    return _详情[玩家.种族]:format(_称谓表[玩家.种族][self.cw])
end

function 任务:任务NPC对话(玩家, NPC)
    if NPC.名称 == _领取人[玩家.种族] and NPC.台词 then
        NPC.台词 = _台词[1]
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if NPC.名称 == _领取人[玩家.种族] then
        if i == "1" then
            local 称谓名称 = _称谓表[玩家.种族][self.cw]
            玩家:更新称谓剧情(self.cw)
            玩家:添加称谓(称谓名称)
            玩家:更换称谓(称谓名称)

            local r = 玩家:取任务('引导_称谓剧情')
            if r then
                r:任务领取称谓事件(玩家)
            end
            self:删除()
        end
    end
end

function 任务:完成(玩家)

end

return 任务
