
local 战斗 = {
    是否惩罚 = false --死亡
}

function 战斗:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 2018,
        名称 = "三界妖王",
        等级 = 等级,
        气血 = 1587545 + 等级 * 10000,
        魔法 = 81111,
        伤害 = 41200,
        速度 = 1050 + 等级 * 2,
        抗性 = {
            物理吸收 = 15,
            抗震慑 = 25,
            抗混乱 = 105,
            抗封印 = 105,
            抗昏睡 = 105,
            抗遗忘 = 60,
            加强封印 = 15,
            加强混乱 = 15,
            加强昏睡 = 15,
            忽视抗封 = 5,
            忽视抗睡 = 5,
            忽视抗混 = 5,
        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 25000 },
            { 名称 = "借刀杀人", 熟练度 = 25000 },
            { 名称 = "百日眠", 熟练度 = 25000 },
            { 名称 = "作壁上观", 熟练度 = 25000 },
        },
        施法几率 = 75,
        是否消失 = false,
    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2018,
        名称 = "三界妖王",
        等级 = 等级,
        气血 = 1587545 + 等级 * 10000,
        魔法 = 81111,
        伤害 = 41200,
        速度 = 950 + 等级 * 2,
        抗性 = {
            物理吸收 = 15,
            抗震慑 = 25,
            抗混乱 = 105,
            抗封印 = 105,
            抗昏睡 = 105,
            抗遗忘 = 60,
            加强雷 = 30,
            加强风 = 30,
            加强火 = 30,
            加强水 = 30,
            忽视抗雷 = 20,
            忽视抗风 = 20,
            忽视抗火 = 20,
            忽视抗水 = 20,
        },
        技能 = {
            { 名称 = "九龙冰封", 熟练度 = 25000 },
            { 名称 = "天诛地灭", 熟练度 = 25000 },
            { 名称 = "袖里乾坤", 熟练度 = 25000 },
        },
        施法几率 = 75,
        是否消失 = false,
    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2018,
        名称 = "三界妖王",
        等级 = 等级,
        气血 = 1587545 + 等级 * 10000,
        魔法 = 81111,
        伤害 = 41200,
        速度 = 980 + 等级 * 2,
        抗性 = {
            物理吸收 = 15,
            抗震慑 = 25,
            抗混乱 = 105,
            抗封印 = 105,
            抗昏睡 = 105,
            抗遗忘 = 60,
            连击率 = 50,
            连击次数 = 5,
            反击率 = 50,
            反击次数 = 1,
        },
        技能 = {
            { 名称 = "乾坤借速", 熟练度 = 25000 },
            { 名称 = "魔音摄心", 熟练度 = 25000 },
            { 名称 = "阎罗追命", 熟练度 = 25000 },
            { 名称 = "含情脉脉", 熟练度 = 25000 },
        },
        施法几率 = 75,
        是否消失 = false,
    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2026,
        名称 = "蓝色妖王",
        等级 = 等级,
        气血 = 812587 + 等级 * 10000,
        魔法 = 47000,
        伤害 = 150 + 等级 * 30,
        速度 = 180 + 等级 * 3,
        抗性 = {
            物理吸收 = 50,
            抗震慑 = 10,
            抗风 = 30 + 等级 * 0.1,
            抗火 = 30 + 等级 * 0.1,
            抗水 = 30 + 等级 * 0.1,
            抗雷 = 30 + 等级 * 0.1,
            抗混乱 = 95,
            抗昏睡 = 95,
            抗中毒 = 30 + 等级 * 0.1,
            抗鬼火 = 10 + 等级 * 0.1,
        },
        技能 = {
            { 名称 = "万毒攻心", 熟练度 = 25000 },
        },
        施法几率 = 75,
        是否消失 = false,
    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2073,
        名称 = "黑山老妖",
        等级 = 等级,
        气血 = 812587 + 等级 * 10000,
        魔法 = 47000,
        伤害 = 150 + 等级 * 30,
        速度 = 180 + 等级 * 3,
        抗性 = {
            抗震慑 = 10,
            抗风 = 30 + 等级 * 0.1,
            抗火 = 30 + 等级 * 0.1,
            抗水 = 30 + 等级 * 0.1,
            抗雷 = 30 + 等级 * 0.1,
            抗混乱 = 95,
            抗昏睡 = 95,
            抗中毒 = 10,
        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 25000 },
        },
        施法几率 = 75,
        是否消失 = false,
    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2006,
        名称 = "万年熊王",
        等级 = 等级,
        气血 = 812587 + 等级 * 10000,
        魔法 = 7000,
        伤害 = 21000 + 等级 * 30,
        速度 = 180 + 等级 * 3,
        抗性 = {
            抗震慑 = 5,
            抗风 = 50 + 等级 * 0.1,
            抗火 = 50 + 等级 * 0.1,
            抗水 = 50 + 等级 * 0.1,
            抗雷 = 50 + 等级 * 0.1,
            抗混乱 = 95,
            抗昏睡 = 95,
            忽视防御几率 = 60,
            忽视防御程度 = 60,
            连击率 = 80,
            连击次数 = 3,
        },
        技能 = {
            { 名称 = "九龙冰封", 熟练度 = 25000 },
            { 名称 = "九阴纯火", 熟练度 = 25000 },
            { 名称 = "天诛地灭", 熟练度 = 25000 },
            { 名称 = "袖里乾坤", 熟练度 = 25000 },
        },
        施法几率 = 1,
        是否消失 = false,
    }
    self:加入敌方(6, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2074,
        名称 = "三头魔王",
        等级 = 等级,
        气血 = 812587 + 等级 * 10000,
        魔法 = 47000,
        伤害 = 15000 + 等级 * 70,
        速度 = 180 + 等级 * 3,
        抗性 = {
            物理吸收 = 50,
            抗震慑 = 10,
            抗风 = 30 + 等级 * 0.1,
            抗火 = 30 + 等级 * 0.1,
            抗水 = 30 + 等级 * 0.1,
            抗雷 = 30 + 等级 * 0.1,
            抗混乱 = 95,
            抗昏睡 = 95,
            抗鬼火 = 30 + 等级 * 0.1,
            雷系狂暴几率 = 40,
        },
        技能 = {
            { 名称 = "天诛地灭", 熟练度 = 25000 },
        },
        施法几率 = 75,
        是否消失 = false,
    }
    self:加入敌方(7, 生成战斗怪物(怪物属性))
    -- 怪物属性 = {
    --     外形 = 2026,
    --     名称 = "蓝色妖王",
    --     等级 = 等级,
    --     气血 = 9999,
    --     魔法 = 1,
    --     伤害 = 1,
    --     速度 = 1,
    --     抗性 = {

    --     },
    --     技能 = {

    --     },
    --     施法几率 = 50,
    --     是否消失 = false,
    -- }
    -- self:加入敌方(8, 生成战斗怪物(怪物属性))




end

function 战斗:进场喊话()

end

function 战斗:战斗回合开始(v)




end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

local _掉落 = {
    -- { 几率 = 1, 名称 = '随机宝石', 参数 = 10, 数量 = 1,广播 = '#R%s#c00FFFF奋战多时，终于击败了三界妖王并找寻到#G#m(%s)[%s]#m#n#c00FFFF，欣慰的将其纳入囊中！' },
    -- { 几率 = 1, 名称 = '随机炼妖', 参数 = 13, 数量 = 1, 广播 = '#R%s#c00FFFF奋战多时，终于击败了三界妖王并找寻到#G#m(%s)[%s]#m#n#c00FFFF，欣慰的将其纳入囊中！' },
    -- { 几率 = 1, 名称 = '随机炼妖', 参数 = 12, 数量 = 1,广播 = '#R%s#c00FFFF奋战多时，终于击败了三界妖王并找寻到#G#m(%s)[%s]#m#n#c00FFFF，欣慰的将其纳入囊中！' },
    -- { 几率 = 1, 名称 = '随机神兵', 参数 = 1, 广播 = '#R%s#R打败了三界妖王获得了一件神兵：#G#m(%s)[%s]#m#n' },
    -- { 几率 = 5, 名称 = '随机宝石', 参数 = 9, 数量 = 1,广播 = '#R%s#c00FFFF奋战多时，终于击败了三界妖王并找寻到#G#m(%s)[%s]#m#n#c00FFFF，欣慰的将其纳入囊中！' },
    -- { 几率 = 1, 名称 = '随机炼妖', 参数 = 11, 数量 = 1 },
    -- { 几率 = 3, 名称 = '随机炼妖', 参数 = 10, 数量 = 1 },
    -- { 几率 = 10, 名称 = '红雪散', 数量 = 5 },
    -- { 几率 = 10, 名称 = '孔雀明王羽', 数量 = 5 },
    -- { 几率 = 10, 名称 = '五龙圣丹', 数量 = 5 },
    -- { 几率 = 10, 名称 = '神兵石', 数量 = 1,广播 = '#R%s#c00FFFF奋战多时，终于击败了三界妖王并找寻到#G#m(%s)[%s]#m#n#c00FFFF，欣慰的将其纳入囊中！' },
    -- { 几率 = 20, 名称 = '内丹精华', 数量 = 1 },
    -- { 几率 = 20, 名称 = '血玲珑', 数量 = 1 },
    -- { 几率 = 20, 名称 = '九彩云龙珠', 数量 = 1 },
    -- { 几率 = 10, 名称 = '千年寒铁', 数量 = 1 },
    -- { 几率 = 20, 名称 = '天外飞石', 数量 = 1 },
    -- { 几率 = 20, 名称 = '盘古精铁', 数量 = 1 },
    -- { 几率 = 5, 名称 = '神兵礼盒', 参数 = 2, 属性 = "#Y获得2级随机神兵", 数量 = 1 },
    -- { 几率 = 10, 名称 = '补天神石', 数量 = 1 },
    -- { 几率 = 20, 名称 = '天机密令', 数量 = 1 },
    { 几率 = 1, 名称 = '随机宝石', 参数 = 10, 数量 = 1, 广播 = '#R%s#c00FFFF奋战多时，终于击败了三界妖王并找寻到#G#m(%s)[%s]#m#n#c00FFFF，欣慰的将其纳入囊中！' },
    { 几率 = 1, 名称 = '随机炼妖', 参数 = 13, 数量 = 1,广播 = '#R%s#c00FFFF奋战多时，终于击败了三界妖王并找寻到#G#m(%s)[%s]#m#n#c00FFFF，欣慰的将其纳入囊中！' },
    { 几率 = 1, 名称 = '随机炼妖', 参数 = 12, 数量 = 1,广播 = '#R%s#c00FFFF奋战多时，终于击败了三界妖王并找寻到#G#m(%s)[%s]#m#n#c00FFFF，欣慰的将其纳入囊中！' },
    { 几率 = 5, 名称 = '随机宝石', 参数 = 9, 数量 = 1,广播 = '#R%s#c00FFFF奋战多时，终于击败了三界妖王并找寻到#G#m(%s)[%s]#m#n#c00FFFF，欣慰的将其纳入囊中！' },
    { 几率 = 1, 名称 = '随机炼妖', 参数 = 11, 数量 = 1 },
    { 几率 = 3, 名称 = '随机炼妖', 参数 = 10, 数量 = 1 },
    { 几率 = 10, 名称 = '红雪散', 数量 = 5 },
    { 几率 = 10, 名称 = '孔雀明王羽', 数量 = 5 },
    { 几率 = 10, 名称 = '五龙圣丹', 数量 = 5 },
    { 几率 = 10, 名称 = '神兵石', 数量 = 1,广播 = '#R%s#c00FFFF奋战多时，终于击败了三界妖王并找寻到#G#m(%s)[%s]#m#n#c00FFFF，欣慰的将其纳入囊中！' },
    { 几率 = 25, 名称 = '随机神兵', 参数 = 1, 广播 = '#R%s#c00FFFF奋战多时，终于击败了三界妖王并找寻到#G#m(%s)[%s]#m#n#c00FFFF，欣慰的将其纳入囊中！' },

}
local function 掉落包(玩家)
    local 银两 = 50000
    local 经验 = 1585465
    local 法宝经验 = 569
    玩家:添加任务经验(经验, "挖宝妖王")
    玩家:添加银子(银两, "挖宝妖王")
    玩家:添加法宝经验(法宝经验)

    if math.random(1000) > 700 then
        local 总几率 = math.random(52)
        local 几率 = 0
        for i, v in ipairs(_掉落) do
            几率 = 几率 + v.几率
            if 总几率 <= 几率 then
                local r = 生成物品 { 名称 = v.名称, 数量 = v.数量, 参数 = v.参数, 禁止交易 = v.禁止交易 }
                if r then
                    玩家:添加物品({ r })
                    if v.广播 then
                        玩家:发送系统(v.广播, 玩家.名称, r.nid, r.原名 or r.名称)
                    end
                    break
                end
            end
        end
    end
end

function 战斗:战斗结束(s)
    if s then
        for k, v in self:遍历我方() do
            if v.是否玩家 then
                掉落包(v.对象.接口)
            end
        end
    end
end

return 战斗
