
local 战斗 = {
    是否惩罚 = false --死亡
}

function 战斗:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 2073,
        名称 = "千年老妖",
        等级 = 等级,
        气血 = 887545 + 等级 * 10000,
        魔法 = 81111,
        伤害 = 41200,
        速度 = 812,
        抗性 = {
            物理吸收 = 15,
            抗震慑 = 25,
            抗混乱 = 80,
            抗封印 = 80,
            抗昏睡 = 80,
        },
        技能 = {
            { 名称 = "借刀杀人", 熟练度 = 20000 },
            { 名称 = "失心狂乱", 熟练度 = 20000 },
            { 名称 = "百日眠", 熟练度 = 20000 },
        },
        施法几率 = 75,
        是否消失 = false,
    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2073,
        名称 = "千年老妖",
        等级 = 等级,
        气血 = 887545 + 等级 * 10000,
        魔法 = 81111,
        伤害 = 41200,
        速度 = 695,
        抗性 = {
            物理吸收 = 15,
            抗震慑 = 25,
            抗混乱 = 80,
            抗封印 = 80,
            抗昏睡 = 80,
        },
        技能 = {
            { 名称 = "九龙冰封", 熟练度 = 20000 },
            { 名称 = "九阴纯火", 熟练度 = 20000 },
            { 名称 = "天诛地灭", 熟练度 = 20000 },
            { 名称 = "袖里乾坤", 熟练度 = 20000 },
        },
        施法几率 = 75,
        是否消失 = false,
    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2073,
        名称 = "千年老妖",
        等级 = 等级,
        气血 = 887545 + 等级 * 10000,
        魔法 = 81111,
        伤害 = 41200,
        速度 = 788,
        抗性 = {
            物理吸收 = 15,
            抗震慑 = 25,
            抗混乱 = 80,
            抗封印 = 80,
            抗昏睡 = 80,
            连击率 = 50,
            连击次数 = 5,
            反击率 = 50,
            反击次数 = 1,
        },
        技能 = {
            { 名称 = "乾坤借速", 熟练度 = 20000 },
            { 名称 = "魔音摄心", 熟练度 = 20000 },
            { 名称 = "阎罗追命", 熟练度 = 20000 },
        },
        施法几率 = 75,
        是否消失 = false,
    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2052,
        名称 = "牛头喽啰",
        等级 = 等级,
        气血 = 587545 + 等级 * 10000,
        魔法 = 81111,
        伤害 = 41200,
        速度 = 180 + 等级 * 3,
        抗性 = {
            物理吸收 = 50,
            抗震慑 = 10,
            抗风 = 30 + 等级 * 0.1,
            抗火 = 30 + 等级 * 0.1,
            抗水 = 30 + 等级 * 0.1,
            抗雷 = 30 + 等级 * 0.1,
            抗混乱 = 70,
            抗昏睡 = 70,
        },
        技能 = {
            { 名称 = "万毒攻心", 熟练度 = 20000 },
        },
        施法几率 = 75,
        是否消失 = false,
    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2053,
        名称 = "马面喽啰",
        等级 = 等级,
        气血 = 587545 + 等级 * 10000,
        魔法 = 81111,
        伤害 = 41200,
        速度 = 180 + 等级 * 3,
        抗性 = {
            物理吸收 = 50,
            抗震慑 = 10,
            抗风 = 30 + 等级 * 0.1,
            抗火 = 30 + 等级 * 0.1,
            抗水 = 30 + 等级 * 0.1,
            抗雷 = 30 + 等级 * 0.1,
            抗混乱 = 70,
            抗昏睡 = 60,
            抗中毒 = 10,
        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 20000 },
        },
        施法几率 = 75,
        是否消失 = false,
    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2019,
        名称 = "精怪喽啰",
        等级 = 等级,
        气血 = 587545 + 等级 * 10000,
        魔法 = 81111,
        伤害 = 41200,
        速度 = 180 + 等级 * 3,
        抗性 = {
            抗震慑 = 5,
            抗风 = 50 + 等级 * 0.1,
            抗火 = 50 + 等级 * 0.1,
            抗水 = 50 + 等级 * 0.1,
            抗雷 = 50 + 等级 * 0.1,
            抗混乱 = 70,
            抗昏睡 = 60,
            忽视防御几率 = 60,
            忽视防御程度 = 60,
            连击率 = 80,
            连击次数 = 3,
        },
        技能 = {
            { 名称 = "九龙冰封", 熟练度 = 20000 },
            { 名称 = "九阴纯火", 熟练度 = 20000 },
            { 名称 = "天诛地灭", 熟练度 = 20000 },
            { 名称 = "袖里乾坤", 熟练度 = 20000 },
        },
        施法几率 = 5,
        是否消失 = false,
    }
    self:加入敌方(6, 生成战斗怪物(怪物属性))
    怪物属性 = {

        外形 = 2025,
        名称 = "山妖喽啰",
        等级 = 等级,
        气血 = 587545 + 等级 * 10000,
        魔法 = 81111,
        伤害 = 41200,
        速度 = 180 + 等级 * 3,
        抗性 = {
            物理吸收 = 50,
            抗震慑 = 10,
            抗风 = 30 + 等级 * 0.1,
            抗火 = 30 + 等级 * 0.1,
            抗水 = 30 + 等级 * 0.1,
            抗雷 = 30 + 等级 * 0.1,
            抗混乱 = 70,
            抗昏睡 = 60,
            抗鬼火 = 30 + 等级 * 0.1,
            雷系狂暴几率 = 40,
        },
        技能 = {
            { 名称 = "天诛地灭", 熟练度 = 20000 },
        },
        施法几率 = 75,
        是否消失 = false,
    }
    self:加入敌方(7, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2021,
        名称 = "鼠怪喽啰",
        等级 = 等级,
        气血 = 587545 + 等级 * 10000,
        魔法 = 81111,
        伤害 = 41200,
        速度 = 180 + 等级 * 3,
        抗性 = {
            物理吸收 = 15,
            抗震慑 = 25,
        },
        技能 = {
            { 名称 = "九龙冰封", 熟练度 = 20000 },
            { 名称 = "九阴纯火", 熟练度 = 20000 },
            { 名称 = "天诛地灭", 熟练度 = 20000 },
            { 名称 = "袖里乾坤", 熟练度 = 20000 },
        },
        施法几率 = 75,
        是否消失 = false,
    }
    self:加入敌方(8, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 2021,
        名称 = "鼠怪喽啰",
        等级 = 等级,
        气血 = 587545 + 等级 * 10000,
        魔法 = 81111,
        伤害 = 41200,
        速度 = 15 + 等级 * 2,
        抗性 = {
            物理吸收 = 15,
            抗震慑 = 25,
            抗风 = 85,
            抗火 = 85,
            抗水 = 85,
            抗雷 = 85,
            抗混乱 = 70,
            抗封印 = 70,
            抗昏睡 = 70,
        },
        技能 = {
            { 名称 = "九龙冰封", 熟练度 = 20000 },
            { 名称 = "九阴纯火", 熟练度 = 20000 },
            { 名称 = "天诛地灭", 熟练度 = 20000 },
            { 名称 = "袖里乾坤", 熟练度 = 20000 },
        },
        施法几率 = 75,
        是否消失 = false,
    }
    self:加入敌方(9, 生成战斗怪物(怪物属性))


end

function 战斗:进场喊话()

end

function 战斗:战斗回合开始(v)




end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)



end

local _掉落 = {
    { 几率 = 1, 名称 = '随机神兵', 参数 = 1, 数量 = 1,
        广播 = '#c00FFFF【千年老妖】玩家#R%s#c00FFFF打倒游荡的千年妖魔获得了#G#m(%s)[%s]#m#n#c00FFFF#89的奖励！' },
    { 几率 = 1, 名称 = '龙之骨', 数量 = 1,
        广播 = '#c00FFFF【千年老妖】玩家#R%s#c00FFFF打倒游荡的千年妖魔获得了#G#m(%s)[%s]#m#n#c00FFFF#89的奖励！' },
    { 几率 = 1, 名称 = '九转易筋丸', 数量 = 1,
        广播 = '#c00FFFF【千年老妖】玩家#R%s#c00FFFF打倒游荡的千年妖魔获得了#G#m(%s)[%s]#m#n#c00FFFF#89的奖励！' },
    { 几率 = 10, 名称 = '清风白雪', 数量 = 10 },
    { 几率 = 10, 名称 = '餐风饮露', 数量 = 10 },
    { 几率 = 15, 名称 = '高级金柳露', 数量 = 1,
        广播 = '#c00FFFF【千年老妖】玩家#R%s#c00FFFF打倒游荡的千年妖魔获得了#G#m(%s)[%s]#m#n#c00FFFF#89的奖励！' },
    { 几率 = 100, 名称 = '见闻录', 数量 = 1,
        广播 = '#c00FFFF【千年老妖】玩家#R%s#c00FFFF打倒游荡的千年妖魔获得了#G#m(%s)[%s]#m#n#c00FFFF#89的奖励！' },
}
local function 掉落包(玩家)
    local 银两 = 10000
    local 经验 = 869875
    local 法宝经验 = 248
    玩家:添加任务经验(经验, "挖宝妖王")
    玩家:添加银子(银两, "挖宝妖王")
    玩家:添加法宝经验(法宝经验)

    if math.random(700) > 600 then
        local 总几率 = math.random(138)
        local 几率 = 0
        for i, v in ipairs(_掉落) do
            几率 = 几率 + v.几率
            if 总几率 <= 几率 then
                local r = 生成物品 { 名称 = v.名称, 数量 = v.数量, 参数 = v.参数, 禁止交易 = v.禁止交易 }
                if r then
                    玩家:添加物品({ r })
                    if v.广播 then
                        玩家:发送系统(v.广播, 玩家.名称, r.nid, r.名称)
                    end
                    break
                end
            end
        end
    end






end

function 战斗:战斗结束(s)
    if s then
        for k, v in self:遍历我方() do
            if v.是否玩家 then
                掉落包(v.对象.接口)
            end
        end
    end
end

return 战斗
