local 战斗 = {}

function 战斗:战斗初始化(玩家)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local 怪物属性
    怪物属性 = {
        外形 = 2184,
        名称 = "李白",
        等级 = 等级,
        气血 = 2552154 ,
        魔法 = 20000 ,
        攻击 = 54584 ,
        速度 = 1584,
        抗性 = {
            物理吸收 = 69,
            抗震慑 = 44,
            抗封印 = 120,
            抗混乱 = 110,
            抗昏睡 = 105,
            附加震慑攻击 = 50,
            连击率 = 75,
            连击次数 = 9,
            反击率 = 75,
            反击次数 = 3,
            抗风 = 56,
            抗火 = 56,
            抗水 = 56,
            抗雷 = 56,
            忽视防御几率 = 75,
            忽视防御程度 = 75,
            命中率 = 80,
            狂暴几率 = 80,
            致命几率 = 80,
            被攻击时释放魔神附身 = 15
        },
        技能 = {
            { 名称 = "魔神附身", 熟练度 = 25000 },
            { 名称 = "魔神附身", 熟练度 = 25000 },
            { 名称 = "魔神附身", 熟练度 = 25000 },
            { 名称 = "兽王之力", 熟练度 = 25000 },
        },
        施法几率 = 5,
        是否消失 = false,
    }
    self:加入敌方(1, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 17,
        名称 = "司棋",
        等级 = 等级,
        气血 = 2552154 ,
        魔法 = 20000 ,
        攻击 = 19954 ,
        速度 = 1870,
        抗性 = {
            物理吸收 = 69,
            抗震慑 = 41,
            抗封印 = 120,
            抗混乱 = 110,
            抗昏睡 = 105,
            加强封印 = 50,
            加强毒 = 30,
            加强毒伤害 = 42158,
            加强昏睡 = 30,
            忽视抗封 = 30,
            忽视抗睡 = 22,
            忽视抗混 = 22,
            抗风 = -60,
            抗火 = -60,
            抗水 = 20,
            抗雷 = 20,
            反震几率 = 75,
            反震程度 = 75,
            火法反击 = 75,


        },
        技能 = {
            { 名称 = "四面楚歌", 熟练度 = 25000 },
            { 名称 = "万毒攻心", 熟练度 = 25000 },
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(2, 生成战斗怪物(怪物属性))


    怪物属性 = {
        外形 = 2113,
        名称 = "祝酒",
        等级 = 等级,
        气血 = 2552154 ,
        魔法 = 20000 ,
        攻击 = 19954 ,
        速度 = 1870,
        抗性 = {
            物理吸收 = 69,
            抗震慑 = 41,
            抗封印 = 120,
            抗混乱 = 110,
            抗昏睡 = 105,
            加强火 = 200,
            忽视抗火 = 100,
            抗风 = -60,
            抗火 = 100,
            抗水 = -60,
            抗雷 = 60,
            火法反击 = 75,
        },
        技能 = {
            { 名称 = "九阴纯火", 熟练度 = 25000 },
            { 名称 = "九阴纯火", 熟练度 = 25000 },
            { 名称 = "九阴纯火", 熟练度 = 25000 },
            { 名称 = "烈火骄阳", 熟练度 = 25000 }
        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(3, 生成战斗怪物(怪物属性))

    怪物属性 = {
        外形 = 12,
        名称 = "执灯",
        等级 = 等级,
        气血 = 2552154 ,
        魔法 = 20000 ,
        攻击 = 39954 ,
        速度 = 2800,
        抗性 = {
            物理吸收 = 10,
            抗震慑 = 60,
            抗封印 = 120,
            抗混乱 = 110,
            抗昏睡 = 105,
            附加震慑攻击 = 50,
            连击率 = 75,
            连击次数 = 9,
            反击率 = 75,
            反击次数 = 3,
            抗风 = -60,
            抗火 = -60,
            抗水 = 20,
            抗雷 = 20
        },
        技能 = {
            { 名称 = "阎罗追命", 熟练度 = 25000 },
            { 名称 = "含情脉脉", 熟练度 = 25000 },
        },
        施法几率 = 80,
        是否消失 = false,
    }
    self:加入敌方(4, 生成战斗怪物(怪物属性))
    怪物属性 = {
        外形 = 2160,
        名称 = "知砚",
        等级 = 等级,
        气血 = 2552154 ,
        魔法 = 20000 ,
        攻击 = 19954 ,
        速度 = 1870,
        抗性 = {
            物理吸收 = 49,
            抗震慑 = 36,
            抗封印 = 120,
            抗混乱 = 110,
            抗昏睡 = 105,
            加强封印 = 30,
            加强混乱 = 50,
            加强昏睡 = 30,
            忽视抗封 = 22,
            忽视抗睡 = 22,
            忽视抗混 = 30,
            抗风 = -60,
            抗火 = -60,
            抗水 = 20,
            抗雷 = 20,
            反震几率 = 75,
            反震程度 = 75,
            风法反击 = 15,
            雷法反击 = 15,
            被攻击时释放含情脉脉 = 75,
        },
        技能 = {
            { 名称 = "失心狂乱", 熟练度 = 25000 },
            { 名称 = "四面楚歌", 熟练度 = 25000 },

        },
        施法几率 = 100,
        是否消失 = false,
    }
    self:加入敌方(5, 生成战斗怪物(怪物属性))



end

function 战斗:战斗回合开始(dt)



end

function 战斗:战斗结束(x, y)
end

return 战斗
