local 战斗 = {
    是否惩罚 = false --死亡
}

function 战斗:战斗初始化(玩家)
    local 数量 = 6
    local 等级 = 玩家:取队伍最高等级()
    local 怪物属性
    怪物属性 = {
        外形 = 2167,
        名称 = "怪物1",
        等级 = 等级,
        气血 = 999999,
        魔法 = 999999,
        攻击 = 10,
        速度 = 1,
        抗性 = {
            -- 致命几率 = 20,
            -- 抗混乱 = 122,
            -- 抗封印 = 122,
            -- 抗昏睡 = 142,
            -- 抗中毒 = 72,
            -- 抗风 = 55,
            -- 抗火 = 55,
            -- 抗水 = 55,
            -- 抗雷 = 55,
            -- 加强混乱 = 24,
            -- 加强封印 = 24,
            -- 加强昏睡 = 24,
            -- 忽视抗混 = 12,
            -- 忽视抗印 = 12,
            -- 忽视抗睡 = 12,
            -- 加强毒 = 60,
            -- 忽视抗毒 = 42,
            -- 抗震慑 = 18,
            -- 物理吸收 = 75,
            -- 反震几率 = 75,
            -- 反震程度 = 75,
            -- 火法反击 = 105,
            -- 水法反击 = 105,
            -- 躲闪率 = 50,
            -- 连击率 = 10,
            -- 连击次数 = 3,
            -- 狂暴几率 = 5,
            -- 致命几率 = 5,
            -- 抗致命几率 = 0,
            -- 忽视防御几率 = 0,
            -- 忽视防御程度 = 0,
            -- 反击率 = 100,
            -- 反击次数 = 2,
        },
        技能 = {
            -- { 名称 = "隐身", 熟练度 = 50000 }, --女人的封印技能叫啥阿莱
            -- { 名称 = "作壁上观", 熟练度 = 50000 }, --这技能吸血是吧 是的
        },
        施法几率 = 100,
        是否消失 = false,
    }

    for i = 1, 数量 do
        怪物属性.名称 = '怪物' .. i
        怪物属性.目标 = i + 1
        self:加入敌方(i, 生成战斗怪物(怪物属性))
    end
end

function 战斗:进场喊话()
end

function 战斗:战斗回合开始(v)
    v.指令 = '防御'
    -- v.指令 = '法术'
    -- v.指令 = '物理'
    v.目标 = v.目标
    v.气血 = 9999999
    v.攻击 = 5000
    -- v.连击率 = 999999
    -- v.连击次数 = 5
end

function 战斗:战斗回合结束(v)
end

function 战斗:战斗开始(v)
end

function 战斗:战斗结束(v)
end

return 战斗
