-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-26 07:12:31
-- @Last Modified time  : 2022-09-06 19:03:03

local 战斗 = {
    是否惩罚 = false
}


local _boss = {
    [101299] = { 名称 = "万寿山神", 不可捕捉 = true, 外形 = 2101, 气血 = 8000000, 魔法 = 26980, 攻击 = 77510,速度 = 800 },
    [1004] = { 名称 = "山贼之灵", 不可捕捉 = true, 外形 = 2045, 气血 = 1000, 魔法 = 25, 攻击 = 10,速度 = 1, }, --大雁塔一层
    [1005] = { 名称 = "山贼之灵", 不可捕捉 = true, 外形 = 2045, 气血 = 1000, 魔法 = 25, 攻击 = 10,速度 = 1, }, --大雁塔一层
    [1006] = { 名称 = "山贼之灵", 不可捕捉 = true, 外形 = 2045, 气血 = 1000, 魔法 = 25, 攻击 = 10,速度 = 1, }, --大雁塔一层
    [1007] = { 名称 = "山贼之灵", 不可捕捉 = true, 外形 = 2045, 气血 = 1000, 魔法 = 25, 攻击 = 10,速度 = 1, }, --大雁塔一层
    [1008] = { 名称 = "山贼之灵", 不可捕捉 = true, 外形 = 2045, 气血 = 1000, 魔法 = 25, 攻击 = 10,速度 = 1, }, --大雁塔一层
    [1090] = { 名称 = "山贼之灵", 不可捕捉 = true, 外形 = 2045, 气血 = 1000, 魔法 = 25, 攻击 = 10,速度 = 1, }, --大雁塔一层
    [1194] = { 名称 = "晶晶姑娘", 不可捕捉 = true, 外形 = 2080, 气血 = 1000, 魔法 = 25, 攻击 = 10,速度 = 1, }, --五指山
    [1203] = { 名称 = "三当家", 不可捕捉 = true, 外形 = 2044, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --斧头帮
    [1186] = { 名称 = "炎之凤", 不可捕捉 = true, 外形 = 2071, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --凤巢一层
    [1187] = { 名称 = "炎之凤", 不可捕捉 = true, 外形 = 2071, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --凤巢一层
    [1188] = { 名称 = "炎之凤", 不可捕捉 = true, 外形 = 2071, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --凤巢一层
    [1189] = { 名称 = "炎之凤", 不可捕捉 = true, 外形 = 2071, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --凤巢一层
    [1190] = { 名称 = "炎之凤", 不可捕捉 = true, 外形 = 2071, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --凤巢一层
    [1191] = { 名称 = "炎之凤", 不可捕捉 = true, 外形 = 2071, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --凤巢一层
    [1192] = { 名称 = "炎之凤", 不可捕捉 = true, 外形 = 2071, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --凤巢一层
    [1174] = { 名称 = "翻天鬼", 不可捕捉 = true, 外形 = 2088, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --悲剧
    [1173] = { 名称 = "三十娘", 不可捕捉 = true, 外形 = 2079, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --大唐边境
    [1118] = { 名称 = "龙王", 不可捕捉 = true, 外形 = 14, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --海底迷宫
    [1119] = { 名称 = "龙王", 不可捕捉 = true, 外形 = 14, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --海底迷宫
    [1120] = { 名称 = "龙王", 不可捕捉 = true, 外形 = 14, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --海底迷宫
    [1121] = { 名称 = "龙王", 不可捕捉 = true, 外形 = 14, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --海底迷宫
    [101300] = { 名称 = "赤焰妖王", 不可捕捉 = true, 外形 = 2103, 气血 = 1000, 魔法 = 25, 攻击 = 10,速度 = 1, }, --白骨山
    [1091] = { 名称 = "避水金睛兽", 不可捕捉 = true, 外形 = 2041, 染色 = 0x03030303, 气血 = 1000,魔法 = 25, 攻击 = 10, 速度 = 1, }, --长寿村外
    [1177] = { 名称 = "天一神将", 不可捕捉 = true, 外形 = 2088, 气血 = 1000, 魔法 = 25, 攻击 = 10,速度 = 1, }, --龙窟1层
    [1178] = { 名称 = "天一神将", 不可捕捉 = true, 外形 = 2088, 染色 = 0x03030303, 气血 = 1000, 魔法 = 25,攻击 = 10, 速度 = 1, }, --龙窟1层
    [1179] = { 名称 = "天一神将", 不可捕捉 = true, 外形 = 2088, 染色 = 0x03030303, 气血 = 1000, 魔法 = 25,攻击 = 10, 速度 = 1, }, --龙窟1层
    [1180] = { 名称 = "天一神将", 不可捕捉 = true, 外形 = 2088, 染色 = 0x03030303, 气血 = 1000, 魔法 = 25,攻击 = 10, 速度 = 1, }, --龙窟1层
    [1181] = { 名称 = "天一神将", 不可捕捉 = true, 外形 = 2088, 染色 = 0x03030303, 气血 = 1000, 魔法 = 25,攻击 = 10, 速度 = 1, }, --龙窟1层
    [1182] = { 名称 = "天一神将", 不可捕捉 = true, 外形 = 2088, 染色 = 0x03030303, 气血 = 1000, 魔法 = 25,攻击 = 10, 速度 = 1, }, --龙窟1层
    [1183] = { 名称 = "天一神将", 不可捕捉 = true, 外形 = 2088, 染色 = 0x03030303, 气血 = 1000, 魔法 = 25,攻击 = 10, 速度 = 1, }, --龙窟1层
    [1201] = { 名称 = "九龙天兵", 不可捕捉 = true, 外形 = 2061, 气血 = 1000, 魔法 = 25, 攻击 = 10,速度 = 1, }, --瑶池
    [1129] = { 名称 = "绝地魔", 不可捕捉 = true, 外形 = 2072, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --地狱迷宫1
    [1127] = { 名称 = "绝地魔", 不可捕捉 = true, 外形 = 2072, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --地狱迷宫2
    [1130] = { 名称 = "绝地魔", 不可捕捉 = true, 外形 = 2072, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --地狱迷宫3
    [1128] = { 名称 = "绝地魔", 不可捕捉 = true, 外形 = 2072, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --地狱迷宫4
    [1131] = { 名称 = "疯牛怪", 不可捕捉 = true, 外形 = 2052, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --狮驼岭
    [1199] = { 名称 = "六耳灵猴", 不可捕捉 = true, 外形 = 2060, 气血 = 1000, 魔法 = 25, 攻击 = 10,速度 = 1, }, --御马监
    [1198] = { 名称 = "护园大将", 不可捕捉 = true, 外形 = 2068, 气血 = 1000, 魔法 = 25, 攻击 = 10,速度 = 1, }, --蟠桃园
    [1217] = { 名称 = "护园大将", 不可捕捉 = true, 外形 = 2068, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --蟠桃园后
    [101295] = { 名称 = "桃树精", 不可捕捉 = true, 外形 = 2095, 气血 = 1000, 魔法 = 25, 攻击 = 10,速度 = 1, }, --四圣庄
    [1193] = { 名称 = "食婴鬼的手下", 不可捕捉 = true, 外形 = 2017, 气血 = 1000, 魔法 = 25, 攻击 = 10,速度 = 1, }, --长安东
    [1140] = { 名称 = "护山黑熊精", 不可捕捉 = true, 外形 = 2006, 气血 = 1000, 魔法 = 25, 攻击 = 10,速度 = 1, }, --普陀山
    [1092] = { 名称 = "九头精怪", 不可捕捉 = true, 外形 = 2089, 气血 = 1000, 魔法 = 25, 攻击 = 10,速度 = 1, }, --傲来国
    [1110] = { 名称 = "食婴鬼", 不可捕捉 = true, 外形 = 2018, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, }, --大唐境内
} --女儿国
local _野怪 = {


    [1193] = {
        { 名称 = "海龟", 外形 = 2036, 气血 = 265, 魔法 = 1, 攻击 = 5, 速度 = 1 },
        { 名称 = "毒蛇", 外形 = 2031, 气血 = 265, 魔法 = 1, 攻击 = 5, 速度 = 1 }
    }, --长安城东

    [1110] = {
        { 名称 = "家丁", 外形 = 2047, 气血 = 1500, 魔法 = 36, 攻击 = 80, 速度 = 1 },
        { 名称 = "武士", 外形 = 2043, 气血 = 1500, 魔法 = 36, 攻击 = 80, 速度 = 1 },
        { 名称 = "士兵", 外形 = 2048, 气血 = 1500, 魔法 = 36, 攻击 = 80, 速度 = 1 },
        { 名称 = "衙役", 外形 = 2078, 气血 = 1500, 魔法 = 36, 攻击 = 80, 速度 = 1 }
    }, --大唐境内

    [1004] = {
        { 名称 = "兔妖", 外形 = 2001, 气血 = 1000, 魔法 = 25, 攻击 = 10, 速度 = 1, },
        { 名称 = "羊头怪", 外形 = 2007, 气血 = 1000, 魔法 = 65, 攻击 = 65, 速度 = 1, }
    }, --大雁塔一层

    [1005] = {
        { 名称 = "猪怪", 外形 = 2002, 气血 = 1200, 魔法 = 1000, 攻击 = 50, 速度 = 1, },
        { 名称 = "夜叉", 外形 = 2072, 气血 = 1200, 魔法 = 1000, 攻击 = 50, 速度 = 1,技能 = { { 名称 = "地狱烈火", 熟练度 = 1 }, { 名称 = "天雷怒火", 熟练度 = 1, } } } --大雁塔二层
    },
    [1006] = {
        { 名称 = "小妖", 外形 = 2004, 气血 = 1200, 魔法 = 1000, 攻击 = 50, 速度 = 1 },
        { 名称 = "牛妖", 外形 = 2066, 气血 = 1200, 魔法 = 1000, 攻击 = 50, 速度 = 1, }
    }, --大雁塔三层

    [1007] = {
        { 名称 = "花妖", 外形 = 2012, 气血 = 1200, 魔法 = 1000, 攻击 = 50, 速度 = 1, },
        { 名称 = "狐狸精", 外形 = 2059, 气血 = 1200, 魔法 = 1000, 攻击 = 50, 速度 = 1, }
    }, --大雁塔四层

    [1008] = {
        { 名称 = "女妖", 外形 = 2009, 气血 = 1200, 魔法 = 1000, 攻击 = 50, 速度 = 1, },
        { 名称 = "小龙女", 外形 = 2009, 气血 = 1200, 魔法 = 1000, 攻击 = 50, 速度 = 1,技能 = { { 名称 = "龙卷雨击", 熟练度 = 1 }, { 名称 = "龙腾水溅", 熟练度 = 1 } } },
    }, --大雁塔五层
    [1090] = {
        { 名称 = "骷髅怪", 外形 = 2017, 气血 = 1200, 魔法 = 1000, 攻击 = 50, 速度 = 1 },
        { 名称 = "千年老妖", 外形 = 2073, 气血 = 1200, 魔法 = 1000, 攻击 = 50, 速度 = 1,技能 = { { 名称 = "飞砂走石", 熟练度 = 1 }, { 名称 = "乘风破浪", 熟练度 = 1 } } },
        { 名称 = "战神女娲", 外形 = 2289, 气血 = 1200, 魔法 = 1000, 攻击 = 50, 速度 = 1,技能 = { { 名称 = "雷霆霹雳", 熟练度 = 1 }, { 名称 = "日照光华", 熟练度 = 1 } } }
    }, --大雁塔六层
    [1194] = {
        { 名称 = "流氓", 外形 = 2046, 气血 = 684, 魔法 = 25, 攻击 = 241, 速度 = 1 },
        { 名称 = "女贼", 外形 = 2020, 气血 = 684, 魔法 = 25, 攻击 = 241, 速度 = 1 },
        { 名称 = "山贼", 外形 = 2045, 气血 = 684, 魔法 = 25, 攻击 = 241, 速度 = 1 }
    }, --五指山

    [1203] = {
        { 名称 = "强盗", 外形 = 2044, 气血 = 3000, 魔法 = 150, 攻击 = 150, 速度 = 1 },
        { 名称 = "打手", 外形 = 2087, 气血 = 3000, 魔法 = 150, 攻击 = 150, 速度 = 1 }
    }, --斧头帮

    [1173] = {
        { 名称 = "野狗", 外形 = 2034, 气血 = 1000, 魔法 = 800, 攻击 = 50, 速度 = 1 },
        { 名称 = "毒蜂", 外形 = 2033, 气血 = 1000, 魔法 = 800, 攻击 = 50, 速度 = 1 },
        { 名称 = "鸡精", 外形 = 2003, 气血 = 1000, 魔法 = 800, 攻击 = 50, 速度 = 1 },
        { 名称 = "鳄鱼", 外形 = 2042, 气血 = 1000, 魔法 = 800, 攻击 = 50, 速度 = 1 },
        { 名称 = "银狐", 外形 = 2039, 气血 = 1000, 魔法 = 800, 攻击 = 50, 速度 = 1 },
        { 名称 = "老虎", 外形 = 2028, 气血 = 1000, 魔法 = 800, 攻击 = 50, 速度 = 1 },
        { 名称 = "狮子", 外形 = 2084, 气血 = 1000, 魔法 = 800, 攻击 = 50, 速度 = 1 },
        { 名称 = "大象", 外形 = 2085, 气血 = 1000, 魔法 = 800, 攻击 = 50, 速度 = 1 },
        { 名称 = "大鹏", 外形 = 2086, 气血 = 1000, 魔法 = 800, 攻击 = 50, 速度 = 1 }
    }, --大唐边境


    [1091] = {
        { 名称 = "黑熊", 外形 = 2029, 气血 = 3800, 魔法 = 6000, 攻击 = 480, 速度 = 1 },
        { 名称 = "鳄鱼", 外形 = 2042, 气血 = 3800, 魔法 = 6000, 攻击 = 480, 速度 = 1 }
    }, --长寿村外



    [1092] = {
        { 名称 = "树妖", 外形 = 2010, 气血 = 2500, 魔法 = 1000, 攻击 = 250, 速度 = 1 },
        { 名称 = "蛤蟆精", 外形 = 2022, 气血 = 2500, 魔法 = 1000, 攻击 = 250, 速度 = 1 }
    }, --傲来国

    [1118] = {
        { 名称 = "虾兵", 外形 = 2062, 气血 = 3000, 魔法 = 3000, 攻击 = 180, 速度 = 1 }
    }, --海底迷宫 1

    [1119] = {
        { 名称 = "蟹将", 外形 = 2063, 气血 = 3000, 魔法 = 3000, 攻击 = 180, 速度 = 1 }
    }, --海底迷宫 2

    [1120] = {
        { 名称 = "龟丞相", 外形 = 2064, 气血 = 3000, 魔法 = 3000, 攻击 = 180, 速度 = 1,技能 = { { 名称 = "龙卷雨击", 熟练度 = 1 }, { 名称 = "龙腾水溅", 熟练度 = 1 },{ 名称 = "龙啸九天", 熟练度 = 1 } } }
    }, --海底迷宫 3
    [1121] = {
        { 名称 = "水妖", 外形 = 2069, 气血 = 3000, 魔法 = 3000, 攻击 = 180, 速度 = 1,技能 = { { 名称 = "龙卷雨击", 熟练度 = 1 }, { 名称 = "龙腾水溅", 熟练度 = 1 },{ 名称 = "龙啸九天", 熟练度 = 1 } } },
        { 名称 = "复活女娲", 外形 = 2288, 气血 = 3000, 魔法 = 3000, 攻击 = 180, 速度 = 1,技能 = { { 名称 = "飞砂走石", 熟练度 = 1 }, { 名称 = "乘风破浪", 熟练度 = 1 },{ 名称 = "太乙生风", 熟练度 = 1 } } },
    }, --海底迷宫 4
    [1140] = {
        { 名称 = "黑熊精", 外形 = 2006, 气血 = 8000, 魔法 = 12000, 攻击 = 1250, 速度 = 1 },
    }, --普陀山

    [1129] = {
        { 名称 = "冤魂", 外形 = 2049, 气血 = 2300, 魔法 = 10000, 攻击 = 980, 速度 = 1 },
        { 名称 = "孤魂", 外形 = 2054, 气血 = 2300, 魔法 = 10000, 攻击 = 980, 速度 = 1 }
    }, --地狱迷宫 1

    [1127] = {
        { 名称 = "无头鬼", 外形 = 2057, 气血 = 2300, 魔法 = 10000, 攻击 = 980, 速度 = 1 },
        { 名称 = "无身鬼", 外形 = 2056, 气血 = 2300, 魔法 = 10000, 攻击 = 980, 速度 = 1 }
    }, --地狱迷宫 2

    [1130] = {
        { 名称 = "幽灵", 外形 = 2051, 气血 = 2300, 魔法 = 10000, 攻击 = 980, 速度 = 1 },
        { 名称 = "修罗", 外形 = 2050, 气血 = 2300, 魔法 = 10000, 攻击 = 980, 速度 = 1 },
        { 名称 = "符咒女娲", 外形 = 2292, 气血 = 2300, 魔法 = 10000, 攻击 = 980, 速度 = 1,技能 = { { 名称 = "雷霆霹雳", 熟练度 = 1 }, { 名称 = "日照光华", 熟练度 = 1 },{ 名称 = "雷神怒击", 熟练度 = 1 } } }
    }, --地狱迷宫 3

    [1128] = {
        { 名称 = "吸血鬼", 外形 = 2058, 气血 = 2300, 魔法 = 10000, 攻击 = 980, 速度 = 1 },
        { 名称 = "野鬼", 外形 = 2055, 气血 = 2300, 魔法 = 10000, 攻击 = 980, 速度 = 1 }
    }, --地狱迷宫 4

    [1174] = {
        { 名称 = "冰熊", 外形 = 2040, 气血 = 6800, 魔法 = 1800, 攻击 = 800, 速度 = 1 },
        { 名称 = "白虎", 外形 = 2038, 气血 = 6800, 魔法 = 1800, 攻击 = 800, 速度 = 1 },
        { 名称 = "两角怪", 外形 = 2013, 气血 = 6800, 魔法 = 1800, 攻击 = 800, 速度 = 1 }
    }, --北惧芦洲

    [1177] = {
        { 名称 = "三尾怪", 外形 = 2016, 气血 = 16000, 魔法 = 18000, 攻击 = 590, 速度 = 1 }
    }, --龙窟1层

    [1178] = {
        { 名称 = "鸟嘴兽", 外形 = 2014, 气血 = 16000, 魔法 = 18000, 攻击 = 590, 速度 = 1 }
    }, --龙窟2层

    [1179] = {
        { 名称 = "古代瑞兽", 外形 = 2041, 气血 = 16000, 魔法 = 18000, 攻击 = 590, 速度 = 1,技能 = { { 名称 = "雷霆霹雳", 熟练度 = 1 }, { 名称 = "日照光华", 熟练度 = 1 },{ 名称 = "雷神怒击", 熟练度 = 1 } } }
    }, --龙窟3层

    [1180] = {
        { 名称 = "寒钢怪", 外形 = 2008, 气血 = 16000, 魔法 = 18000, 攻击 = 590, 速度 = 1,技能 = { { 名称 = "雷霆霹雳", 熟练度 = 1 }, { 名称 = "日照光华", 熟练度 = 1 },{ 名称 = "雷神怒击", 熟练度 = 1 } } }
    }, --龙窟4层

    [1181] = {
        { 名称 = "死灵", 外形 = 2027, 气血 = 16000, 魔法 = 18000, 攻击 = 590, 速度 = 1 }
    }, --龙窟5层

    [1182] = {
        { 名称 = "地狱战神", 外形 = 2074, 气血 = 16000, 魔法 = 18000, 攻击 = 590, 速度 = 1,技能 = { { 名称 = "雷霆霹雳", 熟练度 = 1 }, { 名称 = "日照光华", 熟练度 = 1 },{ 名称 = "雷神怒击", 熟练度 = 1 } } }
    }
    , --龙窟6层

    [1183] = {
        { 名称 = "蛟龙", 外形 = 2070, 气血 = 16000, 魔法 = 18000, 攻击 = 590, 速度 = 1,技能 = { { 名称 = "龙卷雨击", 熟练度 = 1 }, { 名称 = "龙腾水溅", 熟练度 = 1 },{ 名称 = "龙啸九天", 熟练度 = 1 } } },
        { 名称 = "火神女娲", 外形 = 2291, 气血 = 16000, 魔法 = 18000, 攻击 = 590, 速度 = 1,技能 = { { 名称 = "地狱烈火", 熟练度 = 1 }, { 名称 = "天雷怒火", 熟练度 = 1 },{ 名称 = "三味真火", 熟练度 = 1 } } }
    }, --龙窟7层

    [1186] = {
        { 名称 = "蜘蛛精", 外形 = 2065, 气血 = 16000, 魔法 = 18000, 攻击 = 590, 速度 = 1,技能 = { { 名称 = "飞砂走石", 熟练度 = 1 }, { 名称 = "乘风破浪", 熟练度 = 1 },{ 名称 = "太乙生风", 熟练度 = 1 } } }
    }, --凤巢1层

    [1187] = {
        { 名称 = "冲冲虫", 外形 = 2005, 气血 = 16000, 魔法 = 18000, 攻击 = 590, 速度 = 1,技能 = { { 名称 = "红袖添香", 熟练度 = 1 }, { 名称 = "莲步轻舞", 熟练度 = 1 },{ 名称 = "楚楚可怜", 熟练度 = 1 } } }
    }, --凤巢2层

    [1188] = {
        { 名称 = "蝴蝶仙子", 外形 = 2011, 气血 = 16000, 魔法 = 18000, 攻击 = 590, 速度 = 1 }
    }, --凤巢3层

    [1189] = {
        { 名称 = "雷鸟人", 外形 = 2023, 气血 = 16000, 魔法 = 18000, 攻击 = 590, 速度 = 1 }
    }, --凤巢4层

    [1190] = {
        { 名称 = "独眼巨人", 外形 = 2018, 气血 = 16000, 魔法 = 18000, 攻击 = 590, 速度 = 1 }
    }, --凤巢5层

    [1191] = {
        { 名称 = "野蛮王", 外形 = 2026, 气血 = 16000, 魔法 = 18000, 攻击 = 590, 速度 = 1,技能 = { { 名称 = "地狱烈火", 熟练度 = 1 }, { 名称 = "天雷怒火", 熟练度 = 1 },{ 名称 = "三味真火", 熟练度 = 1 } } }
    }, --凤巢6层

    [1192] = {
        { 名称 = "凤凰", 外形 = 2071, 气血 = 16000, 魔法 = 18000, 攻击 = 590, 速度 = 1,技能 = { { 名称 = "地狱烈火", 熟练度 = 1 }, { 名称 = "天雷怒火", 熟练度 = 1 },{ 名称 = "三味真火", 熟练度 = 1 } } },
        { 名称 = "舍生女娲", 外形 = 2290, 气血 = 16000, 魔法 = 18000, 攻击 = 590, 速度 = 1,技能 = { { 名称 = "雷霆霹雳", 熟练度 = 1 }, { 名称 = "日照光华", 熟练度 = 1 },{ 名称 = "雷神怒击", 熟练度 = 1 } } }
    }, --凤巢7层

    [1199] = {
        { 名称 = "猴精", 外形 = 2060, 气血 = 19000, 魔法 = 13000, 攻击 = 9200, 速度 = 1 }
    }, --御马监

    [1201] = {
        { 名称 = "神兵", 外形 = 2061, 气血 = 18000, 魔法 = 13000, 攻击 = 8600, 速度 = 1 }
    }, --瑶池
    [1198] = {
        { 名称 = "神灵", 外形 = 2068, 气血 = 19000, 魔法 = 13000, 攻击 = 9200, 速度 = 1,技能 = { { 名称 = "飞砂走石", 熟练度 = 1 }, { 名称 = "乘风破浪", 熟练度 = 1 },{ 名称 = "太乙生风", 熟练度 = 1 } } }
    }, --蟠桃园
    [1217] = {
        { 名称 = "神灵", 外形 = 2068, 气血 = 19000, 魔法 = 13000, 攻击 = 9200, 速度 = 1,技能 = { { 名称 = "飞砂走石", 熟练度 = 1 }, { 名称 = "乘风破浪", 熟练度 = 1 },{ 名称 = "太乙生风", 熟练度 = 1 } } }
    }, --蟠桃园后

    [1131] = {
        { 名称 = "精怪", 外形 = 2019, 气血 = 8000, 魔法 = 12000, 攻击 = 680, 速度 = 1 },
        { 名称 = "山妖", 外形 = 2025, 气血 = 8000, 魔法 = 12000, 攻击 = 680, 速度 = 1 },
        { 名称 = "鼠怪", 外形 = 2021, 气血 = 8000, 魔法 = 12000, 攻击 = 680, 速度 = 1 }
    }, --狮驼岭

    [101295] = {
        { 名称 = "桃树精", 外形 = 2095, 气血 = 16587, 魔法 = 35288, 攻击 = 7510, 速度 = 1 },
        { 名称 = "桃花仙", 外形 = 2096, 气血 = 16587, 魔法 = 35288, 攻击 = 7510, 速度 = 1,技能 = { { 名称 = "龙卷雨击", 熟练度 = 1 }, { 名称 = "龙腾水溅", 熟练度 = 1 },{ 名称 = "龙啸九天", 熟练度 = 1 } } },
        { 名称 = "黄金兽", 外形 = 2097, 气血 = 16587, 魔法 = 35288, 攻击 = 7510, 速度 = 1 },
        { 名称 = "金刚仙", 外形 = 2098, 气血 = 16587, 魔法 = 35288, 攻击 = 7510, 速度 = 1,技能 = { { 名称 = "雷霆霹雳", 熟练度 = 1 }, { 名称 = "日照光华", 熟练度 = 1 },{ 名称 = "雷神怒击", 熟练度 = 1 } } } --四圣庄
    },

    [101299] = {
        { 名称 = "冰雪魔", 外形 = 2099, 气血 = 25982, 魔法 = 26980, 攻击 = 7510, 速度 = 1 },
        { 名称 = "水灵仙", 外形 = 2100, 气血 = 25982, 魔法 = 26980, 攻击 = 7510, 速度 = 1,技能 = { { 名称 = "龙卷雨击", 熟练度 = 1 }, { 名称 = "龙腾水溅", 熟练度 = 1 },{ 名称 = "龙啸九天", 熟练度 = 1 } } },
        { 名称 = "泥石怪", 外形 = 2101, 气血 = 25982, 魔法 = 26980, 攻击 = 7510, 速度 = 1 },
        { 名称 = "食土兽", 外形 = 2102, 气血 = 25982, 魔法 = 26980, 攻击 = 7510, 速度 = 1,技能 = { { 名称 = "飞砂走石", 熟练度 = 1 }, { 名称 = "乘风破浪", 熟练度 = 1 },{ 名称 = "太乙生风", 熟练度 = 1 } } } --万寿山
    },

    [101300] = {
        { 名称 = "赤焰妖", 外形 = 2103, 气血 = 25982, 魔法 = 26980, 攻击 = 7510, 速度 = 1,技能 = { { 名称 = "雷霆霹雳", 熟练度 = 1 }, { 名称 = "日照光华", 熟练度 = 1 },{ 名称 = "雷神怒击", 熟练度 = 1 } } },
        { 名称 = "喷火牛", 外形 = 2104, 气血 = 25982, 魔法 = 26980, 攻击 = 7510, 速度 = 1,技能 = { { 名称 = "地狱烈火", 熟练度 = 1 }, { 名称 = "天雷怒火", 熟练度 = 1 },{ 名称 = "三味真火", 熟练度 = 1 } } },
        { 名称 = "麒麟兽", 外形 = 2105, 气血 = 25982, 魔法 = 26980, 攻击 = 7510, 速度 = 1,技能 = { { 名称 = "雷霆霹雳", 熟练度 = 1 }, { 名称 = "日照光华", 熟练度 = 1 },{ 名称 = "雷神怒击", 熟练度 = 1 } } }
    }, --白骨山






} --女儿国

local _掉落奖励 = {
    [1006] = { { name = "天书残卷第一卷", 几率 = 2 }, { name = "蟠桃", 几率 = 2 } }, --大雁塔3
    [1118] = { { name = "天书残卷第一卷", 几率 = 2 }, { name = "蟠桃", 几率 = 2 } }, --海底迷宫1
    [1119] = { { name = "天书残卷第一卷", 几率 = 2 }, { name = "蟠桃", 几率 = 2 } }, --海底迷宫2
    [1120] = { { name = "天书残卷第一卷", 几率 = 2 }, { name = "蟠桃", 几率 = 2 } }, --海底迷宫3
    [1121] = { { name = "天书残卷第一卷", 几率 = 2 }, { name = "蟠桃", 几率 = 2 } }, --海底迷宫4
    [1129] = { { name = "天书残卷第一卷", 几率 = 2 }, { name = "天书残卷第二卷", 几率 = 2 },{ name = "蟠桃", 几率 = 2 } }, --地狱迷宫1
    [1127] = { { name = "天书残卷第一卷", 几率 = 2 }, { name = "天书残卷第二卷", 几率 = 2 },{ name = "蟠桃", 几率 = 2 } }, --地狱迷宫2
    [1130] = { { name = "天书残卷第一卷", 几率 = 2 }, { name = "天书残卷第二卷", 几率 = 2 },{ name = "蟠桃", 几率 = 2 } }, --地狱迷宫3
    [1128] = { { name = "天书残卷第一卷", 几率 = 2 }, { name = "天书残卷第二卷", 几率 = 2 },{ name = "蟠桃", 几率 = 2 } }, --地狱迷宫4
    [1173] = { { name = "天书残卷第二卷", 几率 = 2 }, { name = "蟠桃", 几率 = 2 } }, --大唐边境
    [1179] = { { name = "天书残卷第二卷", 几率 = 2 }, { name = "蟠桃", 几率 = 2 } }, --龙窟三层
    [1131] = { { name = "天书残卷第三卷", 几率 = 2 }, { name = "蟠桃", 几率 = 2 } }, --狮驼岭
    [1180] = { { name = "天书残卷第三卷", 几率 = 2 }, { name = "蟠桃", 几率 = 2 } }, --龙窟四层
    [1189] = { { name = "天书残卷第三卷", 几率 = 2 }, { name = "蟠桃", 几率 = 2 } }, --凤巢四层
    [1188] = { { name = "天书残卷第四卷", 几率 = 2 }, { name = "蟠桃", 几率 = 2 } }, --凤巢三层
    [1199] = { { name = "天书残卷第四卷", 几率 = 2 }, { name = "蟠桃", 几率 = 2 } }, --御马监
    [1192] = { { name = "天书残卷第四卷", 几率 = 2 }, { name = "蟠桃", 几率 = 2 } }, --御马监
    [1217] = { { name = "天书残卷第五卷", 几率 = 2 }, { name = "蟠桃", 几率 = 2 } }, --蟠桃园后
    [101299] = { { name = "天书残卷第五卷", 几率 = 2 }, { name = "蟠桃", 几率 = 2 } }, --万寿山
    [101300] = { { name = "天书残卷第五卷", 几率 = 2 }, { name = "天书残卷第六卷", 几率 = 2 },{ name = "蟠桃", 几率 = 2 } }, --白骨山
    [101295] = { { name = "天书残卷第六卷", 几率 = 2 }, { name = "蟠桃", 几率 = 2 } }, --四圣庄

}



local function _取boss属性(玩家, id)
    local list = {}
    local t = _boss[id]
    if t then
        for k, v in pairs(t) do
            list[k] = v
        end
        return list
    end
end

local function _取怪物属性(玩家, id)
    local list = {}
    local t = _野怪[id][math.random(#_野怪[id])]
    for k, v in pairs(t) do
        list[k] = v
    end
    return list
end
local _提示 = "#Y你有幸遇到了正在闲逛的#R%s#Y，有余季度你的长相,#R%s#Y狠狠的瞪了你一眼,二话不说已经对你发起了攻击！"
function 战斗:战斗初始化(玩家, id, min, max)

    if _boss[id] then
        self.mapid = id
        self.mapleve=max
        local n = 1
        local name = _boss[id].名称
        if not 玩家.是否组队 then
            n = math.random(2, 3)
            玩家:常规提示(_提示,name,name)
        else
            玩家:常规提示_队伍(_提示,name,name)
            n = 玩家:取队伍人数()
            n = math.random(n + 1, n * 2 + 1)
        end
        if n > 10 then
            n = 10
        end
        local t
        for i = 1, n do
            if i == 1 then
                t = _取boss属性(玩家, id)
            else
                t = _取怪物属性(玩家, id)
            end

            if t then
                t.原名 = t.名称
                t.等级 = max
                self:加入敌方(i, 生成战斗怪物(t))
            end
        end

    else
        self.mapleve=100
        for i = 1, 1 do
            local r = 生成战斗怪物 {
                外形 = 38,
                名称 = '野怪信息需补充',
                攻击 = 1,
                速度 = 10,
                气血 = 100,
            }
            self:加入敌方(i, r)
        end
    end

end

--熟练度 l*100
function 战斗:战斗回合开始(v)

end

function 战斗:战斗回合结束(v)


end

local function _掉落包(玩家, mapid)
    local t = _掉落奖励[mapid]
    for i, v in ipairs(t) do
        if math.random(1000) <= v.几率 then
            玩家:添加物品({ 生成物品 { 名称 = v.name, 数量 = 1 } })
            break
        end
    end
end

function 战斗:战斗结束(v)
    if v then
        for _, v in self:遍历我方() do
            if v.是否玩家 then
              --  local dj, mapid = v.对象.接口:取当前地图等级()
                local 经验 = math.floor((self.mapleve  + 1) * 190 * 2)
                local 银子 = math.floor((self.mapleve  + 1) * 10 * 2)
                local 师贡 = math.floor((self.mapleve  + 1) * 10 * 2)
                if v.对象.接口.是否队长 then
                    经验 = math.floor(经验 * 1.05)
                    银子 = math.floor(银子 * 1.05)
                end
                if _掉落奖励[self.mapid ] then
                    _掉落包(v.对象.接口, self.mapid)
                end
                v.对象.接口:添加银子(银子)
                v.对象.接口:添加师贡(师贡)
                v.对象.接口:添加任务经验(经验, "野外")
                v.对象.接口:添加坐骑经验(self.mapleve , 50)

            end
            -- print(k, v.对象,v.对象.接口, v.名称, v.是否召唤)
        end
    end
end

return 战斗
