local 战斗 = {}
local _怪物 = {
    {
        名称 = "金",
        外形 = 2058,
        气血 = 900000,
        魔法 = 12000,
        攻击 = 60000,
        速度 = 500,
        抗性 = {
            抗震慑 = 50,
            抗混乱 = 50,
            抗封印 = 50,
            抗昏睡 = 50,
            抗中毒 = 50,

        },
        技能 = {
            { 名称 = "天罗地网", 熟练度 = 10000 },
            { 名称 = "断肠烈散", 熟练度 = 10000 },
            { 名称 = "谗言相加", 熟练度 = 10000 },
            { 名称 = "断肠烈散", 熟练度 = 10000 },
            { 名称 = "太乙生风", 熟练度 = 10000 },
            { 名称 = "三味真火", 熟练度 = 10000 },
            { 名称 = "雷神怒击", 熟练度 = 10000 },
            { 名称 = "龙啸九天", 熟练度 = 10000 },
        }

    },
    {
        名称 = "银",
        外形 = 2073,
        气血 = 900000,
        魔法 = 12000,
        攻击 = 60000,
        速度 = 500,

        抗性 = {
            抗混乱 = 50,
            抗封印 = 50,
            抗昏睡 = 50,

        },
        技能 = {
            { 名称 = "天罗地网", 熟练度 = 10000 },
            { 名称 = "断肠烈散", 熟练度 = 10000 },
            { 名称 = "谗言相加", 熟练度 = 10000 },
            { 名称 = "断肠烈散", 熟练度 = 10000 },
            { 名称 = "太乙生风", 熟练度 = 10000 },
            { 名称 = "三味真火", 熟练度 = 10000 },
            { 名称 = "雷神怒击", 熟练度 = 10000 },
            { 名称 = "龙啸九天", 熟练度 = 10000 },
        }
    },
    {
        名称 = "铜",
        外形 = 2072,
        气血 = 900000,
        魔法 = 12000,
        攻击 = 60000,
        速度 = 500,
        抗性 = {
            抗水 = 50,
            抗雷 = 50,
            抗火 = 50,
            抗风 = 50,
            抗混乱 = 50,
            抗封印 = 50,
            抗昏睡 = 50,

        },
        技能 = {
            { 名称 = "天罗地网", 熟练度 = 10000 },
            { 名称 = "断肠烈散", 熟练度 = 10000 },
            { 名称 = "谗言相加", 熟练度 = 10000 },
            { 名称 = "断肠烈散", 熟练度 = 10000 },
            { 名称 = "太乙生风", 熟练度 = 10000 },
            { 名称 = "三味真火", 熟练度 = 10000 },
            { 名称 = "雷神怒击", 熟练度 = 10000 },
            { 名称 = "龙啸九天", 熟练度 = 10000 },


        }

    },
    {
        名称 = "铁",
        外形 = 2049,
        气血 = 900000,
        魔法 = 12000,
        攻击 = 60000,
        速度 = 500,
        抗性 = {
            物理吸收 = 100,
            抗混乱 = 50,
            抗封印 = 50,
            抗昏睡 = 50,

        },
        技能 = {
            { 名称 = "天罗地网", 熟练度 = 10000 },
            { 名称 = "断肠烈散", 熟练度 = 10000 },
            { 名称 = "谗言相加", 熟练度 = 10000 },
            { 名称 = "断肠烈散", 熟练度 = 10000 },
            { 名称 = "太乙生风", 熟练度 = 10000 },
            { 名称 = "三味真火", 熟练度 = 10000 },
            { 名称 = "雷神怒击", 熟练度 = 10000 },
            { 名称 = "龙啸九天", 熟练度 = 10000 },
        }

    },
}

function 战斗:战斗初始化(玩家)
    for i = 1, 4 do
        local r = 生成战斗怪物(_怪物[i])
        self:加入敌方(i, r)
    end
end

function 战斗:战斗回合开始(v)
end

function 战斗:战斗回合结束(v)

end

function 战斗:战斗开始(v)

end

function 战斗:战斗结束(s)
    if s then
        for k, v in self:遍历我方() do
            if v.是否玩家 then
                local r = v.对象.接口:取物品是否存在("冥钞")
                if r then
                    return
                end
                v.对象.接口:添加物品({ 生成物品 { 名称 = '冥钞', 禁止交易 = true, 数量 = 1 } })
            end
        end
    end
end

return 战斗
