return {
    我的收购 = {
        不限制属性物品 = { "一阶仙器","神兵礼盒", "4-8级炼妖石", "9-12级炼妖石", "13级炼妖石", "一级宝石", "宝石精华", "三清丹" }, --"普通宝石",
        最近收购列表 = {}
    },
    作坊 = {
        原料 = { "血玲珑", "九彩云龙珠(低)", "九彩云龙珠(中)", "九彩云龙珠(高)", "内丹精华", "落魂砂(低)", "落魂砂(中)", "落魂砂(高)" }
    },
    召唤兽 = {
        培养物品 = { "灵兽要诀", "万兽要诀", "圣兽要诀", "终极技能修炼丹", "凝精聚气丹", "龙凤石", "高级金柳露", "超级金柳露", "九转易筋丸", "龙之骨", "龙涎丸", "混元丹", "变色丹", "超级变色丹", "超级元气丹" },
        合成物品 = { "天书残卷第一卷", "天书残卷第二卷", "天书残卷第三卷", "天书残卷第四卷", "天书残卷第五卷", "天书残卷第六卷", "天书残卷第七卷", "天书残卷第八卷", "天书残卷第九卷", "天书残卷第十卷", "珍稀神兽碎片", "神兽碎片" },
    },
    打造 = {
        矿石 = { "千年寒铁", "天外飞石", "盘古精铁", "补天神石" },
        高级培养 = { "六魂之玉", "无量琉璃", "悔梦石", "神兵石" },
    },
    药品 = {
        百分比药 = { "千年熊胆", "仙鹿茸", "海蓝石", "修罗玉", "夜叉石" },
        双加药 = { "清风白雪", "白露为霜", "红雪散", "孔雀明王羽" },
    },
    养育系统 = {
        生育用品 = { "子母河水", "落婴果" },
        引导物品 = { "玉佩", "戒指", "三字经", "千字文", "鬼谷子", "六韬三略", "内功心法", "百年雪莲", "百年茯苓", "百年何首乌" },
        培养用品 = { "猕猴桃", "无字天书", "启元丹", "点金石", "毓秀石" },
        学习用品 = { "琴谱", "诗经", "剑诀", "孙子兵法" },
    },
    其他 = {
        挖宝 = { "见闻录", "高级藏宝图", "指南录", "超级藏宝图" },
        变身卡 = { "返老还童丹", "五叶卡", "垂云叟卡", "颜如玉卡", "浪淘沙卡", "范式之魂卡", "精卫卡", "迦楼罗王卡", "冥灵妃子卡", "年卡", "画中仙卡", "龙马卡", "吉祥果卡", "金不换卡", "画皮娘子卡", "松鼠卡", "当康卡", "赭炎卡", "孔雀明王卡", "剑精灵卡", "狮蝎卡", "小牛魔王卡", "哥俩好卡" },
        属性卡 = { "五叶属性卡", "垂云叟属性卡", "颜如玉属性卡", "浪淘沙属性卡", "范式之魂属性卡", "精卫属性卡", "迦楼罗王属性卡", "冥灵妃子属性卡", "年属性卡", "画中仙属性卡", "龙马属性卡", "吉祥果属性卡", "金不换属性卡", "画皮娘子属性卡", "松鼠属性卡", "当康属性卡", "赭炎属性卡", "孔雀明王属性卡", "剑精灵属性卡", "狮蝎属性卡", "小牛魔王属性卡", "哥俩好属性卡" },
    },
}
