return {
    技能描述 = {
        淘气 = "#Y淘气\n#W增加AP",
        天真 = "#Y天真\n#W增加HP",
        好奇 = "#Y好奇\n#W增加MP",
        先发制人 = "#Y先发制人\n#W每回合在所有战斗单位先出手前有#G%s％#W几率对你释放单体的加速法术，该法术效果为增加200SP，持续时间为1回合",
        龙腾 = "#Y龙腾\n#W每回合在所有战斗单位先出手前有#G%s％#W几率对你释放单体的加速法术，该法术效果为增加200SP，持续时间为1回合",
        清风徐来 = "#Y清风徐来\n#W使用多体风系法术时有#G%s％#W几率增加一个攻击单位",
        风卷残云 = "#Y风卷残云\n#W使用多体风系法术时有#G%s％#W几率增加一个攻击单位",
        激流暗涌 = "#Y激流暗涌\n#W使用多体水系法术时有#G%s％#W几率增加一个攻击单位",
        排江倒海 = "#Y排江倒海\n#W使用多体水系法术时有#G%s％#W几率增加一个攻击单位",
        江枫渔火 = "#Y江枫渔火\n#W使用多体火系法术时有#G%s％#W几率增加一个攻击单位",
        芳华绝代 = "#Y芳华绝代\n#W使用多体火系法术时有#G%s％#W几率增加一个攻击单位",
        紫电一闪 = "#Y紫电一闪\n#W使用多体雷系法术时有#G%s％#W几率增加一个攻击单位",
        雷霆万钧 = "#Y雷霆万钧\n#W使用多体雷系法术时有#G%s％#W几率增加一个攻击单位",
        震慑强化 = "#Y震慑强化\n#W使用震慑法术时有#G%s％#W几率增加一个攻击单位",
        摄气诀 = "#Y摄气诀\n#W使用震慑法术时有#G%s％#W几率增加一个攻击单位",
        水系吸收 = "#Y水系吸收\n#W受到水系法术攻击时有40％几率减少#G%s#W伤害",
        玄冰甲 = "#Y玄冰甲\n#W受到水系法术攻击时有40％几率减少#G%s#W伤害",
        火系吸收 = "#Y火系吸收\n#W受到火系法术攻击时有40％几率减少#G%s#W伤害",
        烈火甲 = "#Y烈火甲\n#W受到火系法术攻击时有40％几率减少#G%s#W伤害",
        雷系吸收 = "#Y雷系吸收\n#W受到雷系法术攻击时有40％几率减少#G%s#W伤害",
        天雷甲 = "#Y天雷甲\n#W受到雷系法术攻击时有40％几率减少#G%s#W伤害",
        风系吸收 = "#Y风系吸收\n#W受到风系法术攻击时有40％几率减少#G%s#W伤害",
        狂风甲 = "#Y狂风甲\n#W受到风系法术攻击时有40％几率减少#G%s#W伤害",
        破甲 = "#Y破甲\n#W物理攻击时有#G%s％#W几率达到100％命中效果",
        嗜血狂攻 = "#Y嗜血狂攻\n#W物理攻击时有#G%s％#W几率达到100％命中效果",
        混乱术 = "#Y混乱术\n#W使用多体混乱法术时有#G%s％#W几率增加一个攻击单位",
        孙子兵法 = "#Y孙子兵法\n#W使用多体混乱法术时有#G%s％#W几率增加一个攻击单位",
        封印术 = "#Y封印术\n#W使用多体封印法术时有#G%s％#W几率增加一个攻击单位",
        千里冰封 = "#Y千里冰封\n#W使用多体封印法术时有#G%s％#W几率增加一个攻击单位",
        猛毒术 = "#Y猛毒术\n#W使用多体毒法术时有#G%s％#W几率增加一个攻击单位",
        肝肠寸断 = "#Y肝肠寸断\n#W使用多体毒法术时有#G%s％#W几率增加一个攻击单位",
        昏睡术 = "#Y昏睡术\n#W使用多体昏睡法术时有#G%s％#W几率增加一个攻击单位",
        摇篮曲 = "#Y摇篮曲\n#W使用多体昏睡法术时有#G%s％#W几率增加一个攻击单位",
        清心咒 = "#Y清心咒\n#W被混乱时每回合有#G%s％#W几率自行摆脱",
        莲台心法 = "#Y莲台心法\n#W被混乱时每回合有#G%s％#W几率自行摆脱",
        破冰术 = "#Y破冰术\n#W被封印时每回合有#G%s％#W几率自行摆脱",
        飞龙在天 = "#Y飞龙在天\n#W被封印时每回合有#G%s％#W几率自行摆脱",
        解毒术 = "#Y解毒术\n#W每回合有#G%s％#W几率从中毒状态中解脱",
        丹青妙手 = "#Y丹青妙手\n#W每回合有#G%s％#W几率从中毒状态中解脱",
        定心咒 = "#Y定心咒\n#W被震慑法术攻击时有#G%s％#W几率不减MP",
        龙神心法 = "#Y龙神心法\n#W被震慑法术攻击时有#G%s％#W几率不减MP",
        铁布衫 = "#Y铁布衫\n#W有#G%s％#W几率抵消每回合第一次物理攻击",
        金刚护体 = "#Y金刚护体\n#W有#G%s％#W几率抵消每回合前两次物理攻击",
        幽冥冷火 = "#Y幽冥冷火\n#W使用多体鬼火法术时有#G%s％#W几率增加一个攻击单位",
        鬼火追人 = "#Y鬼火追人\n#W使用多体鬼火法术时有#G%s％#W几率增加一个攻击单位",
        玉枕尸虫 = "#Y玉枕尸虫\n#W使用多体三尸虫法术时有#G%s％#W几率增加一个攻击单位",
        尾闾尸虫 = "#Y尾闾尸虫\n#W使用多体三尸虫法术时有#G%s％#W几率增加一个攻击单位",
        忘川水煮 = "#Y忘川水煮\n#W使用多体遗忘法术时有#G%s％#W几率增加一个攻击单位",
        三生无石 = "#Y三生无石\n#W使用多体遗忘法术时有#G%s％#W几率增加一个攻击单位",
        鬼火吸收 = "#Y鬼火吸收\n#W受到鬼火法术攻击时有40％几率减少#G%s#W伤害",
        冥火甲 = "#Y冥火甲\n#W受到鬼火法术攻击时有40％几率减少#G%s#W伤害",
        蟠龙术 = "#Y蟠龙术\n#W使用多体霹雳法术时有#G%s％#W几率增加一个目标",
        双龙戏珠 = "#Y双龙戏珠\n#W使用多体霹雳法术时有#G%s％#W几率增加一个目标",
        润物诀 = "#Y润物诀\n#W使用多体甘霖法术时有#G%s％#W几率增加一个目标",
        碧木双生 = "#Y碧木双生\n#W使用多体甘霖法术时有#G%s％#W几率增加一个目标"
    },
    整数范围 = {
        水系吸收 = true,
        玄冰甲 = true,
        火系吸收 = true,
        烈火甲 = true,
        雷系吸收 = true,
        天雷甲 = true,
        风系吸收 = true,
        狂风甲 = true,
        鬼火吸收 = true,
        冥火甲 = true
    },
    取孩子技能几率 = function(评价, 亲密, 孝心, 技能)
        local 评价系数 = 评价 * (0.4 + 8 * 10 ^ -4 * (亲密 + 孝心)) * 0.01
        local 几率 = 0
        if 技能 == "金刚护体" or 技能 == "嗜血狂攻" then -- 43.4824
            几率 = 评价系数
        elseif 技能 == "猛毒术" or 技能 == "飞龙在天" or 技能 == "忘川水煮" then --13.04
            几率 = 0.3 * 评价系数
        elseif 技能 == "龙腾" or 技能 == "清风徐来" or 技能 == "激流暗涌" or 技能 == "江枫渔火" or 技能 == "紫电一闪" or 技能 == "玉枕尸虫" or 技能 == "幽冥冷火" then -- 16.30
            几率 = 0.375 * 评价系数
        elseif 技能 == "玄冰甲" or 技能 == "烈火甲" or 技能 == "天雷甲" or 技能 == "狂风甲" then --26089.44
            几率 = 600 * 评价系数
        elseif 技能 == "冥火甲" then -- 23915.32
            几率 = 550 * 评价系数
        elseif 技能 == "孙子兵法" or 技能 == "千里冰封" or 技能 == "肝肠寸断" or 技能 == "先发制人" or 技能 == "摄气诀" then --10.87
            几率 = 0.25 * 评价系数
        elseif 技能 == "水系吸收" or 技能 == "火系吸收" or 技能 == "雷系吸收" or 技能 == "风系吸收" then -- 19567.07
            几率 = 450 * 评价系数
        elseif 技能 == "鬼火吸收" then -- 17392.96
            几率 = 400 * 评价系数
        elseif 技能 == "定心咒" or 技能 == "风卷残云" or 技能 == "排江倒海" or 技能 == "芳华绝代" or 技能 == "雷霆万钧" or 技能 == "鬼火追人" then --21.74
            几率 = 0.5 * 评价系数
        elseif 技能 == "混乱术" or 技能 == "封印术" or 技能 == "昏睡术" or 技能 == "震慑强化" or 技能 == "清心咒" then -- 7.60
            几率 = 0.175 * 评价系数
        elseif 技能 == "摇篮曲" or 技能 == "三生无石" then -- 17.39
            几率 = 0.4 * 评价系数
        elseif 技能 == "破冰术" or 技能 == "解毒术" then -- 8.69
            几率 = 0.2 * 评价系数
        elseif 技能 == "龙神心法" or 技能 == "破甲" or 技能 == "铁布衫" or 技能 == "丹青妙手" then --32.61
            几率 = 0.75 * 评价系数
        elseif 技能 == "莲台心法" then -- 10.87
            几率 = 0.25 * 评价系数
        end
        return 几率
    end

}
