return {
    游戏上线 = [[
★上线后在“游侠盟主盟主”处领取新手剧情，一直跟新手剧情直到30级，去师门处把对应的门派法术学习完。学习完以后在打开游侠锦囊全系法术就会获得法术熟练度。
重要的事情说3遍：
一定要先学习法术在开游侠锦囊、
一定要先学习法术在开游侠锦囊、
一定要先学习法术在开游侠锦囊、
]],

    种族介绍 = [[
魔族：
功能性种族，主要法术为：震慑（吸取对方法力值，气血值），提升攻击上限法术，提升速度法术（男魔），提升抗性法术（女魔）

仙族：
输出型种族，主要法术为：雷，水，风（男仙），火（女仙）

人族：
控制辅助型种族，主要法术为：混乱，冰冻，睡眠，毒术（女人）
]],

    阵容搭配 = [[
男魔+女魔+仙族+仙族+睡人
1.阵容搭配：男女搭配 干活不累 每个角色的数据都很平衡，往后阵容多变，可自行调整！ 。
2.玩法：作为老玩家，自行摸索~在200敏以外，不会存在乱敏现象。
3.新手前期：人族180敏 仙族380敏 魔族580敏 抽秒睡。
人族前期加点：200灵性 剩余全加根骨
魔族前期加点：200灵性 剩余全加敏
仙族前期加点：400灵性 剩余全加敏
游戏存在乱敏设置，请提升敏序差距，避免乱敏。
]],

    日常升级 = [[
1.每周6小时双倍时间
2.钟馗抓鬼  （组队）：30-70级--掉落打造材料、低级矿石、大量经验
3.天庭任务  （组队）：70-110级-掉落打造材料、高级矿石、大量经验
4.地藏鬼王  （组队）：90-140级-掉落打造材料、高级矿石、大量经验、神兵、珍稀物资
5.修罗任务  （组队）：110-160级-掉落打造材料、高级矿石、大量经验、神兵、珍稀物资
]],
    转生飞升 = [[
★人物转生等级：未转102级；1转122级；2转142级；
未转转生要求：1.时间宠100级；2.法术熟练全满；3.完成十称谓剧情
★本服人物最高等级3转180、召唤兽最高等级3转170、内丹最高经验3转170）
★召唤兽转生：
        0转-1转召唤兽=100级；亲密=10万
        1转-2转召唤兽=120级；亲密=20万
        2转-3转召唤兽=140级；亲密=30万
召唤兽转生找洛阳184.189灵兽仙-参战当前召唤兽转生。
★老版神兽飞升：
老版神兽飞升条件，召唤兽等级到2转140级之后，可以天庭找神兽大将飞升
        第一次飞升后，选择换神兽造型
        第二次飞升后，继续点换神兽造型
        第三次飞升后，选对应初值增加即可
老板神兽飞升造型：
            超级蝙蝠--蝴蝶仙子--剑精灵
            超级海龟--龟丞相--雷兽
            超级飞鱼--凤凰--罗刹鬼姬
            超级蟾蜍--雷鸟--哥俩好
            超级蜘蛛--蜘蛛精--狮蝎
            超级毒蛇--蛟龙--罗刹鬼姬
其他神兽飞升条件，召唤兽等级到2转140级之后，可以找神兽大将飞升，可飞升3次，每次增加0.1成长。
]],

    修正数据 = [[
3世仙族法满转生修正有对应的仙法抵抗性各62点修正(忽视小数点)
3世男人法满转生修正有对应的冰混睡抗性各46点修正(忽视小数点)
3世女人法满转生修正有对应的冰睡抗性各46点修正(忽视小数点)毒抗性62以及3690点毒伤修正(隐藏数据)
3世男魔法满转生修正有HP成长36.9%，MP成长36.9%，SP成长修正27.675%
3世女魔法满转生修正有HP成长36.9%，MP成长36.9%，物理修正69点和震慑抗性41.4点
]],

    升级礼包 = [[
★★★升级福利★★★
★升级礼包：游侠盟奖励
未转升级奖励：
0转10级： 一阶法术熟练度*1000、师门贡献*10000、灵翼天香*200、风水混元丹*200、高级飞行旗*1
0转30级： 法术熟练度*1000、师门贡献*20000、疏筋理气丸*1、摄妖香*50、藏宝图*1
0转50级： 法术熟练度*1000、师门贡献*50000、灵翼天香*200、风水混元丹*200、疏筋理气丸*1
0转70级： 法术熟练度*1000、师门贡献*100000、灵翼天香*200、风水混元丹*200、高级金柳露*1
0转102级：法术熟练度*2000、师门贡献*200000、疏筋理气丸*1、红雪散*20、亲密丹*1、1万帮派成就册*1
一转升级奖励：
1转20级： 法术熟练度*1000、师门贡献*200000、血烟石*99、千年灵花*99、千年寒铁*1、高级藏宝图*1
1转50级： 法术熟练度*1000、师门贡献*200000、血烟石*99、天外飞石*1、混元丹*1
1转70级： 法术熟练度*1000、师门贡献*200000、千年灵花*99、盘古精铁*1、九转易筋丸*1
1转90级： 法术熟练度*1000、师门贡献*200000、血烟石*99、补天神石*1、超级星梦石*1
1转110级：法术熟练度*1000、师门贡献*300000、血烟石*99、高级藏宝图*1、、亲密丹*1
1转122级：法术熟练度*1000、师门贡献*500000、血烟石*99、补天神石*1、亲密丹*2
二转升级奖励：
2转50级： 法术熟练度*1000、师门贡献*500000、青月灵草*99、龙之心屑*99、随机天书召唤兽*1
2转70级： 法术熟练度*1000、师门贡献*500000、青月灵草*99、龙之心屑*99、混元丹*1
2转90级： 法术熟练度*1000、师门贡献*500000、青月灵草*99、龙之心屑*99、超级星梦石*1
2转110级：法术熟练度*1000、银两*500000、青月灵草*99、龙之心屑*99、千年寒铁*2
2转120级：法术熟练度*1000、银两*500000、九玄仙玉*20、青月灵草*99、盘古精铁*2
2转130级：法术熟练度*1000、银两*500000、落魂砂*20、超级星梦石*1、补天神石*2
2转140级：法术熟练度*1000、银两*500000、清盈果*1、龙之心屑*99、亲密丹*3
三转升级奖励：
3转70级： 法术熟练度*1000、银两*500000、无常丹*99、九花玉露丸*99、高级藏宝图*1
3转80级： 法术熟练度*1000、银两*500000、无常丹*99、九花玉露丸*99、高级藏宝图*1
3转90级： 法术熟练度*1000、银两*500000、无常丹*99、九花玉露丸*99、高级藏宝图*1
3转100级：法术熟练度*1000、银两*500000、无常丹*99、九花玉露丸*99、筋骨提气丸*1
3转110级：法术熟练度*1000、银两*500000、二十一味清目丸*99、超级金柳露*1、六脉化神丸*1
3转150级：银两*500000、一级神兵礼盒*1、亲密丹*5、玉枢反虚丸*1、超级星梦石*1
3转170级：银两*500000、随机神兽宝盒*1、超级藏宝图*1、玉枢反虚丸*1
]],

    召唤详解 = [[
天书召唤兽：
获取途径1：活动里掉落的天书合成（后期陆续开放）
★初值数据如下：（陆续开放）
剑精灵:hp:60，mp:120，ap:12，sp:120，初始成长:1.275，召唤兽技能：魔神飞舞|天外飞魔,,
雷兽:hp:102，mp:199.2，ap:12，sp:-120，初始成长:1.275，召唤兽技能：雷神怒击|电闪雷鸣,,
罗刹鬼姬:hp:62，mp:360，ap:12，sp:0，初始成长:1.275，召唤兽技能：龙啸九天|蛟龙出海,,
狮蝎:hp:45，mp:156，ap:120，sp:12，初始成长:1.275，召唤兽技能：三味真火|烈火骄阳,,
哥俩好：HP：120　　MP：0　　AP：180　　SP：61 初始成长：1.275
]],

    老版神兽 = [[
超级飞鱼:hp:40，mp:200，ap:50，sp:60，初始成长:1.3，召唤兽技能：三味真火|烈火骄阳,,
超级蟾蜍:hp:110，mp:0，ap:150，sp:20，初始成长:1.3，召唤兽技能：风雷涌动|袖里乾坤,,
超级蜘蛛:hp:90，mp:150，ap:80，sp:10，初始成长:1.3，召唤兽技能：龙啸九天|蛟龙出海,,
超级毒蛇:hp:55，mp:200，ap:50，sp:50，初始成长:1.3，召唤兽技能：太乙生风|风雷涌动,,
超级蝙蝠:hp:70，mp:0，ap:160，sp:70，初始成长:1.3，召唤兽技能：魔神飞舞|天外飞魔,,
超级海龟:hp:200，mp:100，ap:10，sp:0，初始成长:1.3，召唤兽技能：龙啸九天|蛟龙出海,,
紫霞仙子:hp:40，mp:200，ap:50，sp:50，初始成长:1.3，召唤兽技能：三味真火|烈火骄阳,,
]],

    人形神兽 = [[
牛魔王:hp:110，mp:0，ap:150，sp:20，初始成长:1.3，召唤兽技能：狮王之怒|兽王之力,,
春三十娘:hp:90，mp:150，ap:80，sp:10，初始成长:1.3，召唤兽技能：太乙生风|风雷涌动,
至尊小宝:hp:55，mp:200，ap:50，sp:50，初始成长:1.3，召唤兽技能：龙啸九天|蛟龙出海,,
白晶晶:hp:70，mp:0，ap:160，sp:70，初始成长:1.3,,,,,,,,,,,,,,,,,,,
青霞仙子:hp:200，mp:100，ap:10，sp:0，初始成长:1.3，召唤兽技能：龙啸九天|蛟龙出海,,
泾河龙王:hp:10，mp:70，ap:10，sp:120，初始成长:1.3，召唤兽技能：龙啸九天|蛟龙出海,,
龙太子:hp:55，mp:200，ap:50，sp:65，初始成长:1.3，召唤兽技能：龙啸九天|蛟龙出海,,
]],

    五常神兽 = [[
垂云叟:hp:800，mp:1200，ap:10，sp:0，初始成长:0.612，召唤兽技能：龙啸九天|蛟龙出海,
范式之魂:hp:20，mp:0，ap:1100，sp:600，初始成长:0.612,,,,,,,,,,,,,,,,,,
浪淘沙:hp:600，mp:0，ap:1200，sp:0，初始成长:0.612,,,,,,,,,,,,,,,,,,,
五叶:hp:600，mp:0，ap:10，sp:720，初始成长:0.612,,,,,,,,,,,,,,,,,,,
颜如玉:hp:10，mp:1200，ap:10，sp:600，初始成长:0.612，召唤兽技能：三味真火|烈火骄阳,,
]],

    老版神兽飞升 = [[
老版神兽飞升条件，召唤兽等级到2转140级之后，可以天庭找神兽大将飞升
        第一次飞升后，选择换神兽造型
        第二次飞升后，继续点换神兽造型
        第三次飞升后，选对应初值增加即可
老板神兽飞升造型：
            超级蝙蝠--蝴蝶仙子--剑精灵
            超级海龟--龟丞相--雷兽
            超级飞鱼--凤凰--罗刹鬼姬
            超级蟾蜍--雷鸟--哥俩好
            超级蜘蛛--蜘蛛精--狮蝎
            超级毒蛇--蛟龙--罗刹鬼姬
其他神兽飞升条件，召唤兽等级到2转140级之后，可以找神兽大将飞升，可飞升3次，每次增加0.1成长。
]],

    关于召唤亲密 = [[
召唤兽的亲密值上限：神兽的亲密值上限为200000000点/其他召唤兽的亲密值上限为50000000点
亲密值越高挂钩的连击率、狂暴率、致命率也将同步提高，其中HP\MP\AP\SP也会得到比例提升。
]],

    大话币获取 = [[
1:200环
2:5环
3：物资掉落摆摊
4：赞助
]],

    称谓任务 = [[
1称谓共计4个剧情，每个任务做完需要去长安领取称谓，再做下一个任务。
人族??李世民??魔族??九头魔????仙族?太白金星
（做过称任务，背包一定要放飞行旗，记录好任务NPC坐标方便飞行）
过8称才可以做天，1-10称必须过，不过不能转生。每次转生后需要重新过称。
]],

    NPC购买 = [[
1：长安杂货铺可以购买杂货，剧情物品
    长安当铺开格子（本服没有随身当铺，自己定坐标）
    长安饰品店可以购买炼妖物品，内丹。
2：洛阳药店可以购买千年雪参，二十一味清目丸。冥钞在地府转鬼购买。
3：神兵炼化找洛阳铁匠铺何大雷。
4：变身卡 长安书店
]],

    日常升级2 = [[
上线找御武盟主领取游侠等级礼包
（新手礼包建议法术学全再开可以帮忙烧法）
长安找魔族，仙族，人族使者传送学习法术
（1）新手创建好角色上来跟着主线任务走，做完渔村主线到9级，然后点村长打几次海盗就可以10级。
（2）10级后出渔村继续做主线任务，主线任务做完（3）30级可以组队去地府抓小鬼了
（4）70级必须过8称才能做天庭
（5）90级鬼王
（6）110级修罗，修罗难度有点儿高，经验物品奖励丰富。
（7）杀星，每天活动，副本
日常升级任务都可以挂机自动领取任务！每个级别的日常任务经验，物品奖励都不一样
]],

    装备攻略 = [[
本游戏最好的装备是神兵，5级就够用。
没有垫底，拿神兵垫底也会碎。（不建议上6）
神兵碎了概不负责。
神兵升级攻略：（神兵会碎且行且珍惜）
1级神兵升2级需要：1级神兵加材料：千年寒铁
2级神兵升3级需要：2级神兵加材料：天外飞石
3级神兵升4级需要：3级神兵加材料：盘古精铁
4级神兵升5级需要：4级神兵加材料：补天神石
5级神兵升6级需要：5级神兵加材料：一级神兵（五级神兵不会碎）失败材料会变成神兵碎片
高级装备11-14级
装备武器最高是8级去洛阳购买
项链鞋子最高是9级去洛阳购买
高级装备打造攻略：
高级装备打造作坊等级得跟上，作坊等级最高7段，去皇宫作坊老板处学习，一个作坊打造满级段位需要11000体力
11级以下装备加材料千年寒铁可以将装备升级到11级
11级装备升级12需要材料天外飞石
12级装备升级13需要材料盘古精铁
13级装备升级14需要材料补天神石
高级装备不可以重铸，打造出来是什么属性就是什么属性，高级装备炼化后不能升级。
神兵精炼需要神兵石
高级装备炼化需要内丹精华，血玲珑，九彩云龙珠。   九彩云龙珠品阶越高炼化出来的属性越好
2：高级装备去洛阳购买，皇宫提升作坊等级。炼化在头像作坊炼化既可以。（高级装备有等级限制，根据自己等级选择高级装备的等级）
炼化公式头像作坊自己查询既可。
]],

    活动攻略 = [[
水陆大会每天晚上开启，晚上7点以前报名。
7点30进场，8点开始。 水陆进去自己手动PK，输了直接退出副本，赢得继续PK。打到最后剩一队结束活动。

帮战每周一至周五找帮派总管报名
周六，周日晚上第一场7点进场，7点30开启帮战。老版帮战进去自己手动PK，输了直接退出副本，赢得继续PK。打到对面帮派没有队伍了结束活动。
第二场帮战9点进场，9点30开启帮战。
]],

    召唤兽攻略 = [[
召唤兽获取可以自己捕捉，天书兑换，赞助获取几种获取方法
召唤兽在洛阳灵兽仙转生
内丹
长安饰品店购买获取
坐骑
杀坐骑任务获取坐骑
坐骑可以在帮派找NPC提升等级
坐骑技能可以在灵兽村育兽仙学习
属性可以吃筋骨提气丸提高属性
每只坐骑可以管制2只召唤兽
]],

    转生烧法 = [[
0转102  1转 时间宠100级 帮派里面升级
1转122  2转	时间宠100级 帮派里面升级
2转142  3转	时间宠100级 帮派里面升级
转生地府孟婆，转生后根据任务做任务升级就可以
需要冥钞（转鬼购买）千年雪参，二十一味清目丸（洛阳药店)
召唤兽转生在洛阳灵兽仙
关于转生修正问题：
转生修正是根据你当前的种族决定后面的修正属性
转生的时候选择重选修正功能没用，只是换转生之后的角色，和你当前的修正没有关系想要什么修正，转生之前弄好什么种族，比如你想要男魔的修正，1世的时候就玩男魔或者玩其他职业，转生的时候去皇宫找黄大仙换成男魔，再找孟婆转生，2转和3转都是这样操作，这样就能垂直到1-2-3世都是男魔的修正。
重设修正可以多宝买修正卡重新修正。
烧法
法术必须法熟练度点满才能转生或者全部点满
一个5法转生与全满转生差别是抗性差距
技能熟练度可以打过放技能提升
做师门任务提升
吃蟠桃提升
]],

    法宝领取 = [[
玩家达到1转及1转以上可找法宝领取人领取法宝。法宝获得之后，不能够交易，不能够丢弃

法宝名称          法宝领取人
银索金铃      紫霞(傲来国311,35)
将军令        秦琼(长安292，196)
大势锤        天一神将(龙窟四层53，44)
七宝玲珑塔    李靖(天宫56，46)
黑龙珠        东海龙王(龙宫86，107)
幽冥鬼手      阎罗王(阎王殿34，19)
大手印        三大王(老雕洞26，13)
绝情鞭        嫦娥(广寒宫26，52)
情网          春三十娘(大唐边境395，204)
宝莲灯        二郎神(凌霄宝殿39，42)
金箍儿        玄奘(玄空僧房22，16)
锦襕袈裟      观音姐姐(潮音洞33，29)
白骨爪        晶晶姑娘(五指山59，83)
化蝶          彩翼仙子(北俱芦洲203，25)

每件法宝分阴阳属性 佩戴3个法宝 可获得角色抗性加成
乾为天(阳阳阳)—增加玩家封印抗性
坤为地(阴阴阴)—增加玩家混乱抗性
震为雷(阴阴阳)—增加玩家雷系抗性
巽为风(阳阳阴)—增加玩家风系抗性
艮为山(阳阴阴)—增加玩家昏睡抗性
兑为泽(阴阳阳)—增加玩家毒系抗性
坎为水(阴阳阴)—增加玩家水系抗性
离为火(阳阴阳)—增加玩家火系抗性
]],

    孩子养成 = [[
玩家可以去普陀山-潮音洞,找善财童子领养孩子
注意:孩子的性別只与职业有关.职业种类和宝宝的资质（技能）没有任何关系，宝宝无论学习何种职业，只要提高对应的职业评价，就能够发挥宝宝的能力。例如在亲密和孝心相同的情况下，剑舞2000和兵法2000的两个宝宝的任何技能效果是相同的。

气质：气质是影响琴技的主要属性
悟性：宝宝的领悟能力，对所有职业都有些许影响
智力：智力是影响书画的主要属性
内力：内力是影响剑舞的主要属性
耐力：耐力是影响军事（兵法）的主要属性
亲密：亲密影响宝宝资质附带的技能效果
孝心：孝心影响宝宝资质附带的技能效果
叛逆：太叛逆的话宝宝容易变坏
疲劳：太疲劳的话宝宝容易生病

宝宝职业属性上限表
    气质  悟性	智力  内力	耐力 最高评价
琴	 631  154	54	 207   54	4181
书画 54	  154	631	 54	   207	4181return {
    游戏上线 = [[
★上线后在“游侠盟主盟主”处领取新手剧情，一直跟新手剧情直到30级，去师门处把对应的门派法术学习完。学习完以后在打开游侠锦囊全系法术就会获得法术熟练度。
重要的事情说3遍：
一定要先学习法术在开游侠锦囊。一定要先学习法术在开游侠锦囊。一定要先学习法术在开游侠锦囊。
]],

}


