local list = {
    { "边防", "**" },
    { "刁进平", "***" },
    { "习尽评", "***" },
    { "刁进评", "***" },
    { "插B", "**" },
    { "成人", "**" },
    { "成人{5}", "*****" },
    { "成人表演", "****" },
    { "成人电影网", "*****" },
    { "成人電影", "****" },
    { "成人激情", "****" },
    { "成人交友", "****" },
    { "成人卡通", "****" },
    { "成人录像", "****" },
    { "成人論壇", "****" },
    { "成人漫画", "****" },
    { "成人配色", "****" },
    { "成人书库", "****" },
    { "成人贴图", "****" },
    { "成人貼圖", "****" },
    { "成人图片激情图片情色图片", "************" },
    { "成人圖片", "****" },
    { "成人網站", "****" },
    { "成人小說", "****" },
    { "成人笑话", "****" },
    { "成人杂志", "****" },
    { "成人雜誌", "****" },
    { "社会性事件", "*****" },
    { "性交", "**" },
    { "口交", "**" },
    { "婊子", "**" },
    { "妓女", "**" },
    { "他妈", "**" },
    { "她妈", "**" },
    { "牛逼", "**" },
    { "牛比", "**" },
    { "牛B", "**" },
    { "煞笔", "**" },
    { "傻逼", "**" },
    { "傻B", "**" },
    { "你妈", "**" },
    { "操你妈", "***" },
    { "装逼", "**" },
    { "装B", "**" },
    { "日你妈", "***" },
    { "垃圾游戏", "****" },
    { "烂游戏", "***" },
    { "妈的", "**" },
    { "妈逼", "**" },
    { "草你妈", "***" },
    { "卖号", "**" },
    { "色情", "**" },
    { "黄色", "**" },
    { "h站", "**" },
    { "鸡巴", "**" },
    { "坐台的", "***" },
    { "作爱", "**" },
}


return function(r, t)
    if t then
        for k, v in pairs(list) do
            if string.find(r, v[1]) then
                return true
            end
        end
    else
        for k, v in pairs(list) do
            r = r:gsub(v[1], v[2]) --
        end
        return r
    end
end
