-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-01 12:16:40
-- @Last Modified time  : 2023-06-23 21:12:53

local 任务 = {
    名称 = '帮派任务_神秘',
    别名 = '帮派任务',
    类型 = '日常任务'
}

function 任务:任务初始化(玩家, ...)
    self.进度 = 1
end

local _描述 = {


    '去长安大雁塔一层找到索命鬼，让他去带你去找镇塔之神。#R（alt+a点击索命鬼进入战斗）#W(剩余#R%d#W分钟)',
    '去长安大雁二层塔找到大力精，让他去带你去找镇塔之神。#R（alt+a点击大力精进入战斗）#W(剩余#R%d#W分钟)',
    '去长安大雁三层塔找到茅山道士，让他去带你去找镇塔之神。#R（alt+a点击茅山道士进入战斗）#W(剩余#R%d#W分钟)',
    '去长安大雁四层塔找到鬼魁，让他去带你去找镇塔之神。#R（alt+a点击鬼魁进入战斗）#W(剩余#R%d#W分钟)',
    '去长安大雁六层塔找到镇塔之神。#R（alt+a点击镇塔之神进入战斗）#W(剩余#R%d#W分钟)',


}

function 任务:任务取详情(玩家)
    if self.时间 then
        if _描述[self.进度] then
            return string.format(_描述[self.进度], (self.时间 - os.time()) // 60)
        end
    end
end

function 任务:任务取消(玩家)
    玩家.其它.帮派环数 = nil
end

function 任务:任务更新(sec, 玩家)
    if self.时间 - os.time() <= 0 then
        玩家.其它.帮派环数 = nil
        self:删除()
    end
end

function 任务:任务上线(玩家)
    if self.时间 - os.time() <= 0 then
        玩家.其它.帮派环数 = nil
        self:删除()
    end
end

function 任务:任务下线(玩家)
    if self.时间 - os.time() <= 0 then
        self:删除()
        玩家.其它.帮派环数 = nil
    end
end

function 任务:添加任务(玩家) --1寻药
    玩家.其它.帮派环数 = 玩家.其它.帮派环数 + 1
    if 玩家.其它.帮派环数 > 10 then
        玩家.其它.帮派环数 = 1
    end
    self.环数 = 玩家.其它.帮派环数
    self.时间 = os.time() + 1800
    玩家:添加任务(self)
    self.最后对话 = "由于你长期对帮派做出贡献，给你条神秘任务吧。"
    return true
end

local _掉落 = {
    { 几率 = 3, 名称 = '补天神石', 数量 = 1, 广播 = '#C%s在帮派任务中获得了#G#m(%s)[%s]#m#n' },
    { 几率 = 5, 名称 = '盘古精铁', 数量 = 1, 广播 = '#C%s在帮派任务中获得了#G#m(%s)[%s]#m#n' },
    { 几率 = 7, 名称 = '天外飞石', 数量 = 1, 广播 = '#C%s在帮派任务中获得了#G#m(%s)[%s]#m#n' },
    { 几率 = 9, 名称 = '千年寒铁', 数量 = 1, 广播 = '#C%s在帮派任务中获得了#G#m(%s)[%s]#m#n' },
}

function 任务:掉落包(玩家) --1寻药


    local 经验 = 59884 * (1 + self.环数 * 0.35) --1154万经验
    local 银子 = 1000 * (1 + self.环数 * 0.36) --产出197400银两
    local 成就 = 100 * (1 + self.环数 * 0.2) --满次获得2460成就
    玩家:添加任务经验(经验, "帮派")
    玩家:添加银子(银子, "帮派")
    玩家:添加参战召唤兽亲密度(300, "帮派")
    玩家:添加帮派成就(成就)
    玩家:添加帮派建设度(11000000)

    -- 玩家:增加活动限制次数('帮派任务')

    local 总几率 = math.random(1000)
    local 几率 = 0
    for i, v in ipairs(_掉落) do
        几率 = 几率 + v.几率
        if 总几率 <= 几率 then
            local r = 生成物品 { 名称 = v.名称, 数量 = v.数量, 参数 = v.参数, 禁止交易 = v.禁止交易 }
            if r then
                玩家:添加物品({ r })
                if v.广播 and type(v.广播) == "string" then
                    玩家:发送系统(v.广播, 玩家.名称, r.nid, r.名称)
                end
                break
            end
        end
    end
    self:删除()
end

function 任务:完成击杀(玩家, NPC)
    if NPC == "索命鬼" and self.进度 == 1 then
        self.进度 = 2
        --添加奖励
        for k, v in 玩家:遍历队伍() do
            v:添加任务经验(1258454, "帮派")
            v:添加银子(10000, "帮派")
            v:添加帮派成就(30)
        end


    elseif NPC == "大力精" and self.进度 == 2 then
        self.进度 = 3
        for k, v in 玩家:遍历队伍() do

            v:添加任务经验(1558454, "帮派")
            v:添加银子(20000, "帮派")
            v:添加帮派成就(40)

        end
    elseif NPC == "茅山道士" and self.进度 == 3 then
        self.进度 = 4
        for k, v in 玩家:遍历队伍() do
            v:添加任务经验(1858454, "帮派")
            v:添加银子(40000, "帮派")
            v:添加帮派成就(50)

        end
    elseif NPC == "鬼魁" and self.进度 == 4 then
        self.进度 = 5

        for k, v in 玩家:遍历队伍() do
            v:添加任务经验(2158454, "帮派")
            v:添加银子(60000, "帮派")
            v:添加帮派成就(60)

        end
    elseif NPC == "镇塔之神" and self.进度 == 5 then
        for k, v in 玩家:遍历队伍() do

            v:添加任务经验(3258454, "帮派")
            v:添加银子(100000, "帮派")
            v:添加帮派成就(100)

        end
        self:删除()
    end



end

--==================================================
local 对话 = [[我是帮派总管,帮中事物无论大小都经由我处理。
menu
29|我来取消帮派任务
99|离开
]]
function 任务:任务NPC对话(玩家, NPC)
    if NPC.名称 == "帮派总管" then
        NPC.台词 = 对话
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if NPC.名称 == "帮派总管" then
        if i == "29" then
            local r = 玩家:取任务('帮派任务_神秘')
            if r then
                r:任务取消(玩家)
                r:删除(玩家)
            end
        end
    end
end

--==================================================
function 任务:任务攻击事件(玩家, NPC, cash, items)
    if NPC.名称 == "索命鬼" and self.进度 == 1 then
        玩家:进入战斗('scripts/task/帮派任务/帮派任务_神秘.lua', NPC)
    elseif NPC.名称 == "大力精" and self.进度 == 2 then
        玩家:进入战斗('scripts/task/帮派任务/帮派任务_神秘.lua', NPC)

    elseif NPC.名称 == "茅山道士" and self.进度 == 3 then
        玩家:进入战斗('scripts/task/帮派任务/帮派任务_神秘.lua', NPC)
    elseif NPC.名称 == "鬼魁" and self.进度 == 4 then
        玩家:进入战斗('scripts/task/帮派任务/帮派任务_神秘.lua', NPC)
    elseif NPC.名称 == "镇塔之神" and self.进度 == 5 then
        玩家:进入战斗('scripts/task/帮派任务/帮派任务_神秘.lua', NPC)




    end
end

function 任务:战斗初始化(玩家, NPC)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local r = 玩家:取任务("帮派任务_神秘")
    self.npc名称 = NPC.名称
    if r then
        local 怪物属性

        怪物属性 = {
            外形 = 2018,
            名称 = "三界妖王",
            等级 = 等级,
            气血 = 56544 + 转生 * 150000 + 等级 * 5000,
            魔法 = 81111,
            伤害 = 1241,
            速度 = 50 + 等级 * 2 + 转生 * 50,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 80,
                抗封印 = 80,
                抗昏睡 = 80,
            },
            技能 = {
                { 名称 = "失心狂乱", 熟练度 = 转生 * 10000 },
                { 名称 = "借刀杀人", 熟练度 = 转生 * 10000 },
                { 名称 = "百日眠", 熟练度 = 转生 * 10000 },
                --  { 名称 = "作壁上观", 熟练度 = 25000 },
            },
            施法几率 = 40,
            是否消失 = false,
        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))

        怪物属性 = {
            外形 = 2018,
            名称 = "三界妖王",
            等级 = 等级,
            气血 = 56544 + 转生 * 150000 + 等级 * 5000,
            魔法 = 81111,
            伤害 = 1241,
            速度 = 50 + 等级 * 2 + 转生 * 50,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 80,
                抗封印 = 80,
                抗昏睡 = 80,
            },
            技能 = {
                --  { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "天诛地灭", 熟练度 = 转生 * 10000 },
                { 名称 = "袖里乾坤", 熟练度 = 转生 * 10000 },
            },
            施法几率 = 40,
            是否消失 = false,
        }
        self:加入敌方(2, 生成战斗怪物(怪物属性))

        怪物属性 = {
            外形 = 2018,
            名称 = "三界妖王",
            等级 = 等级,
            气血 = 56544 + 转生 * 150000 + 等级 * 5000,
            魔法 = 81111,
            伤害 = 1241,
            速度 = 50 + 等级 * 2 + 转生 * 50,
            抗性 = {
                物理吸收 = 15,
                抗震慑 = 25,
                抗混乱 = 80,
                抗封印 = 80,
                抗昏睡 = 80,
            },
            技能 = {
                { 名称 = "乾坤借速", 熟练度 = 转生 * 10000 },
                { 名称 = "魔音摄心", 熟练度 = 转生 * 10000 },
                { 名称 = "阎罗追命", 熟练度 = 转生 * 10000 },
                { 名称 = "含情脉脉", 熟练度 = 转生 * 10000 },
            },
            施法几率 = 40,
            是否消失 = false,
        }
        self:加入敌方(3, 生成战斗怪物(怪物属性))


        怪物属性 = {
            外形 = 2006,
            名称 = "千年黑熊精",
            等级 = 等级,
            气血 = 56544 + 转生 * 150000 + 等级 * 5000,
            魔法 = 81111,
            伤害 = 1241,
            速度 = 50 + 等级 * 2 + 转生 * 50,
            抗性 = {
                物理吸收 = 50,
                抗震慑 = 10,
                抗混乱 = 70,
                抗昏睡 = 70,
                抗中毒 = 30 + 等级 * 0.1,
                抗鬼火 = 10 + 等级 * 0.1,
            },
            技能 = {
                { 名称 = "万毒攻心", 熟练度 = 转生 * 10000 },
            },
            施法几率 = 40,
            是否消失 = false,
        }
        self:加入敌方(4, 生成战斗怪物(怪物属性))


        怪物属性 = {
            外形 = 2006,
            名称 = "千年黑熊精",
            等级 = 等级,
            气血 = 56544 + 转生 * 150000 + 等级 * 5000,
            魔法 = 81111,
            伤害 = 1241,
            速度 = 50 + 等级 * 2 + 转生 * 50,
            抗性 = {
                物理吸收 = 50,
                抗震慑 = 10,
                抗风 = 30 + 等级 * 0.1,
                抗火 = 30 + 等级 * 0.1,
                抗水 = 30 + 等级 * 0.1,
                抗雷 = 30 + 等级 * 0.1,
            },
            技能 = {
                { 名称 = "万毒攻心", 熟练度 = 转生 * 10000 },
            },
            施法几率 = 40,
            是否消失 = false,
        }
        self:加入敌方(5, 生成战斗怪物(怪物属性))

        怪物属性 = {
            外形 = 2026,
            名称 = "蓝色妖王",
            等级 = 等级,
            气血 = 56544 + 转生 * 150000 + 等级 * 5000,
            魔法 = 81111,
            伤害 = 1241,
            速度 = 50 + 等级 * 2 + 转生 * 50,
            抗性 = {
                抗震慑 = 10,
                抗混乱 = 70,
                抗昏睡 = 80,
                抗中毒 = 10,
            },
            技能 = {
                { 名称 = "失心狂乱", 熟练度 = 转生 * 10000 },
            },
            施法几率 = 40,
            是否消失 = false,
        }
        self:加入敌方(6, 生成战斗怪物(怪物属性))

        怪物属性 = {
            外形 = 2073,
            名称 = "黑山老妖",
            等级 = 等级,
            气血 = 56544 + 转生 * 150000 + 等级 * 5000,
            魔法 = 81111,
            伤害 = 1241,
            速度 = 50 + 等级 * 2 + 转生 * 50,
            抗性 = {
                抗震慑 = 5,
                抗混乱 = 80,
                抗昏睡 = 80,
                忽视防御几率 = 60,
                忽视防御程度 = 60,
                连击率 = 80,
                连击次数 = 3,
            },
            技能 = {
                -- { 名称 = "九龙冰封", 熟练度 = 25000 },
                { 名称 = "九阴纯火", 熟练度 = 转生 * 10000 },
                { 名称 = "天诛地灭", 熟练度 = 转生 * 10000 },
                { 名称 = "袖里乾坤", 熟练度 = 转生 * 10000 },
            },
            施法几率 = 1,
            是否消失 = false,
        }
        self:加入敌方(7, 生成战斗怪物(怪物属性))

        怪物属性 = {
            外形 = 2074,
            名称 = "六臂魔王",
            等级 = 等级,
            气血 = 56544 + 转生 * 150000 + 等级 * 5000,
            魔法 = 81111,
            伤害 = 1241,
            速度 = 50 + 等级 * 2 + 转生 * 50,
            抗性 = {
                物理吸收 = 50,
                抗震慑 = 10,
                抗混乱 = 80,
                抗昏睡 = 80,
                雷系狂暴几率 = 40,
            },
            技能 = {
                { 名称 = "天诛地灭", 熟练度 = 转生 * 10000 },
            },
            施法几率 = 40,
            是否消失 = false,
        }
        self:加入敌方(8, 生成战斗怪物(怪物属性))













    end
























end

function 任务:战斗结束(s)
    if s then
        for k, v in self:遍历我方() do
            if v.是否玩家 then
                local r = v.对象.接口:取任务("帮派任务_神秘")
                if r then
                    r:完成击杀(v.对象.接口, self.npc名称)
                end
            end
        end
    end
end

return 任务
