-- @Author              : GGELUA
-- @Last Modified by    : baidwwy
-- @Date                : 2022-07-01 12:16:40
-- @Last Modified time  : 2022-09-07 15:17:32

local 任务 = {
    名称 = '帮派任务_名单',
    别名 = '帮派任务',
    类型 = '日常任务'
}

function 任务:任务初始化(玩家, ...)
end

local _描述 = '去洛阳城(402,77)击败无名侠女，拿回锦盒。#W(当前第#R%s#W次，剩余#R%d#W分钟)'
function 任务:任务取详情(玩家)
    if self.时间 then
        return string.format(_描述, self.环数, (self.时间 - os.time()) // 60)
    end
end

function 任务:任务取消(玩家)
    玩家.其它.帮派环数 = nil
end

function 任务:任务更新(sec, 玩家)
    if self.时间 - os.time() <= 0 then
        玩家.其它.帮派环数 = nil
        self:删除()
    end
end

function 任务:任务上线(玩家)
    if self.时间 - os.time() <= 0 then
        玩家.其它.帮派环数 = nil
        self:删除()
    end
end

function 任务:任务下线(玩家)
    if self.时间 - os.time() <= 0 then
        self:删除()
        玩家.其它.帮派环数 = nil
    end
end

function 任务:添加任务(玩家)
    玩家.其它.帮派环数 = 玩家.其它.帮派环数 + 1
    if 玩家.其它.帮派环数 > 10 then
        玩家.其它.帮派环数 = 1
    end
    self.环数 = 玩家.其它.帮派环数
    self.时间 = os.time() + 1800
    玩家:添加任务(self)
    self.最后对话 = "#W帮里的人员名单被叛徒放到锦盒里准备送给斧头帮,被#G无名侠女#W截获了,你去把锦盒拿回来。"
    return true
end

local _掉落 = {
    总几率 = 1000,
    空车率 = 700,
    { 几率 = 3, 名称 = '补天神石', 数量 = 1, 广播 = '#C%s在帮派任务中获得了#G#m(%s)[%s]#m#n' },
    { 几率 = 5, 名称 = '盘古精铁', 数量 = 1, 广播 = '#C%s在帮派任务中获得了#G#m(%s)[%s]#m#n' },
    { 几率 = 7, 名称 = '天外飞石', 数量 = 1, 广播 = '#C%s在帮派任务中获得了#G#m(%s)[%s]#m#n' },
    { 几率 = 9, 名称 = '千年寒铁', 数量 = 1, 广播 = '#C%s在帮派任务中获得了#G#m(%s)[%s]#m#n' },
}
function 任务:掉落几率_初始化()
    self.总几率 = _掉落.总几率
    self.空车率 = _掉落.空车率
    self.几率 = 0
    for i, v in ipairs(_掉落) do
        self.几率 = self.几率 + v.几率
    end
end

function 任务:掉落包(玩家) --1寻药
    local 环数 = self.环数 or 1
    local 经验 = math.floor(59884 * (1 + 环数 * 0.35)) --1154万经验
    local 银子 = math.floor(1000 * (1 + 环数 * 0.36)) --产出197400银两
    local 成就 = math.floor(40 * (1 + 环数 * 0.2)) --满次获得2460成就
    玩家:添加任务经验(经验, "帮派")
    玩家:添加银子(银子, "帮派")
    玩家:添加参战召唤兽亲密度(300, "帮派")
    玩家:添加帮派成就(成就)
    玩家:添加帮派建设度(11000000)

    -- 玩家:增加活动限制次数('帮派任务')
    if math.random(self.总几率) > self.空车率 then
        local 总几率 = math.random(self.几率)
        local 几率 = 0
        for i, v in ipairs(_掉落) do
            几率 = 几率 + v.几率
            if 总几率 <= 几率 then
                local r = 生成物品 { 名称 = v.名称, 数量 = v.数量, 参数 = v.参数, 禁止交易 = v.禁止交易 }
                if r then
                    玩家:添加物品({ r })
                    if v.广播 then
                        玩家:发送系统(v.广播, 玩家.名称, r.nid, r.名称)
                    end
                    break
                end
            end
        end
    end
    local r = 玩家:取任务('帮派任务_名单')
    if r then
        玩家:添加帮派成就(math.floor(20 * (1 + 玩家.其它.帮派环数 * 0.2)))
        玩家:添加帮派建设度(10)
        r:删除()
        玩家:最后对话("既然你这个锦盒对你这么重要,那我会马上把锦盒送到你们帮里,你放心好了！"
        , 2015)
    end
end

--==================================================
local 对话 = [[我是帮派总管,帮中事物无论大小都经由我处理。
menu
29|我来取消帮派任务
99|离开
]]


function 任务:任务NPC对话(玩家, NPC)
    if NPC.名称 == "无名侠女" then
        NPC.台词 = nil
        local r = 玩家:进入战斗('scripts/task/帮派任务/帮派任务_名单.lua', NPC)
        -- if r then
        --     NPC.台词= "既然你这个锦盒对你这么重要,那我会马上把锦盒送到你们帮里,你放心好了！"
        -- end
    elseif NPC.名称 == "帮派总管" then
        NPC.台词 = 对话
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
    if NPC.名称 == "帮派总管" then
        if i == "29" then
            local r = 玩家:取任务('帮派任务_名单')
            if r then
                r:任务取消(玩家)
                r:删除(玩家)
            end
        end
    end
end

function 任务:任务攻击事件(玩家, NPC, cash, items)
    if NPC.名称 == "无名侠女" then
        local r = 玩家:进入战斗('scripts/task/帮派任务/帮派任务_名单.lua', NPC)
        -- if r then
        --     return "既然你这个锦盒对你这么重要,那我会马上把锦盒送到你们帮里,你放心好了！"
        -- end
    end
end

--==================================================

function 任务:战斗初始化(玩家, NPC)
    local 等级 = 玩家:取队伍最高等级()
    local 转生 = 玩家:取队伍最高转生()
    local r = 玩家:取任务('帮派任务_名单')
    if r then
        local 怪物属性

        怪物属性 = {
            外形 = NPC.外形,
            名称 = NPC.名称,
            等级 = 等级,
            气血 = 22587 + 转生 * 10000 + 等级 * 100,
            魔法 = 81111,
            伤害 = 等级 * 15,
            速度 = 71 + 等级 * 2,
            抗性 = {
                物理吸收 = 35,
                抗震慑 = 25,
                抗混乱 = 50,
                抗封印 = 50,
                抗昏睡 = 50,
            },
            技能 = {
                -- { 名称 = "天雷怒火", 熟练度 = 5000 },
            },
            施法几率 = 75,
            是否消失 = false,
        }
        self:加入敌方(1, 生成战斗怪物(怪物属性))


        怪物属性 = {
            外形 = 2039,
            名称 = "银狐",
            等级 = 等级,
            气血 = 12587 + 转生 * 10000 + 等级 * 100,
            魔法 = 81111,
            伤害 = 等级 * 15,
            速度 = 71 + 等级 * 2,
            抗性 = {
                物理吸收 = 35,
                抗震慑 = 25,
                抗混乱 = 50,
                抗封印 = 50,
                抗昏睡 = 50,
            },
            技能 = {
                -- { 名称 = "天雷怒火", 熟练度 = 5000 },
            },
            施法几率 = 75,
            是否消失 = false,
        }
        self:加入敌方(2, 生成战斗怪物(怪物属性))

        怪物属性 = {
            外形 = 2039,
            名称 = "银狐",
            等级 = 等级,
            气血 = 12587 + 转生 * 10000 + 等级 * 100,
            魔法 = 81111,
            伤害 = 等级 * 15,
            速度 = 71 + 等级 * 2,
            抗性 = {
                物理吸收 = 35,
                抗震慑 = 25,
                抗混乱 = 50,
                抗封印 = 50,
                抗昏睡 = 50,
            },
            技能 = {
                --  { 名称 = "天雷怒火", 熟练度 = 5000 },
            },
            施法几率 = 75,
            是否消失 = false,
        }
        self:加入敌方(3, 生成战斗怪物(怪物属性))

        怪物属性 = {
            外形 = 2039,
            名称 = "银狐",
            等级 = 等级,
            气血 = 12587 + 转生 * 10000 + 等级 * 100,
            魔法 = 81111,
            伤害 = 等级 * 15,
            速度 = 71 + 等级 * 2,
            抗性 = {
                物理吸收 = 35,
                抗震慑 = 25,
                抗混乱 = 50,
                抗封印 = 50,
                抗昏睡 = 50,
            },
            技能 = {
                --  { 名称 = "天雷怒火", 熟练度 = 5000 },
            },
            施法几率 = 75,
            是否消失 = false,
        }
        self:加入敌方(4, 生成战斗怪物(怪物属性))


        怪物属性 = {
            外形 = 2039,
            名称 = "银狐",
            等级 = 等级,
            气血 = 12587 + 转生 * 10000 + 等级 * 100,
            魔法 = 81111,
            伤害 = 等级 * 15,
            速度 = 71 + 等级 * 2,
            抗性 = {
                物理吸收 = 35,
                抗震慑 = 25,
                抗混乱 = 50,
                抗封印 = 50,
                抗昏睡 = 50,
            },
            技能 = {
                --   { 名称 = "天雷怒火", 熟练度 = 5000 },
            },
            施法几率 = 75,
            是否消失 = false,
        }
        self:加入敌方(5, 生成战斗怪物(怪物属性))
    end
end

function 任务:战斗回合开始(dt)

end

function 任务:战斗结束(s)
    if s then
        for k, v in self:遍历我方() do
            if v.是否玩家 then
                任务:掉落包(v.对象.接口)
            end
        end
    end
end

return 任务
