local 任务 = {
    名称 = '坐骑4_锲而不舍',
    别名 = '(坐骑四)锲而不舍',
    类型 = '坐骑剧情',
    是否可取消 = false
}

function 任务:任务初始化(玩家, ...)
    self.黑山老妖 = {
        胡大力 = 0, 何小姐 = 0, 满堂春 = 0, 小香玉 = 0, 雷小二 = 0
    }
end

function 任务:任务上线(玩家)
end

function 任务:任务更新(sec)
end

local _详情 = {
    '前往#Y灵兽村#W找#G白虎长老#W聊一聊！',
    '将#G#u#[001192|20|40|$无名小妖#]#u#W抓回灵兽村。',
    '抓到无名小妖了，找#G白虎长老#W商量一下。',
    '找#G#u#[101377|13|10|$朱雀长老#]#u#W帮忙套问无名小妖。',
    '在洛阳寻找黑风老妖并消灭他，附身在洛阳城#G胡大力，#G何小姐#W，#G满堂春#W，#G小香玉#W，#G雷小二#W五人中的某一位身上。',
    '找#G#u#[101377|13|10|$朱雀长老#]#u#W问问，如何阻止黑风老妖使用飞天之法逃跑。',
    '黑风老妖使用飞天之法逃跑，去找#G太上老君#W借#G天罗#W来破他的法术。',
    '去大雁塔三层，找#G#u#[001006|12|67|$狐狸贝贝#]#u#W拿回#G天罗#W。#Y（ALT+A攻击狐狸贝贝）',
    '有了天罗，再去洛阳寻找黑风老妖并消灭他，附身在洛阳城#G胡大力，#G何小姐#W，#G满堂春#W，#G小香玉#W，#G雷小二#W五人中的某一位身上。',
    '找#G#u#[101377|13|10|$朱雀长老#]#u#W问问，如何阻止黑风老妖使用遁地之法逃跑。',
    '黑风老妖使用遁地之术逃跑，去找#G玄奘#W借#G地网#W来破他的法术。',
    '有了地网，再去洛阳寻找黑风老妖并消灭他，附身在洛阳城#G胡大力，#G何小姐#W，#G满堂春#W，#G小香玉#W，#G雷小二#W五人中的某一位身上。',
    '把消灭黑风老妖这个好消息告诉#G#u#[101377|13|10|$朱雀长老#]#u#W。',
}

function 任务:任务取详情(玩家)
    return _详情[self.进度 + 1] or ''
end

local _台词 = {
    [1] = { 头像 = 0, 结束 = false, 台词 = '我和无名小妖交手后发现一个疑问，就凭借他的能力，根本不可能潜入灵兽村摄走小白虎的魂魄，其中必然有幕后主使，您认为呢？' },
    [2] = { 头像 = 2038, 结束 = false, 台词 = '不错，不错……我问过小崽崽之后也觉得很是奇怪，可究竟是谁要对一个小孩子下如此毒手呢？目的又是什么呢？' },
    [3] = { 头像 = 0, 台词 = '我想把无名小妖抓来询问一翻，长老你看如何？' },
    --0
    [4] = { 头像 = 2004, 结束 = false, 台词 = '啊，怎么又是你！！' },
    [5] = { 头像 = 0, 结束 = false, 台词 = '认得我就好，到底是谁潜入灵兽村将小白虎的魂魄摄去，又是谁指示你看守魂魄的？？快快如实招来，还可留下你这条烂命，嘿嘿！！' },
    [6] = { 头像 = 2004, 结束 = false, 台词 = '得饶人处且饶人，不要逼人太甚。' },
    [7] = { 头像 = 0, 结束 = false, 台词 = '想不到你嘴巴还蛮硬，我只抓你回去，慢慢审问。' },
    --1
    [8] = { 头像 = 0, 结束 = false, 台词 = '无名小妖我已经抓来了，可他死活都不说！' },
    [9] = { 头像 = 2038, 台词 = '能拿到人就好办了。你把他交给朱雀长老那鬼丫头，一准能问出来！' },
    --2

    [10] = { 头像 = 2071, 结束 = false, 台词 = '我已经帮你问出无名小妖的幕后指使者了。' },
    [11] = { 头像 = 0, 结束 = false, 台词 = '是谁躲起来不干好事？？莫非……' },
    [12] = { 头像 = 2071, 结束 = false, 台词 = '他就是化身成人形躲在洛阳城内的黑风老妖。' },
    [13] = { 头像 = 0, 结束 = false, 台词 = '我这就去除掉他。' },
    [14] = { 头像 = 2071, 台词 = '你一路小心，不要心急，有什么困难就回来找我。' },
    --3
    [15] = { 头像 = 0, 台词 = '该死的黑风老妖，仗着些许变身术，又在此害人！此番被我法眼识破，休想逃得性命！' },
    [16] = { 头像 = 2073, 台词 = '没空和你纠缠，小娃娃，看老夫的飞天之法，先走一步了，哈哈。' },
    --4

    [17] = { 头像 = 0, 结束 = false, 台词 = '唉，好不容易遇到黑风老妖，又被他用飞天之法跑掉了。' },
    [18] = { 头像 = 2071, 结束 = false, 台词 = '听说太上老君有一法宝名为天罗能破此法。' },
    [19] = { 头像 = 0, 台词 = '我这就去找太上老君将此法宝借来一用。' },
    --5

    [20] = { 头像 = 6535, 结束 = false, 台词 = '黑风老妖？？天庭早想除灭此妖了，但此妖孽善于隐藏和逃跑，一直每人愿意前往，既然你有心除去此妖，那就交给你办了。' },
    [21] = { 头像 = 0, 结束 = false, 台词 = '（如此歪打正着？？既然他有求于我，看来借天罗一事应该不成问题！）我就是因为他擅长用飞天之法逃跑，才想找你借“天罗”一用。' },
    [22] = { 头像 = 6535, 结束 = false, 台词 = '不过……此时法宝我在我身上…你要想要帮我去找狐狸贝贝拿回来，用完后再还给我。' },
    [23] = { 头像 = 0, 结束 = false, 台词 = '（就知道没那么便宜的事）好你个白胡子老头，居然敢将仙家宝物私自借给妖魔，看我不上玉帝面前奏你一本。' },
    [24] = { 头像 = 6535, 结束 = false, 台词 = '哈哈，休得陷害老儿，确实是那狐狸精趁我疏忽，偷偷拿走的。' },
    [25] = { 头像 = 6535, 台词 = '哎，说来惭愧，老儿一向心慈手软，偏偏这狐狸又一副楚楚可怜的模样，实在狠不下心来追回。' },
    --6

    [26] = { 头像 = 2059, 台词 = '呜呜，一点都不知道怜香惜玉，破天罗拿去便是，谁有稀罕那老头子。' },
    --7

    [27] = { 头像 = 0, 台词 = '该死的黑风老妖，仗着些许变身术，又在此害人！此番又被我法眼识破，休想再次逃得性命！' },
    [28] = { 头像 = 2073, 台词 = '没空和你纠缠，小娃娃，看老夫的遁地之术，先走一步了，哈哈。' },
    --8

    [29] = { 头像 = 0, 结束 = false, 台词 = '哎，好不容易再次遇到黑风老妖，没提防他用遁地之术还是跑掉了。' },
    [30] = { 头像 = 2071, 结束 = false, 台词 = '没想到黑风老妖居然修炼成了遁地之术这等妖术，看来要想除它，非玄奘大师的地网不行。' },
    [31] = { 头像 = 0, 台词 = '我这就去找玄奘大师将此法宝借来一用。' },
    --9

    [32] = { 头像 = 3048, 结束 = false, 台词 = '阿弥陀佛，贫僧劝过黑风老妖好多次，要他改恶行善，可他就是不听。' },
    [33] = { 头像 = 0, 结束 = false, 台词 = '嘿嘿，既然知道，那就请高僧赐地网一用，让在下去收了那妖精。' },
    [34] = { 头像 = 3048, 结束 = false, 台词 = '人命是命，妖命也是命。为救一命伤一命，有何功德？？我们要以一颗慈悲的心去感化它，让它认识到自己的错误，感受到行善的美好，自觉的走上正途。' },
    [35] = { 头像 = 0, 结束 = false, 台词 = '（叽叽歪歪，你烦也是不烦！）谈什么振国，讲什么功德？？？我就知杀人偿命，我就知黑风老妖一日不除，数不清的无辜就会遭到祸害！！！为了少一点人收到伤害，我情愿开杀戒，情愿接受我佛的处罚。' },
    [36] = { 头像 = 2071, 台词 = '要“入世修”，需有大毅力，待通过贫僧的考验再去也不迟。' },
    --10
    [37] = { 头像 = 2071, 台词 = '既然你有如此鉴定的毅力，这地网就姑且借你一用。' },
    --战斗后

    [38] = { 头像 = 0, 台词 = '这下看你怎么跑！！！' },
    --11

    [39] = { 头像 = 0, 结束 = false, 台词 = '恭喜朱雀姐姐，黑风老妖终于被彻底消灭，再也不能为祸人间了。' },
    [40] = { 头像 = 2071, 台词 = '呵呵，这真乃喜事一件。你又立下如此大功，值得庆贺，值得嘉奖！！姐姐没什么好东西，这颗灵气蛋你收下，就算姐姐给你的一点小小奖励。' },
    --12
}

function 任务:取对话(玩家)
    local r = _台词[self.对话进度]
    local 台词, 头像, 结束 = r.台词, r.头像, r.结束
    if 头像 == 0 then
        头像 = 玩家.原形
    end
    return 台词, 头像, 结束
end

function 任务:任务NPC对话(玩家, NPC)
    if NPC.名称 == '白虎长老' then
        if self.进度 == 0 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 3 then
                self.进度 = 1
            end
        elseif self.进度 == 2 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 9 then
                self.进度 = 3
            end
        end
    elseif NPC.名称 == '无名小妖' then
        if self.进度 == 1 then
            if self.对话进度 >= 7 then
                self.对话进度 = 3
            end
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 7 then
                self:任务攻击事件(玩家, NPC)
            end
        end
    elseif NPC.名称 == '朱雀长老' then
        if self.进度 == 3 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 14 then
                self.进度 = 4
            end
        elseif self.进度 == 5 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 19 then
                self.进度 = 6
            end
        elseif self.进度 == 9 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 31 then
                self.进度 = 10
            end
        elseif self.进度 == 12 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 40 then
                self:完成(玩家)
            end
        end
    elseif self:黑山老妖附身(NPC) then
        if self.进度 == 4 then
            self.对话进度 = 15
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            self:任务攻击事件(玩家, NPC)
        elseif self.进度 == 8 then
            self.对话进度 = 27
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            self:任务攻击事件(玩家, NPC)
        elseif self.进度 == 11 then
            self.对话进度 = 38
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            self:任务攻击事件(玩家, NPC)
        end
    elseif NPC.名称 == '太上老君' then
        if self.进度 == 6 then
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 25 then
                self.进度 = 7
            end
        end
    elseif NPC.名称 == '玄奘' then
        if self.进度 == 10 then
            if self.对话进度 >= 36 then
                self.对话进度 = 31
            end
            self.对话进度 = self.对话进度 + 1
            NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
            if self.对话进度 == 36 then
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                self:任务攻击事件(玩家, NPC)
            end
        end
    end
end

function 任务:任务NPC菜单(玩家, NPC, i)
end

function 任务:黑山老妖附身(NPC)
    if self.黑山老妖[NPC.名称] == 1 then
        return
    end
    for k, v in pairs(self.黑山老妖) do
        if NPC.名称 == k then
            return true
        end
    end
end

function 任务:完成(玩家)
    if 玩家:添加物品({ 生成物品 { 名称 = "灵兽蛋", 数量 = 1, 参数 = 4, 种族 = 玩家.种族 } }) then
        self:删除()
    end
end

function 任务:任务NPC给予(玩家, NPC, cash, items)

end

function 任务:任务攻击事件(玩家, NPC)
    if NPC.名称 == '无名小妖' then
        if self.进度 == 1 and self.对话进度 == 7 then
            local r = 玩家:进入战斗('scripts/war/坐骑剧情/坐骑4_无名小妖.lua', NPC)
            if r then
                self.进度 = 2
            end
        end
    elseif self:黑山老妖附身(NPC) then
        if self.进度 == 4 then
            local r = 玩家:进入战斗('scripts/war/坐骑剧情/坐骑4_黑风老妖.lua', NPC, 1)
            if r then
                self.黑山老妖[NPC.名称] = 1
                self.进度 = 5
                玩家:添加经验(120000)
                玩家:添加银子(60000)

                self.对话进度 = 16
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                玩家:最后对话(NPC.台词, NPC.头像)
            end
        elseif self.进度 == 8 then
            local r = 玩家:进入战斗('scripts/war/坐骑剧情/坐骑4_黑风老妖.lua', NPC, 2)
            if r then
                self.黑山老妖[NPC.名称] = 1
                self.进度 = 9

                玩家:添加经验(120000)
                玩家:添加银子(60000)

                self.对话进度 = 28
                NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                玩家:最后对话(NPC.台词, NPC.头像)
            end
        elseif self.进度 == 11 then
            local r = 玩家:进入战斗('scripts/war/坐骑剧情/坐骑4_黑风老妖.lua', NPC, 3)
            if r then
                self.黑山老妖[NPC.名称] = 1
                self.进度 = 12
                玩家:添加经验(85000)
                玩家:添加银子(42000)
                玩家:删除物品('天罗')
                玩家:删除物品('地网')
            end
        end
    elseif NPC.名称 == '狐狸贝贝' then
        if self.进度 == 7 then
            local r = 玩家:进入战斗('scripts/war/坐骑剧情/坐骑4_狐狸贝贝.lua', NPC)
            if r then
                local 添加物品 = 玩家:添加物品({ 生成物品 { 名称 = '天罗', 数量 = 1, 禁止交易 = true } })
                if 添加物品 then
                    self.进度 = 8
                    self.对话进度 = 26
                    玩家:添加经验(307200)
                    玩家:添加银子(120000)
                    NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                    玩家:最后对话(NPC.台词, NPC.头像)
                else
                    玩家:提示窗口('#Y你的背包已满，无法获得任务物品')
                end
            end
        end
    elseif NPC.名称 == '玄奘' then
        if self.进度 == 10 and self.对话进度 == 36 then
            local r = 玩家:进入战斗('scripts/war/坐骑剧情/坐骑4_心魔.lua', NPC)
            if r then
                local 添加物品 = 玩家:添加物品({ 生成物品 { 名称 = '地网', 数量 = 1, 禁止交易 = true } })
                if 添加物品 then
                    self.进度 = 11
                    self.对话进度 = 37
                    玩家:添加经验(460800)
                    玩家:添加银子(250000)
                    NPC.台词, NPC.头像, NPC.结束 = self:取对话(玩家)
                    玩家:最后对话(NPC.台词, NPC.头像)
                else
                    玩家:提示窗口('#Y你的背包已满，无法获得任务物品')
                end
            end
        end
    end
end

return 任务
