local NPC = {}
local 对话 = [[
奉圣上旨意，我在此为各路英雄收集入门装备
menu
1|我要兑换装备
2|我要找回新手装备
3|我只是路过看看
]]

function NPC:NPC对话(玩家, i)
    return 对话
end

local _新手装备 = {
    [1] = {
        {
            name = "血河神剑",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强混乱 = 5,
                加强昏睡 = 5,
                基础攻击 = 1680
            }
        },
        {
            name = "黑魔冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "百裂穿云甲",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [2] = {
        {
            name = "天崩地裂",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强混乱 = 5,
                加强封印 = 5,
                基础攻击 = 1680
            }
        },
        {
            name = "黑魔冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "百裂穿云甲",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [3] = {
        {
            name = "九宫定神斧",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强混乱 = 5,
                加强昏睡 = 5,
                基础攻击 = 1680
            }
        },
        {
            name = "黑魔冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "百裂穿云甲",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [4] = {
        {
            name = "霹雳枪",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强封印 = 5,
                加强毒伤害 = 2500,
                基础攻击 = 1680
            }
        },
        {
            name = "魔女发冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "七宝天衣",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [5] = {
        {
            name = "日月同辉",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强封印 = 5,
                加强毒伤害 = 2500,
                基础攻击 = 1680
            }
        },
        {
            name = "魔女发冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "七宝天衣",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [6] = {
        {
            name = "混元金斗",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强封印 = 5,
                加强毒伤害 = 2500,
                基础攻击 = 1680
            }
        },
        {
            name = "魔女发冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "七宝天衣",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },

    [7] = {
        {
            name = "天罡战刀",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强震慑 = 3,
                加强加攻法术 = 5,
                基础攻击 = 2100
            }
        },
        {
            name = "黑魔冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "百裂穿云甲",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [8] = {
        {
            name = "天罡战刀",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强震慑 = 3,
                加强加攻法术 = 5,
                基础攻击 = 2100
            }
        },
        {
            name = "黑魔冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "百裂穿云甲",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [9] = {
        {
            name = "霹雳枪",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强震慑 = 3,
                加强加攻法术 = 5,
                基础攻击 = 2100
            }
        },
        {
            name = "黑魔冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "百裂穿云甲",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [10] = {
        {
            name = "撕天裂地",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强震慑 = 3,
                加强加防法术 = 5,
                基础攻击 = 2100
            }
        },
        {
            name = "魔女发冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "七宝天衣",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [11] = {
        {
            name = "混元金斗",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强震慑 = 3,
                加强加防法术 = 5,
                基础攻击 = 2100
            }
        },
        {
            name = "魔女发冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "七宝天衣",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [12] = {
        {
            name = "天罡战刀",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强震慑 = 3,
                加强加防法术 = 5,
                基础攻击 = 2100
            }
        },
        {
            name = "魔女发冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "七宝天衣",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [13] = {
        {
            name = "霹雳枪",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强风 = 8,
                加强雷 = 8,
                加强水 = 8,
                基础攻击 = 1250
            }
        },
        {
            name = "黑魔冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "百裂穿云甲",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [14] = {
        {
            name = "混元金斗",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强风 = 8,
                加强雷 = 8,
                加强水 = 8,
                基础攻击 = 1250
            }
        },
        {
            name = "黑魔冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "百裂穿云甲",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [15] = {
        {
            name = "拨云扫月",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强风 = 8,
                加强雷 = 8,
                加强水 = 8,
                基础攻击 = 1250
            }
        },
        {
            name = "黑魔冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "百裂穿云甲",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [16] = {
        {
            name = "捆仙缚魔绫",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强火 = 8,
                加强雷 = 8,
                加强水 = 8,
                基础攻击 = 1250
            }
        },
        {
            name = "魔女发冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "七宝天衣",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [17] = {
        {
            name = "留影之环",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强火 = 8,
                加强雷 = 8,
                加强水 = 8,
                基础攻击 = 1250
            }
        },
        {
            name = "魔女发冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "七宝天衣",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [18] = {
        {
            name = "霹雳枪",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强火 = 8,
                加强雷 = 8,
                加强水 = 8,
                基础攻击 = 1250
            }
        },
        {
            name = "魔女发冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "七宝天衣",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [60] = {
        {
            name = "霹雳枪",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强鬼火 = 8,
                加强三尸虫回血程度 = 10,
                基础攻击 = 1550
            }
        },
        {
            name = "黑魔冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "百裂穿云甲",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [61] = {
        {
            name = "连山之卷",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强鬼火 = 8,
                加强三尸虫回血程度 = 10,
                基础攻击 = 1550
            }
        },
        {
            name = "黑魔冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "百裂穿云甲",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [62] = {
        {
            name = "天罡战刀",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强鬼火 = 8,
                加强三尸虫回血程度 = 10,
                基础攻击 = 1550
            }
        },
        {
            name = "黑魔冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "百裂穿云甲",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [63] = {
        {
            name = "夜明灯笼",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强鬼火 = 8,
                加强遗忘 = 5,
                基础攻击 = 1550
            }
        },
        {
            name = "魔女发冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "七宝天衣",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [64] = {
        {
            name = "捆仙缚魔绫",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强鬼火 = 8,
                加强遗忘 = 5,
                基础攻击 = 1550
            }
        },
        {
            name = "魔女发冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "七宝天衣",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
    [65] = {
        {
            name = "混元索",
            部位 = 5,
            等级需求 = 30,
            属性 = {
                命中率 = 30,
                加强鬼火 = 8,
                加强遗忘 = 5,
                基础攻击 = 1550
            }
        },
        {
            name = "魔女发冠",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = { 水法反击 = 30, 物理吸收 = 40 }
        },
        {
            name = "七宝天衣",
            部位 = 2,
            等级需求 = 30,
            属性要求 = { "力量", 10 },
            属性 = {
                附加攻击 = 500,
                附水攻击 = 30,
                抗混乱 = 45,
                防御 = 1180,
                速度 = -10
            }
        },
        { name = "万里追云履", 部位 = 10, 等级需求 = 30, 属性 = { 速度 = 110 } },
        {
            name = "万里卷云",
            部位 = 4,
            等级需求 = 30,
            属性 = {
                抗混乱 = 37,
                附加气血 = 2800,
                附加魔法 = 2800
            }
        },
    },
}

function NPC:NPC菜单(玩家, i)
    if i == '1' then
    elseif i == '2' then
        local t = _新手装备[玩家.原形]
        if t then
            local list = {}
            for k, v in pairs(t) do
                local r = 生成装备 { 名称 = v.name }
                if r then
                    r.等级需求 = { 0, 30 }
                    if v.属性要求 then
                        r.属性要求 = { "力量", 10 }
                    end
                    r.基本属性 = {}
                    -- r.炼化属性 = {}
                    r.新手装备 = true
                    for a, b in pairs(v.属性) do
                        table.insert(r.基本属性, { a, b })
                    end
                end
                table.insert(list, r)
            end

            玩家:添加物品(list)
        end
    elseif i == '3' then
    elseif i == '4' then
    end
end

return NPC
