local NPC = {}
local 对话 = [[
你想换种族么？想换你就说啊，你不说我怎么知道你想换种族呢？你虽然很有诚意的看着我，但我还是知道你是想换种族的。不可能你想换种族我不给你换啊？你到底要不要换种族呢？
menu
1|我受不了了，我要换种族
2|我想查看当前修正
3|我先了解以下规则先
4|兑换修为加成
99|离开
]]
-- 2|我想重设修正
-- 4|确认本世修正
-- 5|我要开启第二套属性
function NPC:NPC对话(玩家, i)
    return 对话
end

local _整数范围 = {
    根骨 = true,
    灵性 = true,
    敏捷 = true,
    力量 = true,
    基础攻击 = true,
    附加攻击 = true,
    每回合HP = true,
    每回合MP = true,
    速度 = true,
    防御值 = true,
    附加气血 = true,
    附加魔法 = true,
    连击次数 = true,
    反击次数 = true,
    抗毒伤害 = true,
    尘埃落定 = true,
    化血成碧 = true,
    上善若水 = true,
    灵犀一点 = true,
    明珠有泪 = true,
    美人迟暮 = true
}
local _修正 = {
    [1001] = {
        { 抗混乱 = 10.25, 抗封印 = 10.25, 抗昏睡 = 10.25 },
        { 抗混乱 = 15.37, 抗封印 = 15.37, 抗昏睡 = 15.37 },
        { 抗混乱 = 20.5, 抗封印 = 20.5, 抗昏睡 = 20.5 },
        { 抗混乱 = 20.5, 抗封印 = 20.5, 抗昏睡 = 20.5 },
    },
    [1002] = {
        { 抗中毒 = 13.83, 抗毒伤害 = 820, 抗封印 = 10.25, 抗昏睡 = 10.25 },
        { 抗中毒 = 20.83, 抗毒伤害 = 1230, 抗封印 = 15.37, 抗昏睡 = 15.37 },
        { 抗中毒 = 27.67, 抗毒伤害 = 1640, 抗封印 = 20.5, 抗昏睡 = 20.5 },
        { 抗中毒 = 27.67, 抗毒伤害 = 1640, 抗封印 = 20.5, 抗昏睡 = 20.5 },
    },
    [2001] = {
        { HP成长 = 0.082, MP成长 = 0.082, SP成长 = 0.061 },
        { HP成长 = 0.123, MP成长 = 0.123, SP成长 = 0.092 },
        { HP成长 = 0.164, MP成长 = 0.164, SP成长 = 0.123 },
        { HP成长 = 0.164, MP成长 = 0.164, SP成长 = 0.123 },
    },
    [2002] = {
        { HP成长 = 0.082, MP成长 = 0.082, 物理吸收 = 15.37, 抗震慑 = 9.21 },
        { HP成长 = 0.123, MP成长 = 0.123, 物理吸收 = 23.05, 抗震慑 = 13.82 },
        { HP成长 = 0.164, MP成长 = 0.164, 物理吸收 = 30.74, 抗震慑 = 18.42 },
        { HP成长 = 0.164, MP成长 = 0.164, 物理吸收 = 30.74, 抗震慑 = 18.42 },
    },
    [3001] = {
        { 抗水 = 13.83, 抗雷 = 13.83, 抗风 = 13.83 },
        { 抗水 = 20.75, 抗雷 = 20.75, 抗风 = 20.75 },
        { 抗水 = 27.67, 抗雷 = 27.67, 抗风 = 27.67 },
        { 抗水 = 27.67, 抗雷 = 27.67, 抗风 = 27.67 },
    },
    [3002] = {
        { 抗水 = 13.83, 抗雷 = 13.83, 抗火 = 13.83 },
        { 抗水 = 20.75, 抗雷 = 20.75, 抗火 = 20.75 },
        { 抗水 = 27.67, 抗雷 = 27.67, 抗火 = 27.67 },
        { 抗水 = 27.67, 抗雷 = 27.67, 抗火 = 27.67 },
    },
    [4001] = {
        { 抗鬼火 = 13.84, 抗遗忘 = 10.25, 抗三尸虫 = 2050 },
        { 抗鬼火 = 20.76, 抗遗忘 = 15.38, 抗三尸虫 = 3075 },
        { 抗鬼火 = 27.68, 抗遗忘 = 20.5, 抗三尸虫 = 4100 },
        { 抗鬼火 = 27.68, 抗遗忘 = 20.5, 抗三尸虫 = 4100 },
    },
    [4002] = {
        { 抗鬼火 = 13.84, 抗遗忘 = 10.25, 反震率 = 5.13, 反震程度 = 10.25 },
        { 抗鬼火 = 20.76, 抗遗忘 = 15.38, 反震率 = 7.69, 反震程度 = 15.38 },
        { 抗鬼火 = 27.68, 抗遗忘 = 20.5, 反震率 = 10.25, 反震程度 = 20.5 },
        { 抗鬼火 = 27.68, 抗遗忘 = 20.5, 反震率 = 10.25, 反震程度 = 20.5 },
    }
}

function NPC:NPC菜单(玩家, i)
    if i == '1' then
        local 种族, 性别, 外形 = 玩家:换角色窗口(玩家.转生)
        if 种族 then
            local r = 玩家:换角色检测()
            if r then
                return r
            end
            玩家:换角色处理(种族, 性别, 外形)
        end
    elseif i == '2' then
        local t = 玩家:取转生记录()
        if t then
            local list = {}

            for k, v in ipairs(t) do
                if type(v) == "table" then
                    for kx, sz in pairs(_修正[v.种族][k]) do
                        if not list[kx] then
                            list[kx] = 0
                        end
                        if _整数范围[kx] then
                            list[kx] = list[kx] + math.floor(v[kx] * sz)
                        else
                            list[kx] = list[kx] + (math.floor(v[kx] * sz * 1000) * 0.001)
                        end
                    end
                end
            end

            local list2 = {}
            for k, v in pairs(list) do
                if _整数范围[k] then
                    table.insert(list2, k .. ": + " .. v)
                else
                    table.insert(list2, k .. ": + " .. v .. "%")
                end
            end

            return table.concat(list2, "   ")
        end
    elseif i == '3' then
        return "每次转换种族需要500万大话币。"
    elseif i == '4' then
        if 玩家.转生 < 3 then
            return "3转生以后再来吧"
        end
        if 玩家.其它.四维加成 > 2 then
            return "已经达到兑换次数上限"
        end

        if 玩家:取技能数量() < 15 then
            return "先学会所有技能"
        end
        if not 玩家:取所有技能是否满熟练() then
            return "请先将所有技能修炼至满熟练"
        end
        玩家:修改所有技能熟练度(10000)
        玩家.其它.四维加成 = 玩家.其它.四维加成 + 1
        玩家:刷新属性()
        return "兑换成功 你所有技能熟练度降至10000熟练度"
    end
end

return NPC
