local 帮战战况 = 窗口层:创建我的窗口('帮战战况', 0, 0, 498, 317)
function 帮战战况:初始化()
    self:置精灵(__res:getspr('gires2/0xAC0976CA.tcp'))
end

local 文本表 = {'帮派目前参战成员' , '帮派成员胜利场次' , '高手挑战胜利场次' , '能量塔发动攻击数' , '龙神大炮开炮次数' , '本帮杀敌最高成员' , '本人杀敌'}

for k,v in pairs(文本表) do
    if v == '本帮杀敌最高成员' then
        local 文本 = 帮战战况:创建文本('我方'..v..'文本', 192, 96 + (k - 1) * 30, 100, 18)
        文本:置文字(__res.汉仪小隶书简18号)
    else
        local 文本 = 帮战战况:创建文本('我方'..v..'文本', 230, 96 + (k - 1) * 30, 50, 18)
        文本:置文字(__res.汉仪小隶书简20号)
    end
end
local 名称文本 = 帮战战况:创建文本('我方帮派名称文本', 214, 75, 100, 18)
名称文本:置文字(__res.汉仪小隶书简18号)

for k,v in pairs(文本表) do
    if v == '本帮杀敌最高成员' then
        local 文本 = 帮战战况:创建文本('敌方'..v..'文本', 339, 96 + (k - 1) * 30, 100, 18)
        文本:置文字(__res.汉仪小隶书简18号)
    else
        local 文本 = 帮战战况:创建文本('敌方'..v..'文本', 377, 96 + (k - 1) * 30, 50, 18)
        文本:置文字(__res.汉仪小隶书简20号)
    end
end
local 名称文本 = 帮战战况:创建文本('敌方帮派名称文本', 368, 75, 100, 18)
名称文本:置文字(__res.汉仪小隶书简18号)

function 帮战战况:置我方(数据,对比)
    self.我方帮派名称文本:置文本('#Y'..数据.名称)
    for k,v in pairs(文本表) do
        if 数据[v] > 对比[v] then
            self['我方'..v..'文本']:置文本('#R'..数据[v])
        else
            self['我方'..v..'文本']:置文本(数据[v])
        end
    end
end

function 帮战战况:置敌方(数据,对比)
    self.敌方帮派名称文本:置文本('#Y'..数据.名称)
    for k,v in pairs(文本表) do
        if 数据[v] > 对比[v] then
            self['敌方'..v..'文本']:置文本('#R'..数据[v])
        else
            self['敌方'..v..'文本']:置文本(数据[v])
        end
    end
end



function 窗口层:打开帮战战况(w , t)
    帮战战况:置可见(not 帮战战况.是否可见)
    if not 帮战战况.是否可见 then
        return
    end
    帮战战况:置坐标((引擎.宽度 - 帮战战况.宽度) // 2, (引擎.高度 - 帮战战况.高度) // 2)
    帮战战况:置我方(w , t)
    帮战战况:置敌方(t , w)
end